export default [
    {
        "id": 150000,
        "code": 150000,
        "pid": 0,
        "level": 0,
        "name": "内蒙古自治区"
    },
    {
        "id": 150300,
        "code": 150300,
        "pid": 150000,
        "level": 1,
        "name": "乌海市"
    },
    {
        "id": 150303,
        "code": 150303,
        "pid": 150300,
        "level": 2,
        "name": "海南区"
    },
    {
        "id": 150302,
        "code": 150302,
        "pid": 150300,
        "level": 2,
        "name": "海勃湾区"
    },
    {
        "id": 150304,
        "code": 150304,
        "pid": 150300,
        "level": 2,
        "name": "乌达区"
    },
    {
        "id": 152200,
        "code": 152200,
        "pid": 150000,
        "level": 1,
        "name": "兴安盟"
    },
    {
        "id": 152201,
        "code": 152201,
        "pid": 152200,
        "level": 2,
        "name": "乌兰浩特市"
    },
    {
        "id": 152202,
        "code": 152202,
        "pid": 152200,
        "level": 2,
        "name": "阿尔山市"
    },
    {
        "id": 152222,
        "code": 152222,
        "pid": 152200,
        "level": 2,
        "name": "科尔沁右翼中旗"
    },
    {
        "id": 152223,
        "code": 152223,
        "pid": 152200,
        "level": 2,
        "name": "扎赉特旗"
    },
    {
        "id": 152221,
        "code": 152221,
        "pid": 152200,
        "level": 2,
        "name": "科尔沁右翼前旗"
    },
    {
        "id": 152224,
        "code": 152224,
        "pid": 152200,
        "level": 2,
        "name": "突泉县"
    },
    {
        "id": 152900,
        "code": 152900,
        "pid": 150000,
        "level": 1,
        "name": "阿拉善盟"
    },
    {
        "id": 152921,
        "code": 152921,
        "pid": 152900,
        "level": 2,
        "name": "阿拉善左旗"
    },
    {
        "id": 152923,
        "code": 152923,
        "pid": 152900,
        "level": 2,
        "name": "额济纳旗"
    },
    {
        "id": 152922,
        "code": 152922,
        "pid": 152900,
        "level": 2,
        "name": "阿拉善右旗"
    },
    {
        "id": 150800,
        "code": 150800,
        "pid": 150000,
        "level": 1,
        "name": "巴彦淖尔市"
    },
    {
        "id": 150826,
        "code": 150826,
        "pid": 150800,
        "level": 2,
        "name": "杭锦后旗"
    },
    {
        "id": 150824,
        "code": 150824,
        "pid": 150800,
        "level": 2,
        "name": "乌拉特中旗"
    },
    {
        "id": 150825,
        "code": 150825,
        "pid": 150800,
        "level": 2,
        "name": "乌拉特后旗"
    },
    {
        "id": 150822,
        "code": 150822,
        "pid": 150800,
        "level": 2,
        "name": "磴口县"
    },
    {
        "id": 150823,
        "code": 150823,
        "pid": 150800,
        "level": 2,
        "name": "乌拉特前旗"
    },
    {
        "id": 150821,
        "code": 150821,
        "pid": 150800,
        "level": 2,
        "name": "五原县"
    },
    {
        "id": 150802,
        "code": 150802,
        "pid": 150800,
        "level": 2,
        "name": "临河区"
    },
    {
        "id": 150100,
        "code": 150100,
        "pid": 150000,
        "level": 1,
        "name": "呼和浩特市"
    },
    {
        "id": 150103,
        "code": 150103,
        "pid": 150100,
        "level": 2,
        "name": "回民区"
    },
    {
        "id": 150102,
        "code": 150102,
        "pid": 150100,
        "level": 2,
        "name": "新城区"
    },
    {
        "id": 150105,
        "code": 150105,
        "pid": 150100,
        "level": 2,
        "name": "赛罕区"
    },
    {
        "id": 150104,
        "code": 150104,
        "pid": 150100,
        "level": 2,
        "name": "玉泉区"
    },
    {
        "id": 150123,
        "code": 150123,
        "pid": 150100,
        "level": 2,
        "name": "和林格尔县"
    },
    {
        "id": 150122,
        "code": 150122,
        "pid": 150100,
        "level": 2,
        "name": "托克托县"
    },
    {
        "id": 150121,
        "code": 150121,
        "pid": 150100,
        "level": 2,
        "name": "土默特左旗"
    },
    {
        "id": 150125,
        "code": 150125,
        "pid": 150100,
        "level": 2,
        "name": "武川县"
    },
    {
        "id": 150124,
        "code": 150124,
        "pid": 150100,
        "level": 2,
        "name": "清水河县"
    },
    {
        "id": 150500,
        "code": 150500,
        "pid": 150000,
        "level": 1,
        "name": "通辽市"
    },
    {
        "id": 150502,
        "code": 150502,
        "pid": 150500,
        "level": 2,
        "name": "科尔沁区"
    },
    {
        "id": 150526,
        "code": 150526,
        "pid": 150500,
        "level": 2,
        "name": "扎鲁特旗"
    },
    {
        "id": 150525,
        "code": 150525,
        "pid": 150500,
        "level": 2,
        "name": "奈曼旗"
    },
    {
        "id": 150524,
        "code": 150524,
        "pid": 150500,
        "level": 2,
        "name": "库伦旗"
    },
    {
        "id": 150523,
        "code": 150523,
        "pid": 150500,
        "level": 2,
        "name": "开鲁县"
    },
    {
        "id": 150522,
        "code": 150522,
        "pid": 150500,
        "level": 2,
        "name": "科尔沁左翼后旗"
    },
    {
        "id": 150521,
        "code": 150521,
        "pid": 150500,
        "level": 2,
        "name": "科尔沁左翼中旗"
    },
    {
        "id": 150581,
        "code": 150581,
        "pid": 150500,
        "level": 2,
        "name": "霍林郭勒市"
    },
    {
        "id": 150900,
        "code": 150900,
        "pid": 150000,
        "level": 1,
        "name": "乌兰察布市"
    },
    {
        "id": 150902,
        "code": 150902,
        "pid": 150900,
        "level": 2,
        "name": "集宁区"
    },
    {
        "id": 150923,
        "code": 150923,
        "pid": 150900,
        "level": 2,
        "name": "商都县"
    },
    {
        "id": 150929,
        "code": 150929,
        "pid": 150900,
        "level": 2,
        "name": "四子王旗"
    },
    {
        "id": 150928,
        "code": 150928,
        "pid": 150900,
        "level": 2,
        "name": "察哈尔右翼后旗"
    },
    {
        "id": 150981,
        "code": 150981,
        "pid": 150900,
        "level": 2,
        "name": "丰镇市"
    },
    {
        "id": 150922,
        "code": 150922,
        "pid": 150900,
        "level": 2,
        "name": "化德县"
    },
    {
        "id": 150921,
        "code": 150921,
        "pid": 150900,
        "level": 2,
        "name": "卓资县"
    },
    {
        "id": 150927,
        "code": 150927,
        "pid": 150900,
        "level": 2,
        "name": "察哈尔右翼中旗"
    },
    {
        "id": 150926,
        "code": 150926,
        "pid": 150900,
        "level": 2,
        "name": "察哈尔右翼前旗"
    },
    {
        "id": 150925,
        "code": 150925,
        "pid": 150900,
        "level": 2,
        "name": "凉城县"
    },
    {
        "id": 150924,
        "code": 150924,
        "pid": 150900,
        "level": 2,
        "name": "兴和县"
    },
    {
        "id": 150200,
        "code": 150200,
        "pid": 150000,
        "level": 1,
        "name": "包头市"
    },
    {
        "id": 150202,
        "code": 150202,
        "pid": 150200,
        "level": 2,
        "name": "东河区"
    },
    {
        "id": 150203,
        "code": 150203,
        "pid": 150200,
        "level": 2,
        "name": "昆都仑区"
    },
    {
        "id": 150206,
        "code": 150206,
        "pid": 150200,
        "level": 2,
        "name": "白云鄂博矿区"
    },
    {
        "id": 150207,
        "code": 150207,
        "pid": 150200,
        "level": 2,
        "name": "九原区"
    },
    {
        "id": 150204,
        "code": 150204,
        "pid": 150200,
        "level": 2,
        "name": "青山区"
    },
    {
        "id": 150205,
        "code": 150205,
        "pid": 150200,
        "level": 2,
        "name": "石拐区"
    },
    {
        "id": 150221,
        "code": 150221,
        "pid": 150200,
        "level": 2,
        "name": "土默特右旗"
    },
    {
        "id": 150222,
        "code": 150222,
        "pid": 150200,
        "level": 2,
        "name": "固阳县"
    },
    {
        "id": 150223,
        "code": 150223,
        "pid": 150200,
        "level": 2,
        "name": "达尔罕茂明安联合旗"
    },
    {
        "id": 150600,
        "code": 150600,
        "pid": 150000,
        "level": 1,
        "name": "鄂尔多斯市"
    },
    {
        "id": 150621,
        "code": 150621,
        "pid": 150600,
        "level": 2,
        "name": "达拉特旗"
    },
    {
        "id": 150622,
        "code": 150622,
        "pid": 150600,
        "level": 2,
        "name": "准格尔旗"
    },
    {
        "id": 150623,
        "code": 150623,
        "pid": 150600,
        "level": 2,
        "name": "鄂托克前旗"
    },
    {
        "id": 150602,
        "code": 150602,
        "pid": 150600,
        "level": 2,
        "name": "东胜区"
    },
    {
        "id": 150603,
        "code": 150603,
        "pid": 150600,
        "level": 2,
        "name": "康巴什区"
    },
    {
        "id": 150626,
        "code": 150626,
        "pid": 150600,
        "level": 2,
        "name": "乌审旗"
    },
    {
        "id": 150627,
        "code": 150627,
        "pid": 150600,
        "level": 2,
        "name": "伊金霍洛旗"
    },
    {
        "id": 150624,
        "code": 150624,
        "pid": 150600,
        "level": 2,
        "name": "鄂托克旗"
    },
    {
        "id": 150625,
        "code": 150625,
        "pid": 150600,
        "level": 2,
        "name": "杭锦旗"
    },
    {
        "id": 150400,
        "code": 150400,
        "pid": 150000,
        "level": 1,
        "name": "赤峰市"
    },
    {
        "id": 150404,
        "code": 150404,
        "pid": 150400,
        "level": 2,
        "name": "松山区"
    },
    {
        "id": 150402,
        "code": 150402,
        "pid": 150400,
        "level": 2,
        "name": "红山区"
    },
    {
        "id": 150403,
        "code": 150403,
        "pid": 150400,
        "level": 2,
        "name": "元宝山区"
    },
    {
        "id": 150428,
        "code": 150428,
        "pid": 150400,
        "level": 2,
        "name": "喀喇沁旗"
    },
    {
        "id": 150429,
        "code": 150429,
        "pid": 150400,
        "level": 2,
        "name": "宁城县"
    },
    {
        "id": 150430,
        "code": 150430,
        "pid": 150400,
        "level": 2,
        "name": "敖汉旗"
    },
    {
        "id": 150422,
        "code": 150422,
        "pid": 150400,
        "level": 2,
        "name": "巴林左旗"
    },
    {
        "id": 150423,
        "code": 150423,
        "pid": 150400,
        "level": 2,
        "name": "巴林右旗"
    },
    {
        "id": 150421,
        "code": 150421,
        "pid": 150400,
        "level": 2,
        "name": "阿鲁科尔沁旗"
    },
    {
        "id": 150426,
        "code": 150426,
        "pid": 150400,
        "level": 2,
        "name": "翁牛特旗"
    },
    {
        "id": 150424,
        "code": 150424,
        "pid": 150400,
        "level": 2,
        "name": "林西县"
    },
    {
        "id": 150425,
        "code": 150425,
        "pid": 150400,
        "level": 2,
        "name": "克什克腾旗"
    },
    {
        "id": 152500,
        "code": 152500,
        "pid": 150000,
        "level": 1,
        "name": "锡林郭勒盟"
    },
    {
        "id": 152502,
        "code": 152502,
        "pid": 152500,
        "level": 2,
        "name": "锡林浩特市"
    },
    {
        "id": 152531,
        "code": 152531,
        "pid": 152500,
        "level": 2,
        "name": "多伦县"
    },
    {
        "id": 152530,
        "code": 152530,
        "pid": 152500,
        "level": 2,
        "name": "正蓝旗"
    },
    {
        "id": 152523,
        "code": 152523,
        "pid": 152500,
        "level": 2,
        "name": "苏尼特左旗"
    },
    {
        "id": 152522,
        "code": 152522,
        "pid": 152500,
        "level": 2,
        "name": "阿巴嘎旗"
    },
    {
        "id": 152525,
        "code": 152525,
        "pid": 152500,
        "level": 2,
        "name": "东乌珠穆沁旗"
    },
    {
        "id": 152524,
        "code": 152524,
        "pid": 152500,
        "level": 2,
        "name": "苏尼特右旗"
    },
    {
        "id": 152527,
        "code": 152527,
        "pid": 152500,
        "level": 2,
        "name": "太仆寺旗"
    },
    {
        "id": 152526,
        "code": 152526,
        "pid": 152500,
        "level": 2,
        "name": "西乌珠穆沁旗"
    },
    {
        "id": 152529,
        "code": 152529,
        "pid": 152500,
        "level": 2,
        "name": "正镶白旗"
    },
    {
        "id": 152528,
        "code": 152528,
        "pid": 152500,
        "level": 2,
        "name": "镶黄旗"
    },
    {
        "id": 152501,
        "code": 152501,
        "pid": 152500,
        "level": 2,
        "name": "二连浩特市"
    },
    {
        "id": 150700,
        "code": 150700,
        "pid": 150000,
        "level": 1,
        "name": "呼伦贝尔市"
    },
    {
        "id": 150781,
        "code": 150781,
        "pid": 150700,
        "level": 2,
        "name": "满洲里市"
    },
    {
        "id": 150785,
        "code": 150785,
        "pid": 150700,
        "level": 2,
        "name": "根河市"
    },
    {
        "id": 150726,
        "code": 150726,
        "pid": 150700,
        "level": 2,
        "name": "新巴尔虎左旗"
    },
    {
        "id": 150725,
        "code": 150725,
        "pid": 150700,
        "level": 2,
        "name": "陈巴尔虎旗"
    },
    {
        "id": 150724,
        "code": 150724,
        "pid": 150700,
        "level": 2,
        "name": "鄂温克族自治旗"
    },
    {
        "id": 150727,
        "code": 150727,
        "pid": 150700,
        "level": 2,
        "name": "新巴尔虎右旗"
    },
    {
        "id": 150784,
        "code": 150784,
        "pid": 150700,
        "level": 2,
        "name": "额尔古纳市"
    },
    {
        "id": 150721,
        "code": 150721,
        "pid": 150700,
        "level": 2,
        "name": "阿荣旗"
    },
    {
        "id": 150782,
        "code": 150782,
        "pid": 150700,
        "level": 2,
        "name": "牙克石市"
    },
    {
        "id": 150723,
        "code": 150723,
        "pid": 150700,
        "level": 2,
        "name": "鄂伦春自治旗"
    },
    {
        "id": 150722,
        "code": 150722,
        "pid": 150700,
        "level": 2,
        "name": "莫力达瓦达斡尔族自治旗"
    },
    {
        "id": 150783,
        "code": 150783,
        "pid": 150700,
        "level": 2,
        "name": "扎兰屯市"
    },
    {
        "id": 150703,
        "code": 150703,
        "pid": 150700,
        "level": 2,
        "name": "扎赉诺尔区"
    },
    {
        "id": 150702,
        "code": 150702,
        "pid": 150700,
        "level": 2,
        "name": "海拉尔区"
    },
    {
        "id": 110000,
        "code": 110000,
        "pid": 0,
        "level": 0,
        "name": "北京市"
    },
    {
        "id": 110106,
        "code": 110106,
        "pid": 110000,
        "level": 2,
        "name": "丰台区"
    },
    {
        "id": 110109,
        "code": 110109,
        "pid": 110000,
        "level": 2,
        "name": "门头沟区"
    },
    {
        "id": 110108,
        "code": 110108,
        "pid": 110000,
        "level": 2,
        "name": "海淀区"
    },
    {
        "id": 110118,
        "code": 110118,
        "pid": 110000,
        "level": 2,
        "name": "密云区"
    },
    {
        "id": 110119,
        "code": 110119,
        "pid": 110000,
        "level": 2,
        "name": "延庆区"
    },
    {
        "id": 110116,
        "code": 110116,
        "pid": 110000,
        "level": 2,
        "name": "怀柔区"
    },
    {
        "id": 110117,
        "code": 110117,
        "pid": 110000,
        "level": 2,
        "name": "平谷区"
    },
    {
        "id": 110114,
        "code": 110114,
        "pid": 110000,
        "level": 2,
        "name": "昌平区"
    },
    {
        "id": 110115,
        "code": 110115,
        "pid": 110000,
        "level": 2,
        "name": "大兴区"
    },
    {
        "id": 110112,
        "code": 110112,
        "pid": 110000,
        "level": 2,
        "name": "通州区"
    },
    {
        "id": 110113,
        "code": 110113,
        "pid": 110000,
        "level": 2,
        "name": "顺义区"
    },
    {
        "id": 110102,
        "code": 110102,
        "pid": 110000,
        "level": 2,
        "name": "西城区"
    },
    {
        "id": 110105,
        "code": 110105,
        "pid": 110000,
        "level": 2,
        "name": "朝阳区"
    },
    {
        "id": 110101,
        "code": 110101,
        "pid": 110000,
        "level": 2,
        "name": "东城区"
    },
    {
        "id": 110111,
        "code": 110111,
        "pid": 110000,
        "level": 2,
        "name": "房山区"
    },
    {
        "id": 110107,
        "code": 110107,
        "pid": 110000,
        "level": 2,
        "name": "石景山区"
    },
    {
        "id": 420000,
        "code": 420000,
        "pid": 0,
        "level": 0,
        "name": "湖北省"
    },
    {
        "id": 420800,
        "code": 420800,
        "pid": 420000,
        "level": 1,
        "name": "荆门市"
    },
    {
        "id": 420881,
        "code": 420881,
        "pid": 420800,
        "level": 2,
        "name": "钟祥市"
    },
    {
        "id": 420802,
        "code": 420802,
        "pid": 420800,
        "level": 2,
        "name": "东宝区"
    },
    {
        "id": 420804,
        "code": 420804,
        "pid": 420800,
        "level": 2,
        "name": "掇刀区"
    },
    {
        "id": 420822,
        "code": 420822,
        "pid": 420800,
        "level": 2,
        "name": "沙洋县"
    },
    {
        "id": 420821,
        "code": 420821,
        "pid": 420800,
        "level": 2,
        "name": "京山县"
    },
    {
        "id": 420300,
        "code": 420300,
        "pid": 420000,
        "level": 1,
        "name": "十堰市"
    },
    {
        "id": 420303,
        "code": 420303,
        "pid": 420300,
        "level": 2,
        "name": "张湾区"
    },
    {
        "id": 420302,
        "code": 420302,
        "pid": 420300,
        "level": 2,
        "name": "茅箭区"
    },
    {
        "id": 420304,
        "code": 420304,
        "pid": 420300,
        "level": 2,
        "name": "郧阳区"
    },
    {
        "id": 420381,
        "code": 420381,
        "pid": 420300,
        "level": 2,
        "name": "丹江口市"
    },
    {
        "id": 420323,
        "code": 420323,
        "pid": 420300,
        "level": 2,
        "name": "竹山县"
    },
    {
        "id": 420322,
        "code": 420322,
        "pid": 420300,
        "level": 2,
        "name": "郧西县"
    },
    {
        "id": 420325,
        "code": 420325,
        "pid": 420300,
        "level": 2,
        "name": "房县"
    },
    {
        "id": 420324,
        "code": 420324,
        "pid": 420300,
        "level": 2,
        "name": "竹溪县"
    },
    {
        "id": 421100,
        "code": 421100,
        "pid": 420000,
        "level": 1,
        "name": "黄冈市"
    },
    {
        "id": 421121,
        "code": 421121,
        "pid": 421100,
        "level": 2,
        "name": "团风县"
    },
    {
        "id": 421122,
        "code": 421122,
        "pid": 421100,
        "level": 2,
        "name": "红安县"
    },
    {
        "id": 421123,
        "code": 421123,
        "pid": 421100,
        "level": 2,
        "name": "罗田县"
    },
    {
        "id": 421124,
        "code": 421124,
        "pid": 421100,
        "level": 2,
        "name": "英山县"
    },
    {
        "id": 421125,
        "code": 421125,
        "pid": 421100,
        "level": 2,
        "name": "浠水县"
    },
    {
        "id": 421126,
        "code": 421126,
        "pid": 421100,
        "level": 2,
        "name": "蕲春县"
    },
    {
        "id": 421127,
        "code": 421127,
        "pid": 421100,
        "level": 2,
        "name": "黄梅县"
    },
    {
        "id": 421102,
        "code": 421102,
        "pid": 421100,
        "level": 2,
        "name": "黄州区"
    },
    {
        "id": 421182,
        "code": 421182,
        "pid": 421100,
        "level": 2,
        "name": "武穴市"
    },
    {
        "id": 421181,
        "code": 421181,
        "pid": 421100,
        "level": 2,
        "name": "麻城市"
    },
    {
        "id": 420700,
        "code": 420700,
        "pid": 420000,
        "level": 1,
        "name": "鄂州市"
    },
    {
        "id": 420704,
        "code": 420704,
        "pid": 420700,
        "level": 2,
        "name": "鄂城区"
    },
    {
        "id": 420703,
        "code": 420703,
        "pid": 420700,
        "level": 2,
        "name": "华容区"
    },
    {
        "id": 420702,
        "code": 420702,
        "pid": 420700,
        "level": 2,
        "name": "梁子湖区"
    },
    {
        "id": 420900,
        "code": 420900,
        "pid": 420000,
        "level": 1,
        "name": "孝感市"
    },
    {
        "id": 420981,
        "code": 420981,
        "pid": 420900,
        "level": 2,
        "name": "应城市"
    },
    {
        "id": 420982,
        "code": 420982,
        "pid": 420900,
        "level": 2,
        "name": "安陆市"
    },
    {
        "id": 420984,
        "code": 420984,
        "pid": 420900,
        "level": 2,
        "name": "汉川市"
    },
    {
        "id": 420902,
        "code": 420902,
        "pid": 420900,
        "level": 2,
        "name": "孝南区"
    },
    {
        "id": 420923,
        "code": 420923,
        "pid": 420900,
        "level": 2,
        "name": "云梦县"
    },
    {
        "id": 420922,
        "code": 420922,
        "pid": 420900,
        "level": 2,
        "name": "大悟县"
    },
    {
        "id": 420921,
        "code": 420921,
        "pid": 420900,
        "level": 2,
        "name": "孝昌县"
    },
    {
        "id": 421000,
        "code": 421000,
        "pid": 420000,
        "level": 1,
        "name": "荆州市"
    },
    {
        "id": 421087,
        "code": 421087,
        "pid": 421000,
        "level": 2,
        "name": "松滋市"
    },
    {
        "id": 421024,
        "code": 421024,
        "pid": 421000,
        "level": 2,
        "name": "江陵县"
    },
    {
        "id": 421083,
        "code": 421083,
        "pid": 421000,
        "level": 2,
        "name": "洪湖市"
    },
    {
        "id": 421023,
        "code": 421023,
        "pid": 421000,
        "level": 2,
        "name": "监利县"
    },
    {
        "id": 421081,
        "code": 421081,
        "pid": 421000,
        "level": 2,
        "name": "石首市"
    },
    {
        "id": 421022,
        "code": 421022,
        "pid": 421000,
        "level": 2,
        "name": "公安县"
    },
    {
        "id": 421003,
        "code": 421003,
        "pid": 421000,
        "level": 2,
        "name": "荆州区"
    },
    {
        "id": 421002,
        "code": 421002,
        "pid": 421000,
        "level": 2,
        "name": "沙市区"
    },
    {
        "id": 420100,
        "code": 420100,
        "pid": 420000,
        "level": 1,
        "name": "武汉市"
    },
    {
        "id": 420111,
        "code": 420111,
        "pid": 420100,
        "level": 2,
        "name": "洪山区"
    },
    {
        "id": 420114,
        "code": 420114,
        "pid": 420100,
        "level": 2,
        "name": "蔡甸区"
    },
    {
        "id": 420115,
        "code": 420115,
        "pid": 420100,
        "level": 2,
        "name": "江夏区"
    },
    {
        "id": 420112,
        "code": 420112,
        "pid": 420100,
        "level": 2,
        "name": "东西湖区"
    },
    {
        "id": 420113,
        "code": 420113,
        "pid": 420100,
        "level": 2,
        "name": "汉南区"
    },
    {
        "id": 420103,
        "code": 420103,
        "pid": 420100,
        "level": 2,
        "name": "江汉区"
    },
    {
        "id": 420102,
        "code": 420102,
        "pid": 420100,
        "level": 2,
        "name": "江岸区"
    },
    {
        "id": 420105,
        "code": 420105,
        "pid": 420100,
        "level": 2,
        "name": "汉阳区"
    },
    {
        "id": 420104,
        "code": 420104,
        "pid": 420100,
        "level": 2,
        "name": "硚口区"
    },
    {
        "id": 420107,
        "code": 420107,
        "pid": 420100,
        "level": 2,
        "name": "青山区"
    },
    {
        "id": 420106,
        "code": 420106,
        "pid": 420100,
        "level": 2,
        "name": "武昌区"
    },
    {
        "id": 420116,
        "code": 420116,
        "pid": 420100,
        "level": 2,
        "name": "黄陂区"
    },
    {
        "id": 420117,
        "code": 420117,
        "pid": 420100,
        "level": 2,
        "name": "新洲区"
    },
    {
        "id": 421300,
        "code": 421300,
        "pid": 420000,
        "level": 1,
        "name": "随州市"
    },
    {
        "id": 421321,
        "code": 421321,
        "pid": 421300,
        "level": 2,
        "name": "随县"
    },
    {
        "id": 421381,
        "code": 421381,
        "pid": 421300,
        "level": 2,
        "name": "广水市"
    },
    {
        "id": 421303,
        "code": 421303,
        "pid": 421300,
        "level": 2,
        "name": "曾都区"
    },
    {
        "id": 420500,
        "code": 420500,
        "pid": 420000,
        "level": 1,
        "name": "宜昌市"
    },
    {
        "id": 420503,
        "code": 420503,
        "pid": 420500,
        "level": 2,
        "name": "伍家岗区"
    },
    {
        "id": 420502,
        "code": 420502,
        "pid": 420500,
        "level": 2,
        "name": "西陵区"
    },
    {
        "id": 420581,
        "code": 420581,
        "pid": 420500,
        "level": 2,
        "name": "宜都市"
    },
    {
        "id": 420583,
        "code": 420583,
        "pid": 420500,
        "level": 2,
        "name": "枝江市"
    },
    {
        "id": 420582,
        "code": 420582,
        "pid": 420500,
        "level": 2,
        "name": "当阳市"
    },
    {
        "id": 420505,
        "code": 420505,
        "pid": 420500,
        "level": 2,
        "name": "猇亭区"
    },
    {
        "id": 420504,
        "code": 420504,
        "pid": 420500,
        "level": 2,
        "name": "点军区"
    },
    {
        "id": 420506,
        "code": 420506,
        "pid": 420500,
        "level": 2,
        "name": "夷陵区"
    },
    {
        "id": 420529,
        "code": 420529,
        "pid": 420500,
        "level": 2,
        "name": "五峰土家族自治县"
    },
    {
        "id": 420528,
        "code": 420528,
        "pid": 420500,
        "level": 2,
        "name": "长阳土家族自治县"
    },
    {
        "id": 420527,
        "code": 420527,
        "pid": 420500,
        "level": 2,
        "name": "秭归县"
    },
    {
        "id": 420526,
        "code": 420526,
        "pid": 420500,
        "level": 2,
        "name": "兴山县"
    },
    {
        "id": 420525,
        "code": 420525,
        "pid": 420500,
        "level": 2,
        "name": "远安县"
    },
    {
        "id": 422800,
        "code": 422800,
        "pid": 420000,
        "level": 1,
        "name": "恩施土家族苗族自治州"
    },
    {
        "id": 422801,
        "code": 422801,
        "pid": 422800,
        "level": 2,
        "name": "恩施市"
    },
    {
        "id": 422822,
        "code": 422822,
        "pid": 422800,
        "level": 2,
        "name": "建始县"
    },
    {
        "id": 422823,
        "code": 422823,
        "pid": 422800,
        "level": 2,
        "name": "巴东县"
    },
    {
        "id": 422802,
        "code": 422802,
        "pid": 422800,
        "level": 2,
        "name": "利川市"
    },
    {
        "id": 422825,
        "code": 422825,
        "pid": 422800,
        "level": 2,
        "name": "宣恩县"
    },
    {
        "id": 422826,
        "code": 422826,
        "pid": 422800,
        "level": 2,
        "name": "咸丰县"
    },
    {
        "id": 422827,
        "code": 422827,
        "pid": 422800,
        "level": 2,
        "name": "来凤县"
    },
    {
        "id": 422828,
        "code": 422828,
        "pid": 422800,
        "level": 2,
        "name": "鹤峰县"
    },
    {
        "id": 429000,
        "code": 429000,
        "pid": 420000,
        "level": 1,
        "name": "直辖县市"
    },
    {
        "id": 429006,
        "code": 429006,
        "pid": 429000,
        "level": 2,
        "name": "天门市"
    },
    {
        "id": 429005,
        "code": 429005,
        "pid": 429000,
        "level": 2,
        "name": "潜江市"
    },
    {
        "id": 429004,
        "code": 429004,
        "pid": 429000,
        "level": 2,
        "name": "仙桃市"
    },
    {
        "id": 429021,
        "code": 429021,
        "pid": 429000,
        "level": 2,
        "name": "神农架林区"
    },
    {
        "id": 420200,
        "code": 420200,
        "pid": 420000,
        "level": 1,
        "name": "黄石市"
    },
    {
        "id": 420222,
        "code": 420222,
        "pid": 420200,
        "level": 2,
        "name": "阳新县"
    },
    {
        "id": 420281,
        "code": 420281,
        "pid": 420200,
        "level": 2,
        "name": "大冶市"
    },
    {
        "id": 420202,
        "code": 420202,
        "pid": 420200,
        "level": 2,
        "name": "黄石港区"
    },
    {
        "id": 420203,
        "code": 420203,
        "pid": 420200,
        "level": 2,
        "name": "西塞山区"
    },
    {
        "id": 420204,
        "code": 420204,
        "pid": 420200,
        "level": 2,
        "name": "下陆区"
    },
    {
        "id": 420205,
        "code": 420205,
        "pid": 420200,
        "level": 2,
        "name": "铁山区"
    },
    {
        "id": 421200,
        "code": 421200,
        "pid": 420000,
        "level": 1,
        "name": "咸宁市"
    },
    {
        "id": 421224,
        "code": 421224,
        "pid": 421200,
        "level": 2,
        "name": "通山县"
    },
    {
        "id": 421223,
        "code": 421223,
        "pid": 421200,
        "level": 2,
        "name": "崇阳县"
    },
    {
        "id": 421222,
        "code": 421222,
        "pid": 421200,
        "level": 2,
        "name": "通城县"
    },
    {
        "id": 421221,
        "code": 421221,
        "pid": 421200,
        "level": 2,
        "name": "嘉鱼县"
    },
    {
        "id": 421281,
        "code": 421281,
        "pid": 421200,
        "level": 2,
        "name": "赤壁市"
    },
    {
        "id": 421202,
        "code": 421202,
        "pid": 421200,
        "level": 2,
        "name": "咸安区"
    },
    {
        "id": 420600,
        "code": 420600,
        "pid": 420000,
        "level": 1,
        "name": "襄阳市"
    },
    {
        "id": 420684,
        "code": 420684,
        "pid": 420600,
        "level": 2,
        "name": "宜城市"
    },
    {
        "id": 420682,
        "code": 420682,
        "pid": 420600,
        "level": 2,
        "name": "老河口市"
    },
    {
        "id": 420683,
        "code": 420683,
        "pid": 420600,
        "level": 2,
        "name": "枣阳市"
    },
    {
        "id": 420602,
        "code": 420602,
        "pid": 420600,
        "level": 2,
        "name": "襄城区"
    },
    {
        "id": 420606,
        "code": 420606,
        "pid": 420600,
        "level": 2,
        "name": "樊城区"
    },
    {
        "id": 420607,
        "code": 420607,
        "pid": 420600,
        "level": 2,
        "name": "襄州区"
    },
    {
        "id": 420624,
        "code": 420624,
        "pid": 420600,
        "level": 2,
        "name": "南漳县"
    },
    {
        "id": 420625,
        "code": 420625,
        "pid": 420600,
        "level": 2,
        "name": "谷城县"
    },
    {
        "id": 420626,
        "code": 420626,
        "pid": 420600,
        "level": 2,
        "name": "保康县"
    },
    {
        "id": 460000,
        "code": 460000,
        "pid": 0,
        "level": 0,
        "name": "海南省"
    },
    {
        "id": 460400,
        "code": 460400,
        "pid": 460000,
        "level": 1,
        "name": "儋州市"
    },
    {
        "id": 469000,
        "code": 469000,
        "pid": 460000,
        "level": 1,
        "name": "直辖县市"
    },
    {
        "id": 469021,
        "code": 469021,
        "pid": 469000,
        "level": 2,
        "name": "定安县"
    },
    {
        "id": 469030,
        "code": 469030,
        "pid": 469000,
        "level": 2,
        "name": "琼中黎族苗族自治县"
    },
    {
        "id": 469022,
        "code": 469022,
        "pid": 469000,
        "level": 2,
        "name": "屯昌县"
    },
    {
        "id": 469025,
        "code": 469025,
        "pid": 469000,
        "level": 2,
        "name": "白沙黎族自治县"
    },
    {
        "id": 469024,
        "code": 469024,
        "pid": 469000,
        "level": 2,
        "name": "临高县"
    },
    {
        "id": 469027,
        "code": 469027,
        "pid": 469000,
        "level": 2,
        "name": "乐东黎族自治县"
    },
    {
        "id": 469026,
        "code": 469026,
        "pid": 469000,
        "level": 2,
        "name": "昌江黎族自治县"
    },
    {
        "id": 469029,
        "code": 469029,
        "pid": 469000,
        "level": 2,
        "name": "保亭黎族苗族自治县"
    },
    {
        "id": 469028,
        "code": 469028,
        "pid": 469000,
        "level": 2,
        "name": "陵水黎族自治县"
    },
    {
        "id": 469001,
        "code": 469001,
        "pid": 469000,
        "level": 2,
        "name": "五指山市"
    },
    {
        "id": 469007,
        "code": 469007,
        "pid": 469000,
        "level": 2,
        "name": "东方市"
    },
    {
        "id": 469006,
        "code": 469006,
        "pid": 469000,
        "level": 2,
        "name": "万宁市"
    },
    {
        "id": 469005,
        "code": 469005,
        "pid": 469000,
        "level": 2,
        "name": "文昌市"
    },
    {
        "id": 469002,
        "code": 469002,
        "pid": 469000,
        "level": 2,
        "name": "琼海市"
    },
    {
        "id": 469023,
        "code": 469023,
        "pid": 469000,
        "level": 2,
        "name": "澄迈县"
    },
    {
        "id": 460100,
        "code": 460100,
        "pid": 460000,
        "level": 1,
        "name": "海口市"
    },
    {
        "id": 460105,
        "code": 460105,
        "pid": 460100,
        "level": 2,
        "name": "秀英区"
    },
    {
        "id": 460107,
        "code": 460107,
        "pid": 460100,
        "level": 2,
        "name": "琼山区"
    },
    {
        "id": 460106,
        "code": 460106,
        "pid": 460100,
        "level": 2,
        "name": "龙华区"
    },
    {
        "id": 460108,
        "code": 460108,
        "pid": 460100,
        "level": 2,
        "name": "美兰区"
    },
    {
        "id": 460200,
        "code": 460200,
        "pid": 460000,
        "level": 1,
        "name": "三亚市"
    },
    {
        "id": 460204,
        "code": 460204,
        "pid": 460200,
        "level": 2,
        "name": "天涯区"
    },
    {
        "id": 460205,
        "code": 460205,
        "pid": 460200,
        "level": 2,
        "name": "崖州区"
    },
    {
        "id": 460202,
        "code": 460202,
        "pid": 460200,
        "level": 2,
        "name": "海棠区"
    },
    {
        "id": 460203,
        "code": 460203,
        "pid": 460200,
        "level": 2,
        "name": "吉阳区"
    },
    {
        "id": 460300,
        "code": 460300,
        "pid": 460000,
        "level": 1,
        "name": "三沙市"
    },
    {
        "id": 140000,
        "code": 140000,
        "pid": 0,
        "level": 0,
        "name": "山西省"
    },
    {
        "id": 140900,
        "code": 140900,
        "pid": 140000,
        "level": 1,
        "name": "忻州市"
    },
    {
        "id": 140926,
        "code": 140926,
        "pid": 140900,
        "level": 2,
        "name": "静乐县"
    },
    {
        "id": 140927,
        "code": 140927,
        "pid": 140900,
        "level": 2,
        "name": "神池县"
    },
    {
        "id": 140902,
        "code": 140902,
        "pid": 140900,
        "level": 2,
        "name": "忻府区"
    },
    {
        "id": 140925,
        "code": 140925,
        "pid": 140900,
        "level": 2,
        "name": "宁武县"
    },
    {
        "id": 140931,
        "code": 140931,
        "pid": 140900,
        "level": 2,
        "name": "保德县"
    },
    {
        "id": 140930,
        "code": 140930,
        "pid": 140900,
        "level": 2,
        "name": "河曲县"
    },
    {
        "id": 140932,
        "code": 140932,
        "pid": 140900,
        "level": 2,
        "name": "偏关县"
    },
    {
        "id": 140921,
        "code": 140921,
        "pid": 140900,
        "level": 2,
        "name": "定襄县"
    },
    {
        "id": 140924,
        "code": 140924,
        "pid": 140900,
        "level": 2,
        "name": "繁峙县"
    },
    {
        "id": 140928,
        "code": 140928,
        "pid": 140900,
        "level": 2,
        "name": "五寨县"
    },
    {
        "id": 140929,
        "code": 140929,
        "pid": 140900,
        "level": 2,
        "name": "岢岚县"
    },
    {
        "id": 140922,
        "code": 140922,
        "pid": 140900,
        "level": 2,
        "name": "五台县"
    },
    {
        "id": 140981,
        "code": 140981,
        "pid": 140900,
        "level": 2,
        "name": "原平市"
    },
    {
        "id": 140923,
        "code": 140923,
        "pid": 140900,
        "level": 2,
        "name": "代县"
    },
    {
        "id": 141100,
        "code": 141100,
        "pid": 140000,
        "level": 1,
        "name": "吕梁市"
    },
    {
        "id": 141102,
        "code": 141102,
        "pid": 141100,
        "level": 2,
        "name": "离石区"
    },
    {
        "id": 141130,
        "code": 141130,
        "pid": 141100,
        "level": 2,
        "name": "交口县"
    },
    {
        "id": 141181,
        "code": 141181,
        "pid": 141100,
        "level": 2,
        "name": "孝义市"
    },
    {
        "id": 141129,
        "code": 141129,
        "pid": 141100,
        "level": 2,
        "name": "中阳县"
    },
    {
        "id": 141128,
        "code": 141128,
        "pid": 141100,
        "level": 2,
        "name": "方山县"
    },
    {
        "id": 141121,
        "code": 141121,
        "pid": 141100,
        "level": 2,
        "name": "文水县"
    },
    {
        "id": 141182,
        "code": 141182,
        "pid": 141100,
        "level": 2,
        "name": "汾阳市"
    },
    {
        "id": 141123,
        "code": 141123,
        "pid": 141100,
        "level": 2,
        "name": "兴县"
    },
    {
        "id": 141122,
        "code": 141122,
        "pid": 141100,
        "level": 2,
        "name": "交城县"
    },
    {
        "id": 141125,
        "code": 141125,
        "pid": 141100,
        "level": 2,
        "name": "柳林县"
    },
    {
        "id": 141124,
        "code": 141124,
        "pid": 141100,
        "level": 2,
        "name": "临县"
    },
    {
        "id": 141127,
        "code": 141127,
        "pid": 141100,
        "level": 2,
        "name": "岚县"
    },
    {
        "id": 141126,
        "code": 141126,
        "pid": 141100,
        "level": 2,
        "name": "石楼县"
    },
    {
        "id": 140600,
        "code": 140600,
        "pid": 140000,
        "level": 1,
        "name": "朔州市"
    },
    {
        "id": 140603,
        "code": 140603,
        "pid": 140600,
        "level": 2,
        "name": "平鲁区"
    },
    {
        "id": 140602,
        "code": 140602,
        "pid": 140600,
        "level": 2,
        "name": "朔城区"
    },
    {
        "id": 140624,
        "code": 140624,
        "pid": 140600,
        "level": 2,
        "name": "怀仁县"
    },
    {
        "id": 140621,
        "code": 140621,
        "pid": 140600,
        "level": 2,
        "name": "山阴县"
    },
    {
        "id": 140623,
        "code": 140623,
        "pid": 140600,
        "level": 2,
        "name": "右玉县"
    },
    {
        "id": 140622,
        "code": 140622,
        "pid": 140600,
        "level": 2,
        "name": "应县"
    },
    {
        "id": 140100,
        "code": 140100,
        "pid": 140000,
        "level": 1,
        "name": "太原市"
    },
    {
        "id": 140108,
        "code": 140108,
        "pid": 140100,
        "level": 2,
        "name": "尖草坪区"
    },
    {
        "id": 140109,
        "code": 140109,
        "pid": 140100,
        "level": 2,
        "name": "万柏林区"
    },
    {
        "id": 140122,
        "code": 140122,
        "pid": 140100,
        "level": 2,
        "name": "阳曲县"
    },
    {
        "id": 140105,
        "code": 140105,
        "pid": 140100,
        "level": 2,
        "name": "小店区"
    },
    {
        "id": 140106,
        "code": 140106,
        "pid": 140100,
        "level": 2,
        "name": "迎泽区"
    },
    {
        "id": 140107,
        "code": 140107,
        "pid": 140100,
        "level": 2,
        "name": "杏花岭区"
    },
    {
        "id": 140181,
        "code": 140181,
        "pid": 140100,
        "level": 2,
        "name": "古交市"
    },
    {
        "id": 140110,
        "code": 140110,
        "pid": 140100,
        "level": 2,
        "name": "晋源区"
    },
    {
        "id": 140123,
        "code": 140123,
        "pid": 140100,
        "level": 2,
        "name": "娄烦县"
    },
    {
        "id": 140121,
        "code": 140121,
        "pid": 140100,
        "level": 2,
        "name": "清徐县"
    },
    {
        "id": 140800,
        "code": 140800,
        "pid": 140000,
        "level": 1,
        "name": "运城市"
    },
    {
        "id": 140881,
        "code": 140881,
        "pid": 140800,
        "level": 2,
        "name": "永济市"
    },
    {
        "id": 140882,
        "code": 140882,
        "pid": 140800,
        "level": 2,
        "name": "河津市"
    },
    {
        "id": 140802,
        "code": 140802,
        "pid": 140800,
        "level": 2,
        "name": "盐湖区"
    },
    {
        "id": 140823,
        "code": 140823,
        "pid": 140800,
        "level": 2,
        "name": "闻喜县"
    },
    {
        "id": 140822,
        "code": 140822,
        "pid": 140800,
        "level": 2,
        "name": "万荣县"
    },
    {
        "id": 140821,
        "code": 140821,
        "pid": 140800,
        "level": 2,
        "name": "临猗县"
    },
    {
        "id": 140827,
        "code": 140827,
        "pid": 140800,
        "level": 2,
        "name": "垣曲县"
    },
    {
        "id": 140826,
        "code": 140826,
        "pid": 140800,
        "level": 2,
        "name": "绛县"
    },
    {
        "id": 140825,
        "code": 140825,
        "pid": 140800,
        "level": 2,
        "name": "新绛县"
    },
    {
        "id": 140824,
        "code": 140824,
        "pid": 140800,
        "level": 2,
        "name": "稷山县"
    },
    {
        "id": 140830,
        "code": 140830,
        "pid": 140800,
        "level": 2,
        "name": "芮城县"
    },
    {
        "id": 140829,
        "code": 140829,
        "pid": 140800,
        "level": 2,
        "name": "平陆县"
    },
    {
        "id": 140828,
        "code": 140828,
        "pid": 140800,
        "level": 2,
        "name": "夏县"
    },
    {
        "id": 140500,
        "code": 140500,
        "pid": 140000,
        "level": 1,
        "name": "晋城市"
    },
    {
        "id": 140522,
        "code": 140522,
        "pid": 140500,
        "level": 2,
        "name": "阳城县"
    },
    {
        "id": 140521,
        "code": 140521,
        "pid": 140500,
        "level": 2,
        "name": "沁水县"
    },
    {
        "id": 140524,
        "code": 140524,
        "pid": 140500,
        "level": 2,
        "name": "陵川县"
    },
    {
        "id": 140525,
        "code": 140525,
        "pid": 140500,
        "level": 2,
        "name": "泽州县"
    },
    {
        "id": 140502,
        "code": 140502,
        "pid": 140500,
        "level": 2,
        "name": "城区"
    },
    {
        "id": 140581,
        "code": 140581,
        "pid": 140500,
        "level": 2,
        "name": "高平市"
    },
    {
        "id": 140200,
        "code": 140200,
        "pid": 140000,
        "level": 1,
        "name": "大同市"
    },
    {
        "id": 140203,
        "code": 140203,
        "pid": 140200,
        "level": 2,
        "name": "矿区"
    },
    {
        "id": 140202,
        "code": 140202,
        "pid": 140200,
        "level": 2,
        "name": "城区"
    },
    {
        "id": 140211,
        "code": 140211,
        "pid": 140200,
        "level": 2,
        "name": "南郊区"
    },
    {
        "id": 140212,
        "code": 140212,
        "pid": 140200,
        "level": 2,
        "name": "新荣区"
    },
    {
        "id": 140221,
        "code": 140221,
        "pid": 140200,
        "level": 2,
        "name": "阳高县"
    },
    {
        "id": 140223,
        "code": 140223,
        "pid": 140200,
        "level": 2,
        "name": "广灵县"
    },
    {
        "id": 140222,
        "code": 140222,
        "pid": 140200,
        "level": 2,
        "name": "天镇县"
    },
    {
        "id": 140225,
        "code": 140225,
        "pid": 140200,
        "level": 2,
        "name": "浑源县"
    },
    {
        "id": 140224,
        "code": 140224,
        "pid": 140200,
        "level": 2,
        "name": "灵丘县"
    },
    {
        "id": 140227,
        "code": 140227,
        "pid": 140200,
        "level": 2,
        "name": "大同县"
    },
    {
        "id": 140226,
        "code": 140226,
        "pid": 140200,
        "level": 2,
        "name": "左云县"
    },
    {
        "id": 140400,
        "code": 140400,
        "pid": 140000,
        "level": 1,
        "name": "长治市"
    },
    {
        "id": 140402,
        "code": 140402,
        "pid": 140400,
        "level": 2,
        "name": "城区"
    },
    {
        "id": 140481,
        "code": 140481,
        "pid": 140400,
        "level": 2,
        "name": "潞城市"
    },
    {
        "id": 140430,
        "code": 140430,
        "pid": 140400,
        "level": 2,
        "name": "沁县"
    },
    {
        "id": 140431,
        "code": 140431,
        "pid": 140400,
        "level": 2,
        "name": "沁源县"
    },
    {
        "id": 140411,
        "code": 140411,
        "pid": 140400,
        "level": 2,
        "name": "郊区"
    },
    {
        "id": 140429,
        "code": 140429,
        "pid": 140400,
        "level": 2,
        "name": "武乡县"
    },
    {
        "id": 140428,
        "code": 140428,
        "pid": 140400,
        "level": 2,
        "name": "长子县"
    },
    {
        "id": 140427,
        "code": 140427,
        "pid": 140400,
        "level": 2,
        "name": "壶关县"
    },
    {
        "id": 140426,
        "code": 140426,
        "pid": 140400,
        "level": 2,
        "name": "黎城县"
    },
    {
        "id": 140425,
        "code": 140425,
        "pid": 140400,
        "level": 2,
        "name": "平顺县"
    },
    {
        "id": 140424,
        "code": 140424,
        "pid": 140400,
        "level": 2,
        "name": "屯留县"
    },
    {
        "id": 140423,
        "code": 140423,
        "pid": 140400,
        "level": 2,
        "name": "襄垣县"
    },
    {
        "id": 140421,
        "code": 140421,
        "pid": 140400,
        "level": 2,
        "name": "长治县"
    },
    {
        "id": 140300,
        "code": 140300,
        "pid": 140000,
        "level": 1,
        "name": "阳泉市"
    },
    {
        "id": 140311,
        "code": 140311,
        "pid": 140300,
        "level": 2,
        "name": "郊区"
    },
    {
        "id": 140302,
        "code": 140302,
        "pid": 140300,
        "level": 2,
        "name": "城区"
    },
    {
        "id": 140321,
        "code": 140321,
        "pid": 140300,
        "level": 2,
        "name": "平定县"
    },
    {
        "id": 140322,
        "code": 140322,
        "pid": 140300,
        "level": 2,
        "name": "盂县"
    },
    {
        "id": 140303,
        "code": 140303,
        "pid": 140300,
        "level": 2,
        "name": "矿区"
    },
    {
        "id": 141000,
        "code": 141000,
        "pid": 140000,
        "level": 1,
        "name": "临汾市"
    },
    {
        "id": 141024,
        "code": 141024,
        "pid": 141000,
        "level": 2,
        "name": "洪洞县"
    },
    {
        "id": 141025,
        "code": 141025,
        "pid": 141000,
        "level": 2,
        "name": "古县"
    },
    {
        "id": 141026,
        "code": 141026,
        "pid": 141000,
        "level": 2,
        "name": "安泽县"
    },
    {
        "id": 141027,
        "code": 141027,
        "pid": 141000,
        "level": 2,
        "name": "浮山县"
    },
    {
        "id": 141021,
        "code": 141021,
        "pid": 141000,
        "level": 2,
        "name": "曲沃县"
    },
    {
        "id": 141022,
        "code": 141022,
        "pid": 141000,
        "level": 2,
        "name": "翼城县"
    },
    {
        "id": 141032,
        "code": 141032,
        "pid": 141000,
        "level": 2,
        "name": "永和县"
    },
    {
        "id": 141034,
        "code": 141034,
        "pid": 141000,
        "level": 2,
        "name": "汾西县"
    },
    {
        "id": 141028,
        "code": 141028,
        "pid": 141000,
        "level": 2,
        "name": "吉县"
    },
    {
        "id": 141029,
        "code": 141029,
        "pid": 141000,
        "level": 2,
        "name": "乡宁县"
    },
    {
        "id": 141081,
        "code": 141081,
        "pid": 141000,
        "level": 2,
        "name": "侯马市"
    },
    {
        "id": 141082,
        "code": 141082,
        "pid": 141000,
        "level": 2,
        "name": "霍州市"
    },
    {
        "id": 141030,
        "code": 141030,
        "pid": 141000,
        "level": 2,
        "name": "大宁县"
    },
    {
        "id": 141031,
        "code": 141031,
        "pid": 141000,
        "level": 2,
        "name": "隰县"
    },
    {
        "id": 141002,
        "code": 141002,
        "pid": 141000,
        "level": 2,
        "name": "尧都区"
    },
    {
        "id": 141033,
        "code": 141033,
        "pid": 141000,
        "level": 2,
        "name": "蒲县"
    },
    {
        "id": 141023,
        "code": 141023,
        "pid": 141000,
        "level": 2,
        "name": "襄汾县"
    },
    {
        "id": 140700,
        "code": 140700,
        "pid": 140000,
        "level": 1,
        "name": "晋中市"
    },
    {
        "id": 140781,
        "code": 140781,
        "pid": 140700,
        "level": 2,
        "name": "介休市"
    },
    {
        "id": 140702,
        "code": 140702,
        "pid": 140700,
        "level": 2,
        "name": "榆次区"
    },
    {
        "id": 140728,
        "code": 140728,
        "pid": 140700,
        "level": 2,
        "name": "平遥县"
    },
    {
        "id": 140729,
        "code": 140729,
        "pid": 140700,
        "level": 2,
        "name": "灵石县"
    },
    {
        "id": 140721,
        "code": 140721,
        "pid": 140700,
        "level": 2,
        "name": "榆社县"
    },
    {
        "id": 140722,
        "code": 140722,
        "pid": 140700,
        "level": 2,
        "name": "左权县"
    },
    {
        "id": 140723,
        "code": 140723,
        "pid": 140700,
        "level": 2,
        "name": "和顺县"
    },
    {
        "id": 140724,
        "code": 140724,
        "pid": 140700,
        "level": 2,
        "name": "昔阳县"
    },
    {
        "id": 140725,
        "code": 140725,
        "pid": 140700,
        "level": 2,
        "name": "寿阳县"
    },
    {
        "id": 140726,
        "code": 140726,
        "pid": 140700,
        "level": 2,
        "name": "太谷县"
    },
    {
        "id": 140727,
        "code": 140727,
        "pid": 140700,
        "level": 2,
        "name": "祁县"
    },
    {
        "id": 230000,
        "code": 230000,
        "pid": 0,
        "level": 0,
        "name": "黑龙江省"
    },
    {
        "id": 230200,
        "code": 230200,
        "pid": 230000,
        "level": 1,
        "name": "齐齐哈尔市"
    },
    {
        "id": 230229,
        "code": 230229,
        "pid": 230200,
        "level": 2,
        "name": "克山县"
    },
    {
        "id": 230202,
        "code": 230202,
        "pid": 230200,
        "level": 2,
        "name": "龙沙区"
    },
    {
        "id": 230205,
        "code": 230205,
        "pid": 230200,
        "level": 2,
        "name": "昂昂溪区"
    },
    {
        "id": 230204,
        "code": 230204,
        "pid": 230200,
        "level": 2,
        "name": "铁锋区"
    },
    {
        "id": 230207,
        "code": 230207,
        "pid": 230200,
        "level": 2,
        "name": "碾子山区"
    },
    {
        "id": 230206,
        "code": 230206,
        "pid": 230200,
        "level": 2,
        "name": "富拉尔基区"
    },
    {
        "id": 230281,
        "code": 230281,
        "pid": 230200,
        "level": 2,
        "name": "讷河市"
    },
    {
        "id": 230208,
        "code": 230208,
        "pid": 230200,
        "level": 2,
        "name": "梅里斯达斡尔族区"
    },
    {
        "id": 230221,
        "code": 230221,
        "pid": 230200,
        "level": 2,
        "name": "龙江县"
    },
    {
        "id": 230227,
        "code": 230227,
        "pid": 230200,
        "level": 2,
        "name": "富裕县"
    },
    {
        "id": 230231,
        "code": 230231,
        "pid": 230200,
        "level": 2,
        "name": "拜泉县"
    },
    {
        "id": 230225,
        "code": 230225,
        "pid": 230200,
        "level": 2,
        "name": "甘南县"
    },
    {
        "id": 230224,
        "code": 230224,
        "pid": 230200,
        "level": 2,
        "name": "泰来县"
    },
    {
        "id": 230223,
        "code": 230223,
        "pid": 230200,
        "level": 2,
        "name": "依安县"
    },
    {
        "id": 230230,
        "code": 230230,
        "pid": 230200,
        "level": 2,
        "name": "克东县"
    },
    {
        "id": 230203,
        "code": 230203,
        "pid": 230200,
        "level": 2,
        "name": "建华区"
    },
    {
        "id": 230900,
        "code": 230900,
        "pid": 230000,
        "level": 1,
        "name": "七台河市"
    },
    {
        "id": 230902,
        "code": 230902,
        "pid": 230900,
        "level": 2,
        "name": "新兴区"
    },
    {
        "id": 230903,
        "code": 230903,
        "pid": 230900,
        "level": 2,
        "name": "桃山区"
    },
    {
        "id": 230921,
        "code": 230921,
        "pid": 230900,
        "level": 2,
        "name": "勃利县"
    },
    {
        "id": 230904,
        "code": 230904,
        "pid": 230900,
        "level": 2,
        "name": "茄子河区"
    },
    {
        "id": 230600,
        "code": 230600,
        "pid": 230000,
        "level": 1,
        "name": "大庆市"
    },
    {
        "id": 230605,
        "code": 230605,
        "pid": 230600,
        "level": 2,
        "name": "红岗区"
    },
    {
        "id": 230604,
        "code": 230604,
        "pid": 230600,
        "level": 2,
        "name": "让胡路区"
    },
    {
        "id": 230606,
        "code": 230606,
        "pid": 230600,
        "level": 2,
        "name": "大同区"
    },
    {
        "id": 230603,
        "code": 230603,
        "pid": 230600,
        "level": 2,
        "name": "龙凤区"
    },
    {
        "id": 230602,
        "code": 230602,
        "pid": 230600,
        "level": 2,
        "name": "萨尔图区"
    },
    {
        "id": 230624,
        "code": 230624,
        "pid": 230600,
        "level": 2,
        "name": "杜尔伯特蒙古族自治县"
    },
    {
        "id": 230623,
        "code": 230623,
        "pid": 230600,
        "level": 2,
        "name": "林甸县"
    },
    {
        "id": 230622,
        "code": 230622,
        "pid": 230600,
        "level": 2,
        "name": "肇源县"
    },
    {
        "id": 230621,
        "code": 230621,
        "pid": 230600,
        "level": 2,
        "name": "肇州县"
    },
    {
        "id": 232700,
        "code": 232700,
        "pid": 230000,
        "level": 1,
        "name": "大兴安岭地区"
    },
    {
        "id": 232721,
        "code": 232721,
        "pid": 232700,
        "level": 2,
        "name": "呼玛县"
    },
    {
        "id": 232722,
        "code": 232722,
        "pid": 232700,
        "level": 2,
        "name": "塔河县"
    },
    {
        "id": 232723,
        "code": 232723,
        "pid": 232700,
        "level": 2,
        "name": "漠河县"
    },
    {
        "id": 231000,
        "code": 231000,
        "pid": 230000,
        "level": 1,
        "name": "牡丹江市"
    },
    {
        "id": 231084,
        "code": 231084,
        "pid": 231000,
        "level": 2,
        "name": "宁安市"
    },
    {
        "id": 231085,
        "code": 231085,
        "pid": 231000,
        "level": 2,
        "name": "穆棱市"
    },
    {
        "id": 231086,
        "code": 231086,
        "pid": 231000,
        "level": 2,
        "name": "东宁市"
    },
    {
        "id": 231081,
        "code": 231081,
        "pid": 231000,
        "level": 2,
        "name": "绥芬河市"
    },
    {
        "id": 231083,
        "code": 231083,
        "pid": 231000,
        "level": 2,
        "name": "海林市"
    },
    {
        "id": 231025,
        "code": 231025,
        "pid": 231000,
        "level": 2,
        "name": "林口县"
    },
    {
        "id": 231004,
        "code": 231004,
        "pid": 231000,
        "level": 2,
        "name": "爱民区"
    },
    {
        "id": 231005,
        "code": 231005,
        "pid": 231000,
        "level": 2,
        "name": "西安区"
    },
    {
        "id": 231002,
        "code": 231002,
        "pid": 231000,
        "level": 2,
        "name": "东安区"
    },
    {
        "id": 231003,
        "code": 231003,
        "pid": 231000,
        "level": 2,
        "name": "阳明区"
    },
    {
        "id": 230100,
        "code": 230100,
        "pid": 230000,
        "level": 1,
        "name": "哈尔滨市"
    },
    {
        "id": 230183,
        "code": 230183,
        "pid": 230100,
        "level": 2,
        "name": "尚志市"
    },
    {
        "id": 230108,
        "code": 230108,
        "pid": 230100,
        "level": 2,
        "name": "平房区"
    },
    {
        "id": 230109,
        "code": 230109,
        "pid": 230100,
        "level": 2,
        "name": "松北区"
    },
    {
        "id": 230184,
        "code": 230184,
        "pid": 230100,
        "level": 2,
        "name": "五常市"
    },
    {
        "id": 230102,
        "code": 230102,
        "pid": 230100,
        "level": 2,
        "name": "道里区"
    },
    {
        "id": 230103,
        "code": 230103,
        "pid": 230100,
        "level": 2,
        "name": "南岗区"
    },
    {
        "id": 230113,
        "code": 230113,
        "pid": 230100,
        "level": 2,
        "name": "双城区"
    },
    {
        "id": 230112,
        "code": 230112,
        "pid": 230100,
        "level": 2,
        "name": "阿城区"
    },
    {
        "id": 230104,
        "code": 230104,
        "pid": 230100,
        "level": 2,
        "name": "道外区"
    },
    {
        "id": 230124,
        "code": 230124,
        "pid": 230100,
        "level": 2,
        "name": "方正县"
    },
    {
        "id": 230125,
        "code": 230125,
        "pid": 230100,
        "level": 2,
        "name": "宾县"
    },
    {
        "id": 230126,
        "code": 230126,
        "pid": 230100,
        "level": 2,
        "name": "巴彦县"
    },
    {
        "id": 230127,
        "code": 230127,
        "pid": 230100,
        "level": 2,
        "name": "木兰县"
    },
    {
        "id": 230123,
        "code": 230123,
        "pid": 230100,
        "level": 2,
        "name": "依兰县"
    },
    {
        "id": 230111,
        "code": 230111,
        "pid": 230100,
        "level": 2,
        "name": "呼兰区"
    },
    {
        "id": 230110,
        "code": 230110,
        "pid": 230100,
        "level": 2,
        "name": "香坊区"
    },
    {
        "id": 230128,
        "code": 230128,
        "pid": 230100,
        "level": 2,
        "name": "通河县"
    },
    {
        "id": 230129,
        "code": 230129,
        "pid": 230100,
        "level": 2,
        "name": "延寿县"
    },
    {
        "id": 230800,
        "code": 230800,
        "pid": 230000,
        "level": 1,
        "name": "佳木斯市"
    },
    {
        "id": 230822,
        "code": 230822,
        "pid": 230800,
        "level": 2,
        "name": "桦南县"
    },
    {
        "id": 230826,
        "code": 230826,
        "pid": 230800,
        "level": 2,
        "name": "桦川县"
    },
    {
        "id": 230803,
        "code": 230803,
        "pid": 230800,
        "level": 2,
        "name": "向阳区"
    },
    {
        "id": 230828,
        "code": 230828,
        "pid": 230800,
        "level": 2,
        "name": "汤原县"
    },
    {
        "id": 230811,
        "code": 230811,
        "pid": 230800,
        "level": 2,
        "name": "郊区"
    },
    {
        "id": 230805,
        "code": 230805,
        "pid": 230800,
        "level": 2,
        "name": "东风区"
    },
    {
        "id": 230804,
        "code": 230804,
        "pid": 230800,
        "level": 2,
        "name": "前进区"
    },
    {
        "id": 230883,
        "code": 230883,
        "pid": 230800,
        "level": 2,
        "name": "抚远市"
    },
    {
        "id": 230882,
        "code": 230882,
        "pid": 230800,
        "level": 2,
        "name": "富锦市"
    },
    {
        "id": 230881,
        "code": 230881,
        "pid": 230800,
        "level": 2,
        "name": "同江市"
    },
    {
        "id": 230500,
        "code": 230500,
        "pid": 230000,
        "level": 1,
        "name": "双鸭山市"
    },
    {
        "id": 230523,
        "code": 230523,
        "pid": 230500,
        "level": 2,
        "name": "宝清县"
    },
    {
        "id": 230524,
        "code": 230524,
        "pid": 230500,
        "level": 2,
        "name": "饶河县"
    },
    {
        "id": 230506,
        "code": 230506,
        "pid": 230500,
        "level": 2,
        "name": "宝山区"
    },
    {
        "id": 230521,
        "code": 230521,
        "pid": 230500,
        "level": 2,
        "name": "集贤县"
    },
    {
        "id": 230522,
        "code": 230522,
        "pid": 230500,
        "level": 2,
        "name": "友谊县"
    },
    {
        "id": 230505,
        "code": 230505,
        "pid": 230500,
        "level": 2,
        "name": "四方台区"
    },
    {
        "id": 230502,
        "code": 230502,
        "pid": 230500,
        "level": 2,
        "name": "尖山区"
    },
    {
        "id": 230503,
        "code": 230503,
        "pid": 230500,
        "level": 2,
        "name": "岭东区"
    },
    {
        "id": 231200,
        "code": 231200,
        "pid": 230000,
        "level": 1,
        "name": "绥化市"
    },
    {
        "id": 231221,
        "code": 231221,
        "pid": 231200,
        "level": 2,
        "name": "望奎县"
    },
    {
        "id": 231222,
        "code": 231222,
        "pid": 231200,
        "level": 2,
        "name": "兰西县"
    },
    {
        "id": 231223,
        "code": 231223,
        "pid": 231200,
        "level": 2,
        "name": "青冈县"
    },
    {
        "id": 231202,
        "code": 231202,
        "pid": 231200,
        "level": 2,
        "name": "北林区"
    },
    {
        "id": 231224,
        "code": 231224,
        "pid": 231200,
        "level": 2,
        "name": "庆安县"
    },
    {
        "id": 231226,
        "code": 231226,
        "pid": 231200,
        "level": 2,
        "name": "绥棱县"
    },
    {
        "id": 231225,
        "code": 231225,
        "pid": 231200,
        "level": 2,
        "name": "明水县"
    },
    {
        "id": 231282,
        "code": 231282,
        "pid": 231200,
        "level": 2,
        "name": "肇东市"
    },
    {
        "id": 231283,
        "code": 231283,
        "pid": 231200,
        "level": 2,
        "name": "海伦市"
    },
    {
        "id": 231281,
        "code": 231281,
        "pid": 231200,
        "level": 2,
        "name": "安达市"
    },
    {
        "id": 230400,
        "code": 230400,
        "pid": 230000,
        "level": 1,
        "name": "鹤岗市"
    },
    {
        "id": 230421,
        "code": 230421,
        "pid": 230400,
        "level": 2,
        "name": "萝北县"
    },
    {
        "id": 230422,
        "code": 230422,
        "pid": 230400,
        "level": 2,
        "name": "绥滨县"
    },
    {
        "id": 230407,
        "code": 230407,
        "pid": 230400,
        "level": 2,
        "name": "兴山区"
    },
    {
        "id": 230406,
        "code": 230406,
        "pid": 230400,
        "level": 2,
        "name": "东山区"
    },
    {
        "id": 230405,
        "code": 230405,
        "pid": 230400,
        "level": 2,
        "name": "兴安区"
    },
    {
        "id": 230404,
        "code": 230404,
        "pid": 230400,
        "level": 2,
        "name": "南山区"
    },
    {
        "id": 230403,
        "code": 230403,
        "pid": 230400,
        "level": 2,
        "name": "工农区"
    },
    {
        "id": 230402,
        "code": 230402,
        "pid": 230400,
        "level": 2,
        "name": "向阳区"
    },
    {
        "id": 230300,
        "code": 230300,
        "pid": 230000,
        "level": 1,
        "name": "鸡西市"
    },
    {
        "id": 230381,
        "code": 230381,
        "pid": 230300,
        "level": 2,
        "name": "虎林市"
    },
    {
        "id": 230382,
        "code": 230382,
        "pid": 230300,
        "level": 2,
        "name": "密山市"
    },
    {
        "id": 230303,
        "code": 230303,
        "pid": 230300,
        "level": 2,
        "name": "恒山区"
    },
    {
        "id": 230302,
        "code": 230302,
        "pid": 230300,
        "level": 2,
        "name": "鸡冠区"
    },
    {
        "id": 230321,
        "code": 230321,
        "pid": 230300,
        "level": 2,
        "name": "鸡东县"
    },
    {
        "id": 230304,
        "code": 230304,
        "pid": 230300,
        "level": 2,
        "name": "滴道区"
    },
    {
        "id": 230305,
        "code": 230305,
        "pid": 230300,
        "level": 2,
        "name": "梨树区"
    },
    {
        "id": 230306,
        "code": 230306,
        "pid": 230300,
        "level": 2,
        "name": "城子河区"
    },
    {
        "id": 230307,
        "code": 230307,
        "pid": 230300,
        "level": 2,
        "name": "麻山区"
    },
    {
        "id": 230700,
        "code": 230700,
        "pid": 230000,
        "level": 1,
        "name": "伊春市"
    },
    {
        "id": 230710,
        "code": 230710,
        "pid": 230700,
        "level": 2,
        "name": "五营区"
    },
    {
        "id": 230781,
        "code": 230781,
        "pid": 230700,
        "level": 2,
        "name": "铁力市"
    },
    {
        "id": 230714,
        "code": 230714,
        "pid": 230700,
        "level": 2,
        "name": "乌伊岭区"
    },
    {
        "id": 230715,
        "code": 230715,
        "pid": 230700,
        "level": 2,
        "name": "红星区"
    },
    {
        "id": 230716,
        "code": 230716,
        "pid": 230700,
        "level": 2,
        "name": "上甘岭区"
    },
    {
        "id": 230722,
        "code": 230722,
        "pid": 230700,
        "level": 2,
        "name": "嘉荫县"
    },
    {
        "id": 230713,
        "code": 230713,
        "pid": 230700,
        "level": 2,
        "name": "带岭区"
    },
    {
        "id": 230708,
        "code": 230708,
        "pid": 230700,
        "level": 2,
        "name": "美溪区"
    },
    {
        "id": 230709,
        "code": 230709,
        "pid": 230700,
        "level": 2,
        "name": "金山屯区"
    },
    {
        "id": 230712,
        "code": 230712,
        "pid": 230700,
        "level": 2,
        "name": "汤旺河区"
    },
    {
        "id": 230704,
        "code": 230704,
        "pid": 230700,
        "level": 2,
        "name": "友好区"
    },
    {
        "id": 230705,
        "code": 230705,
        "pid": 230700,
        "level": 2,
        "name": "西林区"
    },
    {
        "id": 230706,
        "code": 230706,
        "pid": 230700,
        "level": 2,
        "name": "翠峦区"
    },
    {
        "id": 230707,
        "code": 230707,
        "pid": 230700,
        "level": 2,
        "name": "新青区"
    },
    {
        "id": 230711,
        "code": 230711,
        "pid": 230700,
        "level": 2,
        "name": "乌马河区"
    },
    {
        "id": 230702,
        "code": 230702,
        "pid": 230700,
        "level": 2,
        "name": "伊春区"
    },
    {
        "id": 230703,
        "code": 230703,
        "pid": 230700,
        "level": 2,
        "name": "南岔区"
    },
    {
        "id": 231100,
        "code": 231100,
        "pid": 230000,
        "level": 1,
        "name": "黑河市"
    },
    {
        "id": 231102,
        "code": 231102,
        "pid": 231100,
        "level": 2,
        "name": "爱辉区"
    },
    {
        "id": 231124,
        "code": 231124,
        "pid": 231100,
        "level": 2,
        "name": "孙吴县"
    },
    {
        "id": 231123,
        "code": 231123,
        "pid": 231100,
        "level": 2,
        "name": "逊克县"
    },
    {
        "id": 231121,
        "code": 231121,
        "pid": 231100,
        "level": 2,
        "name": "嫩江县"
    },
    {
        "id": 231181,
        "code": 231181,
        "pid": 231100,
        "level": 2,
        "name": "北安市"
    },
    {
        "id": 231182,
        "code": 231182,
        "pid": 231100,
        "level": 2,
        "name": "五大连池市"
    },
    {
        "id": 360000,
        "code": 360000,
        "pid": 0,
        "level": 0,
        "name": "江西省"
    },
    {
        "id": 360800,
        "code": 360800,
        "pid": 360000,
        "level": 1,
        "name": "吉安市"
    },
    {
        "id": 360830,
        "code": 360830,
        "pid": 360800,
        "level": 2,
        "name": "永新县"
    },
    {
        "id": 360803,
        "code": 360803,
        "pid": 360800,
        "level": 2,
        "name": "青原区"
    },
    {
        "id": 360802,
        "code": 360802,
        "pid": 360800,
        "level": 2,
        "name": "吉州区"
    },
    {
        "id": 360829,
        "code": 360829,
        "pid": 360800,
        "level": 2,
        "name": "安福县"
    },
    {
        "id": 360881,
        "code": 360881,
        "pid": 360800,
        "level": 2,
        "name": "井冈山市"
    },
    {
        "id": 360822,
        "code": 360822,
        "pid": 360800,
        "level": 2,
        "name": "吉水县"
    },
    {
        "id": 360821,
        "code": 360821,
        "pid": 360800,
        "level": 2,
        "name": "吉安县"
    },
    {
        "id": 360827,
        "code": 360827,
        "pid": 360800,
        "level": 2,
        "name": "遂川县"
    },
    {
        "id": 360826,
        "code": 360826,
        "pid": 360800,
        "level": 2,
        "name": "泰和县"
    },
    {
        "id": 360825,
        "code": 360825,
        "pid": 360800,
        "level": 2,
        "name": "永丰县"
    },
    {
        "id": 360824,
        "code": 360824,
        "pid": 360800,
        "level": 2,
        "name": "新干县"
    },
    {
        "id": 360823,
        "code": 360823,
        "pid": 360800,
        "level": 2,
        "name": "峡江县"
    },
    {
        "id": 360828,
        "code": 360828,
        "pid": 360800,
        "level": 2,
        "name": "万安县"
    },
    {
        "id": 360300,
        "code": 360300,
        "pid": 360000,
        "level": 1,
        "name": "萍乡市"
    },
    {
        "id": 360302,
        "code": 360302,
        "pid": 360300,
        "level": 2,
        "name": "安源区"
    },
    {
        "id": 360313,
        "code": 360313,
        "pid": 360300,
        "level": 2,
        "name": "湘东区"
    },
    {
        "id": 360321,
        "code": 360321,
        "pid": 360300,
        "level": 2,
        "name": "莲花县"
    },
    {
        "id": 360322,
        "code": 360322,
        "pid": 360300,
        "level": 2,
        "name": "上栗县"
    },
    {
        "id": 360323,
        "code": 360323,
        "pid": 360300,
        "level": 2,
        "name": "芦溪县"
    },
    {
        "id": 360200,
        "code": 360200,
        "pid": 360000,
        "level": 1,
        "name": "景德镇市"
    },
    {
        "id": 360203,
        "code": 360203,
        "pid": 360200,
        "level": 2,
        "name": "珠山区"
    },
    {
        "id": 360202,
        "code": 360202,
        "pid": 360200,
        "level": 2,
        "name": "昌江区"
    },
    {
        "id": 360281,
        "code": 360281,
        "pid": 360200,
        "level": 2,
        "name": "乐平市"
    },
    {
        "id": 360222,
        "code": 360222,
        "pid": 360200,
        "level": 2,
        "name": "浮梁县"
    },
    {
        "id": 360700,
        "code": 360700,
        "pid": 360000,
        "level": 1,
        "name": "赣州市"
    },
    {
        "id": 360721,
        "code": 360721,
        "pid": 360700,
        "level": 2,
        "name": "赣县"
    },
    {
        "id": 360722,
        "code": 360722,
        "pid": 360700,
        "level": 2,
        "name": "信丰县"
    },
    {
        "id": 360723,
        "code": 360723,
        "pid": 360700,
        "level": 2,
        "name": "大余县"
    },
    {
        "id": 360724,
        "code": 360724,
        "pid": 360700,
        "level": 2,
        "name": "上犹县"
    },
    {
        "id": 360725,
        "code": 360725,
        "pid": 360700,
        "level": 2,
        "name": "崇义县"
    },
    {
        "id": 360726,
        "code": 360726,
        "pid": 360700,
        "level": 2,
        "name": "安远县"
    },
    {
        "id": 360727,
        "code": 360727,
        "pid": 360700,
        "level": 2,
        "name": "龙南县"
    },
    {
        "id": 360728,
        "code": 360728,
        "pid": 360700,
        "level": 2,
        "name": "定南县"
    },
    {
        "id": 360729,
        "code": 360729,
        "pid": 360700,
        "level": 2,
        "name": "全南县"
    },
    {
        "id": 360735,
        "code": 360735,
        "pid": 360700,
        "level": 2,
        "name": "石城县"
    },
    {
        "id": 360734,
        "code": 360734,
        "pid": 360700,
        "level": 2,
        "name": "寻乌县"
    },
    {
        "id": 360733,
        "code": 360733,
        "pid": 360700,
        "level": 2,
        "name": "会昌县"
    },
    {
        "id": 360732,
        "code": 360732,
        "pid": 360700,
        "level": 2,
        "name": "兴国县"
    },
    {
        "id": 360731,
        "code": 360731,
        "pid": 360700,
        "level": 2,
        "name": "于都县"
    },
    {
        "id": 360730,
        "code": 360730,
        "pid": 360700,
        "level": 2,
        "name": "宁都县"
    },
    {
        "id": 360702,
        "code": 360702,
        "pid": 360700,
        "level": 2,
        "name": "章贡区"
    },
    {
        "id": 360703,
        "code": 360703,
        "pid": 360700,
        "level": 2,
        "name": "南康区"
    },
    {
        "id": 360781,
        "code": 360781,
        "pid": 360700,
        "level": 2,
        "name": "瑞金市"
    },
    {
        "id": 361100,
        "code": 361100,
        "pid": 360000,
        "level": 1,
        "name": "上饶市"
    },
    {
        "id": 361121,
        "code": 361121,
        "pid": 361100,
        "level": 2,
        "name": "上饶县"
    },
    {
        "id": 361123,
        "code": 361123,
        "pid": 361100,
        "level": 2,
        "name": "玉山县"
    },
    {
        "id": 361125,
        "code": 361125,
        "pid": 361100,
        "level": 2,
        "name": "横峰县"
    },
    {
        "id": 361124,
        "code": 361124,
        "pid": 361100,
        "level": 2,
        "name": "铅山县"
    },
    {
        "id": 361127,
        "code": 361127,
        "pid": 361100,
        "level": 2,
        "name": "余干县"
    },
    {
        "id": 361126,
        "code": 361126,
        "pid": 361100,
        "level": 2,
        "name": "弋阳县"
    },
    {
        "id": 361129,
        "code": 361129,
        "pid": 361100,
        "level": 2,
        "name": "万年县"
    },
    {
        "id": 361128,
        "code": 361128,
        "pid": 361100,
        "level": 2,
        "name": "鄱阳县"
    },
    {
        "id": 361130,
        "code": 361130,
        "pid": 361100,
        "level": 2,
        "name": "婺源县"
    },
    {
        "id": 361103,
        "code": 361103,
        "pid": 361100,
        "level": 2,
        "name": "广丰区"
    },
    {
        "id": 361181,
        "code": 361181,
        "pid": 361100,
        "level": 2,
        "name": "德兴市"
    },
    {
        "id": 361102,
        "code": 361102,
        "pid": 361100,
        "level": 2,
        "name": "信州区"
    },
    {
        "id": 361000,
        "code": 361000,
        "pid": 360000,
        "level": 1,
        "name": "抚州市"
    },
    {
        "id": 361002,
        "code": 361002,
        "pid": 361000,
        "level": 2,
        "name": "临川区"
    },
    {
        "id": 361030,
        "code": 361030,
        "pid": 361000,
        "level": 2,
        "name": "广昌县"
    },
    {
        "id": 361028,
        "code": 361028,
        "pid": 361000,
        "level": 2,
        "name": "资溪县"
    },
    {
        "id": 361029,
        "code": 361029,
        "pid": 361000,
        "level": 2,
        "name": "东乡县"
    },
    {
        "id": 361024,
        "code": 361024,
        "pid": 361000,
        "level": 2,
        "name": "崇仁县"
    },
    {
        "id": 361025,
        "code": 361025,
        "pid": 361000,
        "level": 2,
        "name": "乐安县"
    },
    {
        "id": 361026,
        "code": 361026,
        "pid": 361000,
        "level": 2,
        "name": "宜黄县"
    },
    {
        "id": 361027,
        "code": 361027,
        "pid": 361000,
        "level": 2,
        "name": "金溪县"
    },
    {
        "id": 361021,
        "code": 361021,
        "pid": 361000,
        "level": 2,
        "name": "南城县"
    },
    {
        "id": 361022,
        "code": 361022,
        "pid": 361000,
        "level": 2,
        "name": "黎川县"
    },
    {
        "id": 361023,
        "code": 361023,
        "pid": 361000,
        "level": 2,
        "name": "南丰县"
    },
    {
        "id": 360600,
        "code": 360600,
        "pid": 360000,
        "level": 1,
        "name": "鹰潭市"
    },
    {
        "id": 360602,
        "code": 360602,
        "pid": 360600,
        "level": 2,
        "name": "月湖区"
    },
    {
        "id": 360681,
        "code": 360681,
        "pid": 360600,
        "level": 2,
        "name": "贵溪市"
    },
    {
        "id": 360622,
        "code": 360622,
        "pid": 360600,
        "level": 2,
        "name": "余江县"
    },
    {
        "id": 360100,
        "code": 360100,
        "pid": 360000,
        "level": 1,
        "name": "南昌市"
    },
    {
        "id": 360124,
        "code": 360124,
        "pid": 360100,
        "level": 2,
        "name": "进贤县"
    },
    {
        "id": 360102,
        "code": 360102,
        "pid": 360100,
        "level": 2,
        "name": "东湖区"
    },
    {
        "id": 360103,
        "code": 360103,
        "pid": 360100,
        "level": 2,
        "name": "西湖区"
    },
    {
        "id": 360104,
        "code": 360104,
        "pid": 360100,
        "level": 2,
        "name": "青云谱区"
    },
    {
        "id": 360105,
        "code": 360105,
        "pid": 360100,
        "level": 2,
        "name": "湾里区"
    },
    {
        "id": 360121,
        "code": 360121,
        "pid": 360100,
        "level": 2,
        "name": "南昌县"
    },
    {
        "id": 360112,
        "code": 360112,
        "pid": 360100,
        "level": 2,
        "name": "新建区"
    },
    {
        "id": 360111,
        "code": 360111,
        "pid": 360100,
        "level": 2,
        "name": "青山湖区"
    },
    {
        "id": 360123,
        "code": 360123,
        "pid": 360100,
        "level": 2,
        "name": "安义县"
    },
    {
        "id": 360500,
        "code": 360500,
        "pid": 360000,
        "level": 1,
        "name": "新余市"
    },
    {
        "id": 360521,
        "code": 360521,
        "pid": 360500,
        "level": 2,
        "name": "分宜县"
    },
    {
        "id": 360502,
        "code": 360502,
        "pid": 360500,
        "level": 2,
        "name": "渝水区"
    },
    {
        "id": 360900,
        "code": 360900,
        "pid": 360000,
        "level": 1,
        "name": "宜春市"
    },
    {
        "id": 360981,
        "code": 360981,
        "pid": 360900,
        "level": 2,
        "name": "丰城市"
    },
    {
        "id": 360982,
        "code": 360982,
        "pid": 360900,
        "level": 2,
        "name": "樟树市"
    },
    {
        "id": 360983,
        "code": 360983,
        "pid": 360900,
        "level": 2,
        "name": "高安市"
    },
    {
        "id": 360926,
        "code": 360926,
        "pid": 360900,
        "level": 2,
        "name": "铜鼓县"
    },
    {
        "id": 360924,
        "code": 360924,
        "pid": 360900,
        "level": 2,
        "name": "宜丰县"
    },
    {
        "id": 360902,
        "code": 360902,
        "pid": 360900,
        "level": 2,
        "name": "袁州区"
    },
    {
        "id": 360925,
        "code": 360925,
        "pid": 360900,
        "level": 2,
        "name": "靖安县"
    },
    {
        "id": 360922,
        "code": 360922,
        "pid": 360900,
        "level": 2,
        "name": "万载县"
    },
    {
        "id": 360923,
        "code": 360923,
        "pid": 360900,
        "level": 2,
        "name": "上高县"
    },
    {
        "id": 360921,
        "code": 360921,
        "pid": 360900,
        "level": 2,
        "name": "奉新县"
    },
    {
        "id": 360400,
        "code": 360400,
        "pid": 360000,
        "level": 1,
        "name": "九江市"
    },
    {
        "id": 360426,
        "code": 360426,
        "pid": 360400,
        "level": 2,
        "name": "德安县"
    },
    {
        "id": 360425,
        "code": 360425,
        "pid": 360400,
        "level": 2,
        "name": "永修县"
    },
    {
        "id": 360424,
        "code": 360424,
        "pid": 360400,
        "level": 2,
        "name": "修水县"
    },
    {
        "id": 360423,
        "code": 360423,
        "pid": 360400,
        "level": 2,
        "name": "武宁县"
    },
    {
        "id": 360483,
        "code": 360483,
        "pid": 360400,
        "level": 2,
        "name": "庐山市"
    },
    {
        "id": 360421,
        "code": 360421,
        "pid": 360400,
        "level": 2,
        "name": "九江县"
    },
    {
        "id": 360482,
        "code": 360482,
        "pid": 360400,
        "level": 2,
        "name": "共青城市"
    },
    {
        "id": 360429,
        "code": 360429,
        "pid": 360400,
        "level": 2,
        "name": "湖口县"
    },
    {
        "id": 360428,
        "code": 360428,
        "pid": 360400,
        "level": 2,
        "name": "都昌县"
    },
    {
        "id": 360430,
        "code": 360430,
        "pid": 360400,
        "level": 2,
        "name": "彭泽县"
    },
    {
        "id": 360481,
        "code": 360481,
        "pid": 360400,
        "level": 2,
        "name": "瑞昌市"
    },
    {
        "id": 360403,
        "code": 360403,
        "pid": 360400,
        "level": 2,
        "name": "浔阳区"
    },
    {
        "id": 360402,
        "code": 360402,
        "pid": 360400,
        "level": 2,
        "name": "濂溪区"
    },
    {
        "id": 500000,
        "code": 500000,
        "pid": 0,
        "level": 0,
        "name": "重庆市"
    },
    {
        "id": 500100,
        "code": 500100,
        "pid": 500000,
        "level": 1,
        "name": "市辖区"
    },
    {
        "id": 500106,
        "code": 500106,
        "pid": 500100,
        "level": 2,
        "name": "沙坪坝区"
    },
    {
        "id": 500101,
        "code": 500101,
        "pid": 500100,
        "level": 2,
        "name": "万州区"
    },
    {
        "id": 500102,
        "code": 500102,
        "pid": 500100,
        "level": 2,
        "name": "涪陵区"
    },
    {
        "id": 500103,
        "code": 500103,
        "pid": 500100,
        "level": 2,
        "name": "渝中区"
    },
    {
        "id": 500104,
        "code": 500104,
        "pid": 500100,
        "level": 2,
        "name": "大渡口区"
    },
    {
        "id": 500105,
        "code": 500105,
        "pid": 500100,
        "level": 2,
        "name": "江北区"
    },
    {
        "id": 500120,
        "code": 500120,
        "pid": 500100,
        "level": 2,
        "name": "璧山区"
    },
    {
        "id": 500107,
        "code": 500107,
        "pid": 500100,
        "level": 2,
        "name": "九龙坡区"
    },
    {
        "id": 500108,
        "code": 500108,
        "pid": 500100,
        "level": 2,
        "name": "南岸区"
    },
    {
        "id": 500109,
        "code": 500109,
        "pid": 500100,
        "level": 2,
        "name": "北碚区"
    },
    {
        "id": 500153,
        "code": 500153,
        "pid": 500100,
        "level": 2,
        "name": "荣昌区"
    },
    {
        "id": 500152,
        "code": 500152,
        "pid": 500100,
        "level": 2,
        "name": "潼南区"
    },
    {
        "id": 500151,
        "code": 500151,
        "pid": 500100,
        "level": 2,
        "name": "铜梁区"
    },
    {
        "id": 500154,
        "code": 500154,
        "pid": 500100,
        "level": 2,
        "name": "开州区"
    },
    {
        "id": 500119,
        "code": 500119,
        "pid": 500100,
        "level": 2,
        "name": "南川区"
    },
    {
        "id": 500118,
        "code": 500118,
        "pid": 500100,
        "level": 2,
        "name": "永川区"
    },
    {
        "id": 500117,
        "code": 500117,
        "pid": 500100,
        "level": 2,
        "name": "合川区"
    },
    {
        "id": 500116,
        "code": 500116,
        "pid": 500100,
        "level": 2,
        "name": "江津区"
    },
    {
        "id": 500115,
        "code": 500115,
        "pid": 500100,
        "level": 2,
        "name": "长寿区"
    },
    {
        "id": 500114,
        "code": 500114,
        "pid": 500100,
        "level": 2,
        "name": "黔江区"
    },
    {
        "id": 500113,
        "code": 500113,
        "pid": 500100,
        "level": 2,
        "name": "巴南区"
    },
    {
        "id": 500112,
        "code": 500112,
        "pid": 500100,
        "level": 2,
        "name": "渝北区"
    },
    {
        "id": 500111,
        "code": 500111,
        "pid": 500100,
        "level": 2,
        "name": "大足区"
    },
    {
        "id": 500110,
        "code": 500110,
        "pid": 500100,
        "level": 2,
        "name": "綦江区"
    },
    {
        "id": 500200,
        "code": 500200,
        "pid": 500000,
        "level": 1,
        "name": "县"
    },
    {
        "id": 500232,
        "code": 500232,
        "pid": 500200,
        "level": 2,
        "name": "武隆县"
    },
    {
        "id": 500233,
        "code": 500233,
        "pid": 500200,
        "level": 2,
        "name": "忠县"
    },
    {
        "id": 500230,
        "code": 500230,
        "pid": 500200,
        "level": 2,
        "name": "丰都县"
    },
    {
        "id": 500231,
        "code": 500231,
        "pid": 500200,
        "level": 2,
        "name": "垫江县"
    },
    {
        "id": 500236,
        "code": 500236,
        "pid": 500200,
        "level": 2,
        "name": "奉节县"
    },
    {
        "id": 500237,
        "code": 500237,
        "pid": 500200,
        "level": 2,
        "name": "巫山县"
    },
    {
        "id": 500241,
        "code": 500241,
        "pid": 500200,
        "level": 2,
        "name": "秀山土家族苗族自治县"
    },
    {
        "id": 500235,
        "code": 500235,
        "pid": 500200,
        "level": 2,
        "name": "云阳县"
    },
    {
        "id": 500229,
        "code": 500229,
        "pid": 500200,
        "level": 2,
        "name": "城口县"
    },
    {
        "id": 500228,
        "code": 500228,
        "pid": 500200,
        "level": 2,
        "name": "梁平县"
    },
    {
        "id": 500238,
        "code": 500238,
        "pid": 500200,
        "level": 2,
        "name": "巫溪县"
    },
    {
        "id": 500240,
        "code": 500240,
        "pid": 500200,
        "level": 2,
        "name": "石柱土家族自治县"
    },
    {
        "id": 500243,
        "code": 500243,
        "pid": 500200,
        "level": 2,
        "name": "彭水苗族土家族自治县"
    },
    {
        "id": 500242,
        "code": 500242,
        "pid": 500200,
        "level": 2,
        "name": "酉阳土家族苗族自治县"
    },
    {
        "id": 410000,
        "code": 410000,
        "pid": 0,
        "level": 0,
        "name": "河南省"
    },
    {
        "id": 411400,
        "code": 411400,
        "pid": 410000,
        "level": 1,
        "name": "商丘市"
    },
    {
        "id": 411426,
        "code": 411426,
        "pid": 411400,
        "level": 2,
        "name": "夏邑县"
    },
    {
        "id": 411424,
        "code": 411424,
        "pid": 411400,
        "level": 2,
        "name": "柘城县"
    },
    {
        "id": 411403,
        "code": 411403,
        "pid": 411400,
        "level": 2,
        "name": "睢阳区"
    },
    {
        "id": 411422,
        "code": 411422,
        "pid": 411400,
        "level": 2,
        "name": "睢县"
    },
    {
        "id": 411423,
        "code": 411423,
        "pid": 411400,
        "level": 2,
        "name": "宁陵县"
    },
    {
        "id": 411421,
        "code": 411421,
        "pid": 411400,
        "level": 2,
        "name": "民权县"
    },
    {
        "id": 411402,
        "code": 411402,
        "pid": 411400,
        "level": 2,
        "name": "梁园区"
    },
    {
        "id": 411425,
        "code": 411425,
        "pid": 411400,
        "level": 2,
        "name": "虞城县"
    },
    {
        "id": 411481,
        "code": 411481,
        "pid": 411400,
        "level": 2,
        "name": "永城市"
    },
    {
        "id": 410300,
        "code": 410300,
        "pid": 410000,
        "level": 1,
        "name": "洛阳市"
    },
    {
        "id": 410326,
        "code": 410326,
        "pid": 410300,
        "level": 2,
        "name": "汝阳县"
    },
    {
        "id": 410327,
        "code": 410327,
        "pid": 410300,
        "level": 2,
        "name": "宜阳县"
    },
    {
        "id": 410324,
        "code": 410324,
        "pid": 410300,
        "level": 2,
        "name": "栾川县"
    },
    {
        "id": 410325,
        "code": 410325,
        "pid": 410300,
        "level": 2,
        "name": "嵩县"
    },
    {
        "id": 410322,
        "code": 410322,
        "pid": 410300,
        "level": 2,
        "name": "孟津县"
    },
    {
        "id": 410305,
        "code": 410305,
        "pid": 410300,
        "level": 2,
        "name": "涧西区"
    },
    {
        "id": 410306,
        "code": 410306,
        "pid": 410300,
        "level": 2,
        "name": "吉利区"
    },
    {
        "id": 410302,
        "code": 410302,
        "pid": 410300,
        "level": 2,
        "name": "老城区"
    },
    {
        "id": 410311,
        "code": 410311,
        "pid": 410300,
        "level": 2,
        "name": "洛龙区"
    },
    {
        "id": 410329,
        "code": 410329,
        "pid": 410300,
        "level": 2,
        "name": "伊川县"
    },
    {
        "id": 410303,
        "code": 410303,
        "pid": 410300,
        "level": 2,
        "name": "西工区"
    },
    {
        "id": 410328,
        "code": 410328,
        "pid": 410300,
        "level": 2,
        "name": "洛宁县"
    },
    {
        "id": 410381,
        "code": 410381,
        "pid": 410300,
        "level": 2,
        "name": "偃师市"
    },
    {
        "id": 410304,
        "code": 410304,
        "pid": 410300,
        "level": 2,
        "name": "瀍河回族区"
    },
    {
        "id": 410323,
        "code": 410323,
        "pid": 410300,
        "level": 2,
        "name": "新安县"
    },
    {
        "id": 410800,
        "code": 410800,
        "pid": 410000,
        "level": 1,
        "name": "焦作市"
    },
    {
        "id": 410803,
        "code": 410803,
        "pid": 410800,
        "level": 2,
        "name": "中站区"
    },
    {
        "id": 410802,
        "code": 410802,
        "pid": 410800,
        "level": 2,
        "name": "解放区"
    },
    {
        "id": 410811,
        "code": 410811,
        "pid": 410800,
        "level": 2,
        "name": "山阳区"
    },
    {
        "id": 410804,
        "code": 410804,
        "pid": 410800,
        "level": 2,
        "name": "马村区"
    },
    {
        "id": 410821,
        "code": 410821,
        "pid": 410800,
        "level": 2,
        "name": "修武县"
    },
    {
        "id": 410883,
        "code": 410883,
        "pid": 410800,
        "level": 2,
        "name": "孟州市"
    },
    {
        "id": 410882,
        "code": 410882,
        "pid": 410800,
        "level": 2,
        "name": "沁阳市"
    },
    {
        "id": 410823,
        "code": 410823,
        "pid": 410800,
        "level": 2,
        "name": "武陟县"
    },
    {
        "id": 410822,
        "code": 410822,
        "pid": 410800,
        "level": 2,
        "name": "博爱县"
    },
    {
        "id": 410825,
        "code": 410825,
        "pid": 410800,
        "level": 2,
        "name": "温县"
    },
    {
        "id": 410700,
        "code": 410700,
        "pid": 410000,
        "level": 1,
        "name": "新乡市"
    },
    {
        "id": 410704,
        "code": 410704,
        "pid": 410700,
        "level": 2,
        "name": "凤泉区"
    },
    {
        "id": 410711,
        "code": 410711,
        "pid": 410700,
        "level": 2,
        "name": "牧野区"
    },
    {
        "id": 410702,
        "code": 410702,
        "pid": 410700,
        "level": 2,
        "name": "红旗区"
    },
    {
        "id": 410703,
        "code": 410703,
        "pid": 410700,
        "level": 2,
        "name": "卫滨区"
    },
    {
        "id": 410781,
        "code": 410781,
        "pid": 410700,
        "level": 2,
        "name": "卫辉市"
    },
    {
        "id": 410728,
        "code": 410728,
        "pid": 410700,
        "level": 2,
        "name": "长垣县"
    },
    {
        "id": 410782,
        "code": 410782,
        "pid": 410700,
        "level": 2,
        "name": "辉县市"
    },
    {
        "id": 410721,
        "code": 410721,
        "pid": 410700,
        "level": 2,
        "name": "新乡县"
    },
    {
        "id": 410726,
        "code": 410726,
        "pid": 410700,
        "level": 2,
        "name": "延津县"
    },
    {
        "id": 410727,
        "code": 410727,
        "pid": 410700,
        "level": 2,
        "name": "封丘县"
    },
    {
        "id": 410724,
        "code": 410724,
        "pid": 410700,
        "level": 2,
        "name": "获嘉县"
    },
    {
        "id": 410725,
        "code": 410725,
        "pid": 410700,
        "level": 2,
        "name": "原阳县"
    },
    {
        "id": 411200,
        "code": 411200,
        "pid": 410000,
        "level": 1,
        "name": "三门峡市"
    },
    {
        "id": 411282,
        "code": 411282,
        "pid": 411200,
        "level": 2,
        "name": "灵宝市"
    },
    {
        "id": 411281,
        "code": 411281,
        "pid": 411200,
        "level": 2,
        "name": "义马市"
    },
    {
        "id": 411221,
        "code": 411221,
        "pid": 411200,
        "level": 2,
        "name": "渑池县"
    },
    {
        "id": 411224,
        "code": 411224,
        "pid": 411200,
        "level": 2,
        "name": "卢氏县"
    },
    {
        "id": 411203,
        "code": 411203,
        "pid": 411200,
        "level": 2,
        "name": "陕州区"
    },
    {
        "id": 411202,
        "code": 411202,
        "pid": 411200,
        "level": 2,
        "name": "湖滨区"
    },
    {
        "id": 410200,
        "code": 410200,
        "pid": 410000,
        "level": 1,
        "name": "开封市"
    },
    {
        "id": 410202,
        "code": 410202,
        "pid": 410200,
        "level": 2,
        "name": "龙亭区"
    },
    {
        "id": 410212,
        "code": 410212,
        "pid": 410200,
        "level": 2,
        "name": "祥符区"
    },
    {
        "id": 410203,
        "code": 410203,
        "pid": 410200,
        "level": 2,
        "name": "顺河回族区"
    },
    {
        "id": 410211,
        "code": 410211,
        "pid": 410200,
        "level": 2,
        "name": "金明区"
    },
    {
        "id": 410205,
        "code": 410205,
        "pid": 410200,
        "level": 2,
        "name": "禹王台区"
    },
    {
        "id": 410204,
        "code": 410204,
        "pid": 410200,
        "level": 2,
        "name": "鼓楼区"
    },
    {
        "id": 410223,
        "code": 410223,
        "pid": 410200,
        "level": 2,
        "name": "尉氏县"
    },
    {
        "id": 410222,
        "code": 410222,
        "pid": 410200,
        "level": 2,
        "name": "通许县"
    },
    {
        "id": 410221,
        "code": 410221,
        "pid": 410200,
        "level": 2,
        "name": "杞县"
    },
    {
        "id": 410225,
        "code": 410225,
        "pid": 410200,
        "level": 2,
        "name": "兰考县"
    },
    {
        "id": 411100,
        "code": 411100,
        "pid": 410000,
        "level": 1,
        "name": "漯河市"
    },
    {
        "id": 411103,
        "code": 411103,
        "pid": 411100,
        "level": 2,
        "name": "郾城区"
    },
    {
        "id": 411104,
        "code": 411104,
        "pid": 411100,
        "level": 2,
        "name": "召陵区"
    },
    {
        "id": 411122,
        "code": 411122,
        "pid": 411100,
        "level": 2,
        "name": "临颍县"
    },
    {
        "id": 411121,
        "code": 411121,
        "pid": 411100,
        "level": 2,
        "name": "舞阳县"
    },
    {
        "id": 411102,
        "code": 411102,
        "pid": 411100,
        "level": 2,
        "name": "源汇区"
    },
    {
        "id": 410600,
        "code": 410600,
        "pid": 410000,
        "level": 1,
        "name": "鹤壁市"
    },
    {
        "id": 410611,
        "code": 410611,
        "pid": 410600,
        "level": 2,
        "name": "淇滨区"
    },
    {
        "id": 410622,
        "code": 410622,
        "pid": 410600,
        "level": 2,
        "name": "淇县"
    },
    {
        "id": 410621,
        "code": 410621,
        "pid": 410600,
        "level": 2,
        "name": "浚县"
    },
    {
        "id": 410603,
        "code": 410603,
        "pid": 410600,
        "level": 2,
        "name": "山城区"
    },
    {
        "id": 410602,
        "code": 410602,
        "pid": 410600,
        "level": 2,
        "name": "鹤山区"
    },
    {
        "id": 411600,
        "code": 411600,
        "pid": 410000,
        "level": 1,
        "name": "周口市"
    },
    {
        "id": 411627,
        "code": 411627,
        "pid": 411600,
        "level": 2,
        "name": "太康县"
    },
    {
        "id": 411602,
        "code": 411602,
        "pid": 411600,
        "level": 2,
        "name": "川汇区"
    },
    {
        "id": 411628,
        "code": 411628,
        "pid": 411600,
        "level": 2,
        "name": "鹿邑县"
    },
    {
        "id": 411624,
        "code": 411624,
        "pid": 411600,
        "level": 2,
        "name": "沈丘县"
    },
    {
        "id": 411625,
        "code": 411625,
        "pid": 411600,
        "level": 2,
        "name": "郸城县"
    },
    {
        "id": 411626,
        "code": 411626,
        "pid": 411600,
        "level": 2,
        "name": "淮阳县"
    },
    {
        "id": 411681,
        "code": 411681,
        "pid": 411600,
        "level": 2,
        "name": "项城市"
    },
    {
        "id": 411621,
        "code": 411621,
        "pid": 411600,
        "level": 2,
        "name": "扶沟县"
    },
    {
        "id": 411622,
        "code": 411622,
        "pid": 411600,
        "level": 2,
        "name": "西华县"
    },
    {
        "id": 411623,
        "code": 411623,
        "pid": 411600,
        "level": 2,
        "name": "商水县"
    },
    {
        "id": 410900,
        "code": 410900,
        "pid": 410000,
        "level": 1,
        "name": "濮阳市"
    },
    {
        "id": 410926,
        "code": 410926,
        "pid": 410900,
        "level": 2,
        "name": "范县"
    },
    {
        "id": 410927,
        "code": 410927,
        "pid": 410900,
        "level": 2,
        "name": "台前县"
    },
    {
        "id": 410922,
        "code": 410922,
        "pid": 410900,
        "level": 2,
        "name": "清丰县"
    },
    {
        "id": 410923,
        "code": 410923,
        "pid": 410900,
        "level": 2,
        "name": "南乐县"
    },
    {
        "id": 410928,
        "code": 410928,
        "pid": 410900,
        "level": 2,
        "name": "濮阳县"
    },
    {
        "id": 410902,
        "code": 410902,
        "pid": 410900,
        "level": 2,
        "name": "华龙区"
    },
    {
        "id": 410500,
        "code": 410500,
        "pid": 410000,
        "level": 1,
        "name": "安阳市"
    },
    {
        "id": 410523,
        "code": 410523,
        "pid": 410500,
        "level": 2,
        "name": "汤阴县"
    },
    {
        "id": 410581,
        "code": 410581,
        "pid": 410500,
        "level": 2,
        "name": "林州市"
    },
    {
        "id": 410506,
        "code": 410506,
        "pid": 410500,
        "level": 2,
        "name": "龙安区"
    },
    {
        "id": 410522,
        "code": 410522,
        "pid": 410500,
        "level": 2,
        "name": "安阳县"
    },
    {
        "id": 410505,
        "code": 410505,
        "pid": 410500,
        "level": 2,
        "name": "殷都区"
    },
    {
        "id": 410502,
        "code": 410502,
        "pid": 410500,
        "level": 2,
        "name": "文峰区"
    },
    {
        "id": 410503,
        "code": 410503,
        "pid": 410500,
        "level": 2,
        "name": "北关区"
    },
    {
        "id": 410526,
        "code": 410526,
        "pid": 410500,
        "level": 2,
        "name": "滑县"
    },
    {
        "id": 410527,
        "code": 410527,
        "pid": 410500,
        "level": 2,
        "name": "内黄县"
    },
    {
        "id": 411500,
        "code": 411500,
        "pid": 410000,
        "level": 1,
        "name": "信阳市"
    },
    {
        "id": 411503,
        "code": 411503,
        "pid": 411500,
        "level": 2,
        "name": "平桥区"
    },
    {
        "id": 411502,
        "code": 411502,
        "pid": 411500,
        "level": 2,
        "name": "浉河区"
    },
    {
        "id": 411523,
        "code": 411523,
        "pid": 411500,
        "level": 2,
        "name": "新县"
    },
    {
        "id": 411522,
        "code": 411522,
        "pid": 411500,
        "level": 2,
        "name": "光山县"
    },
    {
        "id": 411521,
        "code": 411521,
        "pid": 411500,
        "level": 2,
        "name": "罗山县"
    },
    {
        "id": 411527,
        "code": 411527,
        "pid": 411500,
        "level": 2,
        "name": "淮滨县"
    },
    {
        "id": 411526,
        "code": 411526,
        "pid": 411500,
        "level": 2,
        "name": "潢川县"
    },
    {
        "id": 411525,
        "code": 411525,
        "pid": 411500,
        "level": 2,
        "name": "固始县"
    },
    {
        "id": 411524,
        "code": 411524,
        "pid": 411500,
        "level": 2,
        "name": "商城县"
    },
    {
        "id": 411528,
        "code": 411528,
        "pid": 411500,
        "level": 2,
        "name": "息县"
    },
    {
        "id": 411000,
        "code": 411000,
        "pid": 410000,
        "level": 1,
        "name": "许昌市"
    },
    {
        "id": 411002,
        "code": 411002,
        "pid": 411000,
        "level": 2,
        "name": "魏都区"
    },
    {
        "id": 411082,
        "code": 411082,
        "pid": 411000,
        "level": 2,
        "name": "长葛市"
    },
    {
        "id": 411023,
        "code": 411023,
        "pid": 411000,
        "level": 2,
        "name": "许昌县"
    },
    {
        "id": 411081,
        "code": 411081,
        "pid": 411000,
        "level": 2,
        "name": "禹州市"
    },
    {
        "id": 411024,
        "code": 411024,
        "pid": 411000,
        "level": 2,
        "name": "鄢陵县"
    },
    {
        "id": 411025,
        "code": 411025,
        "pid": 411000,
        "level": 2,
        "name": "襄城县"
    },
    {
        "id": 410100,
        "code": 410100,
        "pid": 410000,
        "level": 1,
        "name": "郑州市"
    },
    {
        "id": 410102,
        "code": 410102,
        "pid": 410100,
        "level": 2,
        "name": "中原区"
    },
    {
        "id": 410103,
        "code": 410103,
        "pid": 410100,
        "level": 2,
        "name": "二七区"
    },
    {
        "id": 410106,
        "code": 410106,
        "pid": 410100,
        "level": 2,
        "name": "上街区"
    },
    {
        "id": 410184,
        "code": 410184,
        "pid": 410100,
        "level": 2,
        "name": "新郑市"
    },
    {
        "id": 410104,
        "code": 410104,
        "pid": 410100,
        "level": 2,
        "name": "管城回族区"
    },
    {
        "id": 410105,
        "code": 410105,
        "pid": 410100,
        "level": 2,
        "name": "金水区"
    },
    {
        "id": 410182,
        "code": 410182,
        "pid": 410100,
        "level": 2,
        "name": "荥阳市"
    },
    {
        "id": 410183,
        "code": 410183,
        "pid": 410100,
        "level": 2,
        "name": "新密市"
    },
    {
        "id": 410108,
        "code": 410108,
        "pid": 410100,
        "level": 2,
        "name": "惠济区"
    },
    {
        "id": 410181,
        "code": 410181,
        "pid": 410100,
        "level": 2,
        "name": "巩义市"
    },
    {
        "id": 410122,
        "code": 410122,
        "pid": 410100,
        "level": 2,
        "name": "中牟县"
    },
    {
        "id": 410185,
        "code": 410185,
        "pid": 410100,
        "level": 2,
        "name": "登封市"
    },
    {
        "id": 411700,
        "code": 411700,
        "pid": 410000,
        "level": 1,
        "name": "驻马店市"
    },
    {
        "id": 411702,
        "code": 411702,
        "pid": 411700,
        "level": 2,
        "name": "驿城区"
    },
    {
        "id": 411721,
        "code": 411721,
        "pid": 411700,
        "level": 2,
        "name": "西平县"
    },
    {
        "id": 411723,
        "code": 411723,
        "pid": 411700,
        "level": 2,
        "name": "平舆县"
    },
    {
        "id": 411722,
        "code": 411722,
        "pid": 411700,
        "level": 2,
        "name": "上蔡县"
    },
    {
        "id": 411725,
        "code": 411725,
        "pid": 411700,
        "level": 2,
        "name": "确山县"
    },
    {
        "id": 411724,
        "code": 411724,
        "pid": 411700,
        "level": 2,
        "name": "正阳县"
    },
    {
        "id": 411727,
        "code": 411727,
        "pid": 411700,
        "level": 2,
        "name": "汝南县"
    },
    {
        "id": 411726,
        "code": 411726,
        "pid": 411700,
        "level": 2,
        "name": "泌阳县"
    },
    {
        "id": 411729,
        "code": 411729,
        "pid": 411700,
        "level": 2,
        "name": "新蔡县"
    },
    {
        "id": 411728,
        "code": 411728,
        "pid": 411700,
        "level": 2,
        "name": "遂平县"
    },
    {
        "id": 419000,
        "code": 419000,
        "pid": 410000,
        "level": 1,
        "name": "直辖县市"
    },
    {
        "id": 419001,
        "code": 419001,
        "pid": 419000,
        "level": 2,
        "name": "济源市"
    },
    {
        "id": 411300,
        "code": 411300,
        "pid": 410000,
        "level": 1,
        "name": "南阳市"
    },
    {
        "id": 411323,
        "code": 411323,
        "pid": 411300,
        "level": 2,
        "name": "西峡县"
    },
    {
        "id": 411330,
        "code": 411330,
        "pid": 411300,
        "level": 2,
        "name": "桐柏县"
    },
    {
        "id": 411329,
        "code": 411329,
        "pid": 411300,
        "level": 2,
        "name": "新野县"
    },
    {
        "id": 411302,
        "code": 411302,
        "pid": 411300,
        "level": 2,
        "name": "宛城区"
    },
    {
        "id": 411325,
        "code": 411325,
        "pid": 411300,
        "level": 2,
        "name": "内乡县"
    },
    {
        "id": 411324,
        "code": 411324,
        "pid": 411300,
        "level": 2,
        "name": "镇平县"
    },
    {
        "id": 411327,
        "code": 411327,
        "pid": 411300,
        "level": 2,
        "name": "社旗县"
    },
    {
        "id": 411326,
        "code": 411326,
        "pid": 411300,
        "level": 2,
        "name": "淅川县"
    },
    {
        "id": 411321,
        "code": 411321,
        "pid": 411300,
        "level": 2,
        "name": "南召县"
    },
    {
        "id": 411381,
        "code": 411381,
        "pid": 411300,
        "level": 2,
        "name": "邓州市"
    },
    {
        "id": 411322,
        "code": 411322,
        "pid": 411300,
        "level": 2,
        "name": "方城县"
    },
    {
        "id": 411303,
        "code": 411303,
        "pid": 411300,
        "level": 2,
        "name": "卧龙区"
    },
    {
        "id": 411328,
        "code": 411328,
        "pid": 411300,
        "level": 2,
        "name": "唐河县"
    },
    {
        "id": 410400,
        "code": 410400,
        "pid": 410000,
        "level": 1,
        "name": "平顶山市"
    },
    {
        "id": 410423,
        "code": 410423,
        "pid": 410400,
        "level": 2,
        "name": "鲁山县"
    },
    {
        "id": 410425,
        "code": 410425,
        "pid": 410400,
        "level": 2,
        "name": "郏县"
    },
    {
        "id": 410411,
        "code": 410411,
        "pid": 410400,
        "level": 2,
        "name": "湛河区"
    },
    {
        "id": 410421,
        "code": 410421,
        "pid": 410400,
        "level": 2,
        "name": "宝丰县"
    },
    {
        "id": 410482,
        "code": 410482,
        "pid": 410400,
        "level": 2,
        "name": "汝州市"
    },
    {
        "id": 410481,
        "code": 410481,
        "pid": 410400,
        "level": 2,
        "name": "舞钢市"
    },
    {
        "id": 410422,
        "code": 410422,
        "pid": 410400,
        "level": 2,
        "name": "叶县"
    },
    {
        "id": 410404,
        "code": 410404,
        "pid": 410400,
        "level": 2,
        "name": "石龙区"
    },
    {
        "id": 410403,
        "code": 410403,
        "pid": 410400,
        "level": 2,
        "name": "卫东区"
    },
    {
        "id": 410402,
        "code": 410402,
        "pid": 410400,
        "level": 2,
        "name": "新华区"
    },
    {
        "id": 220000,
        "code": 220000,
        "pid": 0,
        "level": 0,
        "name": "吉林省"
    },
    {
        "id": 220400,
        "code": 220400,
        "pid": 220000,
        "level": 1,
        "name": "辽源市"
    },
    {
        "id": 220421,
        "code": 220421,
        "pid": 220400,
        "level": 2,
        "name": "东丰县"
    },
    {
        "id": 220422,
        "code": 220422,
        "pid": 220400,
        "level": 2,
        "name": "东辽县"
    },
    {
        "id": 220402,
        "code": 220402,
        "pid": 220400,
        "level": 2,
        "name": "龙山区"
    },
    {
        "id": 220403,
        "code": 220403,
        "pid": 220400,
        "level": 2,
        "name": "西安区"
    },
    {
        "id": 220800,
        "code": 220800,
        "pid": 220000,
        "level": 1,
        "name": "白城市"
    },
    {
        "id": 220882,
        "code": 220882,
        "pid": 220800,
        "level": 2,
        "name": "大安市"
    },
    {
        "id": 220802,
        "code": 220802,
        "pid": 220800,
        "level": 2,
        "name": "洮北区"
    },
    {
        "id": 220881,
        "code": 220881,
        "pid": 220800,
        "level": 2,
        "name": "洮南市"
    },
    {
        "id": 220821,
        "code": 220821,
        "pid": 220800,
        "level": 2,
        "name": "镇赉县"
    },
    {
        "id": 220822,
        "code": 220822,
        "pid": 220800,
        "level": 2,
        "name": "通榆县"
    },
    {
        "id": 220100,
        "code": 220100,
        "pid": 220000,
        "level": 1,
        "name": "长春市"
    },
    {
        "id": 220122,
        "code": 220122,
        "pid": 220100,
        "level": 2,
        "name": "农安县"
    },
    {
        "id": 220103,
        "code": 220103,
        "pid": 220100,
        "level": 2,
        "name": "宽城区"
    },
    {
        "id": 220102,
        "code": 220102,
        "pid": 220100,
        "level": 2,
        "name": "南关区"
    },
    {
        "id": 220106,
        "code": 220106,
        "pid": 220100,
        "level": 2,
        "name": "绿园区"
    },
    {
        "id": 220112,
        "code": 220112,
        "pid": 220100,
        "level": 2,
        "name": "双阳区"
    },
    {
        "id": 220104,
        "code": 220104,
        "pid": 220100,
        "level": 2,
        "name": "朝阳区"
    },
    {
        "id": 220183,
        "code": 220183,
        "pid": 220100,
        "level": 2,
        "name": "德惠市"
    },
    {
        "id": 220182,
        "code": 220182,
        "pid": 220100,
        "level": 2,
        "name": "榆树市"
    },
    {
        "id": 220105,
        "code": 220105,
        "pid": 220100,
        "level": 2,
        "name": "二道区"
    },
    {
        "id": 220113,
        "code": 220113,
        "pid": 220100,
        "level": 2,
        "name": "九台区"
    },
    {
        "id": 220500,
        "code": 220500,
        "pid": 220000,
        "level": 1,
        "name": "通化市"
    },
    {
        "id": 220524,
        "code": 220524,
        "pid": 220500,
        "level": 2,
        "name": "柳河县"
    },
    {
        "id": 220521,
        "code": 220521,
        "pid": 220500,
        "level": 2,
        "name": "通化县"
    },
    {
        "id": 220582,
        "code": 220582,
        "pid": 220500,
        "level": 2,
        "name": "集安市"
    },
    {
        "id": 220523,
        "code": 220523,
        "pid": 220500,
        "level": 2,
        "name": "辉南县"
    },
    {
        "id": 220581,
        "code": 220581,
        "pid": 220500,
        "level": 2,
        "name": "梅河口市"
    },
    {
        "id": 220503,
        "code": 220503,
        "pid": 220500,
        "level": 2,
        "name": "二道江区"
    },
    {
        "id": 220502,
        "code": 220502,
        "pid": 220500,
        "level": 2,
        "name": "东昌区"
    },
    {
        "id": 220200,
        "code": 220200,
        "pid": 220000,
        "level": 1,
        "name": "吉林市"
    },
    {
        "id": 220281,
        "code": 220281,
        "pid": 220200,
        "level": 2,
        "name": "蛟河市"
    },
    {
        "id": 220282,
        "code": 220282,
        "pid": 220200,
        "level": 2,
        "name": "桦甸市"
    },
    {
        "id": 220283,
        "code": 220283,
        "pid": 220200,
        "level": 2,
        "name": "舒兰市"
    },
    {
        "id": 220284,
        "code": 220284,
        "pid": 220200,
        "level": 2,
        "name": "磐石市"
    },
    {
        "id": 220202,
        "code": 220202,
        "pid": 220200,
        "level": 2,
        "name": "昌邑区"
    },
    {
        "id": 220203,
        "code": 220203,
        "pid": 220200,
        "level": 2,
        "name": "龙潭区"
    },
    {
        "id": 220204,
        "code": 220204,
        "pid": 220200,
        "level": 2,
        "name": "船营区"
    },
    {
        "id": 220221,
        "code": 220221,
        "pid": 220200,
        "level": 2,
        "name": "永吉县"
    },
    {
        "id": 220211,
        "code": 220211,
        "pid": 220200,
        "level": 2,
        "name": "丰满区"
    },
    {
        "id": 220600,
        "code": 220600,
        "pid": 220000,
        "level": 1,
        "name": "白山市"
    },
    {
        "id": 220622,
        "code": 220622,
        "pid": 220600,
        "level": 2,
        "name": "靖宇县"
    },
    {
        "id": 220623,
        "code": 220623,
        "pid": 220600,
        "level": 2,
        "name": "长白朝鲜族自治县"
    },
    {
        "id": 220621,
        "code": 220621,
        "pid": 220600,
        "level": 2,
        "name": "抚松县"
    },
    {
        "id": 220681,
        "code": 220681,
        "pid": 220600,
        "level": 2,
        "name": "临江市"
    },
    {
        "id": 220605,
        "code": 220605,
        "pid": 220600,
        "level": 2,
        "name": "江源区"
    },
    {
        "id": 220602,
        "code": 220602,
        "pid": 220600,
        "level": 2,
        "name": "浑江区"
    },
    {
        "id": 222400,
        "code": 222400,
        "pid": 220000,
        "level": 1,
        "name": "延边朝鲜族自治州"
    },
    {
        "id": 222424,
        "code": 222424,
        "pid": 222400,
        "level": 2,
        "name": "汪清县"
    },
    {
        "id": 222426,
        "code": 222426,
        "pid": 222400,
        "level": 2,
        "name": "安图县"
    },
    {
        "id": 222401,
        "code": 222401,
        "pid": 222400,
        "level": 2,
        "name": "延吉市"
    },
    {
        "id": 222402,
        "code": 222402,
        "pid": 222400,
        "level": 2,
        "name": "图们市"
    },
    {
        "id": 222403,
        "code": 222403,
        "pid": 222400,
        "level": 2,
        "name": "敦化市"
    },
    {
        "id": 222404,
        "code": 222404,
        "pid": 222400,
        "level": 2,
        "name": "珲春市"
    },
    {
        "id": 222405,
        "code": 222405,
        "pid": 222400,
        "level": 2,
        "name": "龙井市"
    },
    {
        "id": 222406,
        "code": 222406,
        "pid": 222400,
        "level": 2,
        "name": "和龙市"
    },
    {
        "id": 220300,
        "code": 220300,
        "pid": 220000,
        "level": 1,
        "name": "四平市"
    },
    {
        "id": 220323,
        "code": 220323,
        "pid": 220300,
        "level": 2,
        "name": "伊通满族自治县"
    },
    {
        "id": 220322,
        "code": 220322,
        "pid": 220300,
        "level": 2,
        "name": "梨树县"
    },
    {
        "id": 220381,
        "code": 220381,
        "pid": 220300,
        "level": 2,
        "name": "公主岭市"
    },
    {
        "id": 220382,
        "code": 220382,
        "pid": 220300,
        "level": 2,
        "name": "双辽市"
    },
    {
        "id": 220303,
        "code": 220303,
        "pid": 220300,
        "level": 2,
        "name": "铁东区"
    },
    {
        "id": 220302,
        "code": 220302,
        "pid": 220300,
        "level": 2,
        "name": "铁西区"
    },
    {
        "id": 220700,
        "code": 220700,
        "pid": 220000,
        "level": 1,
        "name": "松原市"
    },
    {
        "id": 220781,
        "code": 220781,
        "pid": 220700,
        "level": 2,
        "name": "扶余市"
    },
    {
        "id": 220723,
        "code": 220723,
        "pid": 220700,
        "level": 2,
        "name": "乾安县"
    },
    {
        "id": 220722,
        "code": 220722,
        "pid": 220700,
        "level": 2,
        "name": "长岭县"
    },
    {
        "id": 220721,
        "code": 220721,
        "pid": 220700,
        "level": 2,
        "name": "前郭尔罗斯蒙古族自治县"
    },
    {
        "id": 220702,
        "code": 220702,
        "pid": 220700,
        "level": 2,
        "name": "宁江区"
    },
    {
        "id": 520000,
        "code": 520000,
        "pid": 0,
        "level": 0,
        "name": "贵州省"
    },
    {
        "id": 520300,
        "code": 520300,
        "pid": 520000,
        "level": 1,
        "name": "遵义市"
    },
    {
        "id": 520326,
        "code": 520326,
        "pid": 520300,
        "level": 2,
        "name": "务川仡佬族苗族自治县"
    },
    {
        "id": 520327,
        "code": 520327,
        "pid": 520300,
        "level": 2,
        "name": "凤冈县"
    },
    {
        "id": 520324,
        "code": 520324,
        "pid": 520300,
        "level": 2,
        "name": "正安县"
    },
    {
        "id": 520325,
        "code": 520325,
        "pid": 520300,
        "level": 2,
        "name": "道真仡佬族苗族自治县"
    },
    {
        "id": 520322,
        "code": 520322,
        "pid": 520300,
        "level": 2,
        "name": "桐梓县"
    },
    {
        "id": 520323,
        "code": 520323,
        "pid": 520300,
        "level": 2,
        "name": "绥阳县"
    },
    {
        "id": 520302,
        "code": 520302,
        "pid": 520300,
        "level": 2,
        "name": "红花岗区"
    },
    {
        "id": 520328,
        "code": 520328,
        "pid": 520300,
        "level": 2,
        "name": "湄潭县"
    },
    {
        "id": 520329,
        "code": 520329,
        "pid": 520300,
        "level": 2,
        "name": "余庆县"
    },
    {
        "id": 520303,
        "code": 520303,
        "pid": 520300,
        "level": 2,
        "name": "汇川区"
    },
    {
        "id": 520381,
        "code": 520381,
        "pid": 520300,
        "level": 2,
        "name": "赤水市"
    },
    {
        "id": 520304,
        "code": 520304,
        "pid": 520300,
        "level": 2,
        "name": "播州区"
    },
    {
        "id": 520382,
        "code": 520382,
        "pid": 520300,
        "level": 2,
        "name": "仁怀市"
    },
    {
        "id": 520330,
        "code": 520330,
        "pid": 520300,
        "level": 2,
        "name": "习水县"
    },
    {
        "id": 520200,
        "code": 520200,
        "pid": 520000,
        "level": 1,
        "name": "六盘水市"
    },
    {
        "id": 520201,
        "code": 520201,
        "pid": 520200,
        "level": 2,
        "name": "钟山区"
    },
    {
        "id": 520222,
        "code": 520222,
        "pid": 520200,
        "level": 2,
        "name": "盘县"
    },
    {
        "id": 520203,
        "code": 520203,
        "pid": 520200,
        "level": 2,
        "name": "六枝特区"
    },
    {
        "id": 520221,
        "code": 520221,
        "pid": 520200,
        "level": 2,
        "name": "水城县"
    },
    {
        "id": 522300,
        "code": 522300,
        "pid": 520000,
        "level": 1,
        "name": "黔西南布依族苗族自治州"
    },
    {
        "id": 522301,
        "code": 522301,
        "pid": 522300,
        "level": 2,
        "name": "兴义市"
    },
    {
        "id": 522324,
        "code": 522324,
        "pid": 522300,
        "level": 2,
        "name": "晴隆县"
    },
    {
        "id": 522325,
        "code": 522325,
        "pid": 522300,
        "level": 2,
        "name": "贞丰县"
    },
    {
        "id": 522326,
        "code": 522326,
        "pid": 522300,
        "level": 2,
        "name": "望谟县"
    },
    {
        "id": 522327,
        "code": 522327,
        "pid": 522300,
        "level": 2,
        "name": "册亨县"
    },
    {
        "id": 522322,
        "code": 522322,
        "pid": 522300,
        "level": 2,
        "name": "兴仁县"
    },
    {
        "id": 522323,
        "code": 522323,
        "pid": 522300,
        "level": 2,
        "name": "普安县"
    },
    {
        "id": 522328,
        "code": 522328,
        "pid": 522300,
        "level": 2,
        "name": "安龙县"
    },
    {
        "id": 520600,
        "code": 520600,
        "pid": 520000,
        "level": 1,
        "name": "铜仁市"
    },
    {
        "id": 520603,
        "code": 520603,
        "pid": 520600,
        "level": 2,
        "name": "万山区"
    },
    {
        "id": 520602,
        "code": 520602,
        "pid": 520600,
        "level": 2,
        "name": "碧江区"
    },
    {
        "id": 520627,
        "code": 520627,
        "pid": 520600,
        "level": 2,
        "name": "沿河土家族自治县"
    },
    {
        "id": 520626,
        "code": 520626,
        "pid": 520600,
        "level": 2,
        "name": "德江县"
    },
    {
        "id": 520625,
        "code": 520625,
        "pid": 520600,
        "level": 2,
        "name": "印江土家族苗族自治县"
    },
    {
        "id": 520624,
        "code": 520624,
        "pid": 520600,
        "level": 2,
        "name": "思南县"
    },
    {
        "id": 520623,
        "code": 520623,
        "pid": 520600,
        "level": 2,
        "name": "石阡县"
    },
    {
        "id": 520622,
        "code": 520622,
        "pid": 520600,
        "level": 2,
        "name": "玉屏侗族自治县"
    },
    {
        "id": 520621,
        "code": 520621,
        "pid": 520600,
        "level": 2,
        "name": "江口县"
    },
    {
        "id": 520628,
        "code": 520628,
        "pid": 520600,
        "level": 2,
        "name": "松桃苗族自治县"
    },
    {
        "id": 522700,
        "code": 522700,
        "pid": 520000,
        "level": 1,
        "name": "黔南布依族苗族自治州"
    },
    {
        "id": 522728,
        "code": 522728,
        "pid": 522700,
        "level": 2,
        "name": "罗甸县"
    },
    {
        "id": 522729,
        "code": 522729,
        "pid": 522700,
        "level": 2,
        "name": "长顺县"
    },
    {
        "id": 522722,
        "code": 522722,
        "pid": 522700,
        "level": 2,
        "name": "荔波县"
    },
    {
        "id": 522723,
        "code": 522723,
        "pid": 522700,
        "level": 2,
        "name": "贵定县"
    },
    {
        "id": 522702,
        "code": 522702,
        "pid": 522700,
        "level": 2,
        "name": "福泉市"
    },
    {
        "id": 522725,
        "code": 522725,
        "pid": 522700,
        "level": 2,
        "name": "瓮安县"
    },
    {
        "id": 522726,
        "code": 522726,
        "pid": 522700,
        "level": 2,
        "name": "独山县"
    },
    {
        "id": 522727,
        "code": 522727,
        "pid": 522700,
        "level": 2,
        "name": "平塘县"
    },
    {
        "id": 522732,
        "code": 522732,
        "pid": 522700,
        "level": 2,
        "name": "三都水族自治县"
    },
    {
        "id": 522731,
        "code": 522731,
        "pid": 522700,
        "level": 2,
        "name": "惠水县"
    },
    {
        "id": 522730,
        "code": 522730,
        "pid": 522700,
        "level": 2,
        "name": "龙里县"
    },
    {
        "id": 522701,
        "code": 522701,
        "pid": 522700,
        "level": 2,
        "name": "都匀市"
    },
    {
        "id": 520100,
        "code": 520100,
        "pid": 520000,
        "level": 1,
        "name": "贵阳市"
    },
    {
        "id": 520111,
        "code": 520111,
        "pid": 520100,
        "level": 2,
        "name": "花溪区"
    },
    {
        "id": 520102,
        "code": 520102,
        "pid": 520100,
        "level": 2,
        "name": "南明区"
    },
    {
        "id": 520103,
        "code": 520103,
        "pid": 520100,
        "level": 2,
        "name": "云岩区"
    },
    {
        "id": 520113,
        "code": 520113,
        "pid": 520100,
        "level": 2,
        "name": "白云区"
    },
    {
        "id": 520112,
        "code": 520112,
        "pid": 520100,
        "level": 2,
        "name": "乌当区"
    },
    {
        "id": 520115,
        "code": 520115,
        "pid": 520100,
        "level": 2,
        "name": "观山湖区"
    },
    {
        "id": 520181,
        "code": 520181,
        "pid": 520100,
        "level": 2,
        "name": "清镇市"
    },
    {
        "id": 520121,
        "code": 520121,
        "pid": 520100,
        "level": 2,
        "name": "开阳县"
    },
    {
        "id": 520122,
        "code": 520122,
        "pid": 520100,
        "level": 2,
        "name": "息烽县"
    },
    {
        "id": 520123,
        "code": 520123,
        "pid": 520100,
        "level": 2,
        "name": "修文县"
    },
    {
        "id": 520500,
        "code": 520500,
        "pid": 520000,
        "level": 1,
        "name": "毕节市"
    },
    {
        "id": 520521,
        "code": 520521,
        "pid": 520500,
        "level": 2,
        "name": "大方县"
    },
    {
        "id": 520522,
        "code": 520522,
        "pid": 520500,
        "level": 2,
        "name": "黔西县"
    },
    {
        "id": 520523,
        "code": 520523,
        "pid": 520500,
        "level": 2,
        "name": "金沙县"
    },
    {
        "id": 520524,
        "code": 520524,
        "pid": 520500,
        "level": 2,
        "name": "织金县"
    },
    {
        "id": 520525,
        "code": 520525,
        "pid": 520500,
        "level": 2,
        "name": "纳雍县"
    },
    {
        "id": 520526,
        "code": 520526,
        "pid": 520500,
        "level": 2,
        "name": "威宁彝族回族苗族自治县"
    },
    {
        "id": 520527,
        "code": 520527,
        "pid": 520500,
        "level": 2,
        "name": "赫章县"
    },
    {
        "id": 520502,
        "code": 520502,
        "pid": 520500,
        "level": 2,
        "name": "七星关区"
    },
    {
        "id": 522600,
        "code": 522600,
        "pid": 520000,
        "level": 1,
        "name": "黔东南苗族侗族自治州"
    },
    {
        "id": 522635,
        "code": 522635,
        "pid": 522600,
        "level": 2,
        "name": "麻江县"
    },
    {
        "id": 522629,
        "code": 522629,
        "pid": 522600,
        "level": 2,
        "name": "剑河县"
    },
    {
        "id": 522628,
        "code": 522628,
        "pid": 522600,
        "level": 2,
        "name": "锦屏县"
    },
    {
        "id": 522625,
        "code": 522625,
        "pid": 522600,
        "level": 2,
        "name": "镇远县"
    },
    {
        "id": 522624,
        "code": 522624,
        "pid": 522600,
        "level": 2,
        "name": "三穗县"
    },
    {
        "id": 522627,
        "code": 522627,
        "pid": 522600,
        "level": 2,
        "name": "天柱县"
    },
    {
        "id": 522626,
        "code": 522626,
        "pid": 522600,
        "level": 2,
        "name": "岑巩县"
    },
    {
        "id": 522632,
        "code": 522632,
        "pid": 522600,
        "level": 2,
        "name": "榕江县"
    },
    {
        "id": 522633,
        "code": 522633,
        "pid": 522600,
        "level": 2,
        "name": "从江县"
    },
    {
        "id": 522630,
        "code": 522630,
        "pid": 522600,
        "level": 2,
        "name": "台江县"
    },
    {
        "id": 522631,
        "code": 522631,
        "pid": 522600,
        "level": 2,
        "name": "黎平县"
    },
    {
        "id": 522636,
        "code": 522636,
        "pid": 522600,
        "level": 2,
        "name": "丹寨县"
    },
    {
        "id": 522623,
        "code": 522623,
        "pid": 522600,
        "level": 2,
        "name": "施秉县"
    },
    {
        "id": 522601,
        "code": 522601,
        "pid": 522600,
        "level": 2,
        "name": "凯里市"
    },
    {
        "id": 522622,
        "code": 522622,
        "pid": 522600,
        "level": 2,
        "name": "黄平县"
    },
    {
        "id": 522634,
        "code": 522634,
        "pid": 522600,
        "level": 2,
        "name": "雷山县"
    },
    {
        "id": 520400,
        "code": 520400,
        "pid": 520000,
        "level": 1,
        "name": "安顺市"
    },
    {
        "id": 520425,
        "code": 520425,
        "pid": 520400,
        "level": 2,
        "name": "紫云苗族布依族自治县"
    },
    {
        "id": 520424,
        "code": 520424,
        "pid": 520400,
        "level": 2,
        "name": "关岭布依族苗族自治县"
    },
    {
        "id": 520423,
        "code": 520423,
        "pid": 520400,
        "level": 2,
        "name": "镇宁布依族苗族自治县"
    },
    {
        "id": 520422,
        "code": 520422,
        "pid": 520400,
        "level": 2,
        "name": "普定县"
    },
    {
        "id": 520403,
        "code": 520403,
        "pid": 520400,
        "level": 2,
        "name": "平坝区"
    },
    {
        "id": 520402,
        "code": 520402,
        "pid": 520400,
        "level": 2,
        "name": "西秀区"
    },
    {
        "id": 610000,
        "code": 610000,
        "pid": 0,
        "level": 0,
        "name": "陕西省"
    },
    {
        "id": 610400,
        "code": 610400,
        "pid": 610000,
        "level": 1,
        "name": "咸阳市"
    },
    {
        "id": 610403,
        "code": 610403,
        "pid": 610400,
        "level": 2,
        "name": "杨陵区"
    },
    {
        "id": 610402,
        "code": 610402,
        "pid": 610400,
        "level": 2,
        "name": "秦都区"
    },
    {
        "id": 610404,
        "code": 610404,
        "pid": 610400,
        "level": 2,
        "name": "渭城区"
    },
    {
        "id": 610481,
        "code": 610481,
        "pid": 610400,
        "level": 2,
        "name": "兴平市"
    },
    {
        "id": 610422,
        "code": 610422,
        "pid": 610400,
        "level": 2,
        "name": "三原县"
    },
    {
        "id": 610427,
        "code": 610427,
        "pid": 610400,
        "level": 2,
        "name": "彬县"
    },
    {
        "id": 610426,
        "code": 610426,
        "pid": 610400,
        "level": 2,
        "name": "永寿县"
    },
    {
        "id": 610425,
        "code": 610425,
        "pid": 610400,
        "level": 2,
        "name": "礼泉县"
    },
    {
        "id": 610424,
        "code": 610424,
        "pid": 610400,
        "level": 2,
        "name": "乾县"
    },
    {
        "id": 610430,
        "code": 610430,
        "pid": 610400,
        "level": 2,
        "name": "淳化县"
    },
    {
        "id": 610423,
        "code": 610423,
        "pid": 610400,
        "level": 2,
        "name": "泾阳县"
    },
    {
        "id": 610428,
        "code": 610428,
        "pid": 610400,
        "level": 2,
        "name": "长武县"
    },
    {
        "id": 610429,
        "code": 610429,
        "pid": 610400,
        "level": 2,
        "name": "旬邑县"
    },
    {
        "id": 610431,
        "code": 610431,
        "pid": 610400,
        "level": 2,
        "name": "武功县"
    },
    {
        "id": 610700,
        "code": 610700,
        "pid": 610000,
        "level": 1,
        "name": "汉中市"
    },
    {
        "id": 610730,
        "code": 610730,
        "pid": 610700,
        "level": 2,
        "name": "佛坪县"
    },
    {
        "id": 610702,
        "code": 610702,
        "pid": 610700,
        "level": 2,
        "name": "汉台区"
    },
    {
        "id": 610724,
        "code": 610724,
        "pid": 610700,
        "level": 2,
        "name": "西乡县"
    },
    {
        "id": 610725,
        "code": 610725,
        "pid": 610700,
        "level": 2,
        "name": "勉县"
    },
    {
        "id": 610726,
        "code": 610726,
        "pid": 610700,
        "level": 2,
        "name": "宁强县"
    },
    {
        "id": 610727,
        "code": 610727,
        "pid": 610700,
        "level": 2,
        "name": "略阳县"
    },
    {
        "id": 610721,
        "code": 610721,
        "pid": 610700,
        "level": 2,
        "name": "南郑县"
    },
    {
        "id": 610722,
        "code": 610722,
        "pid": 610700,
        "level": 2,
        "name": "城固县"
    },
    {
        "id": 610723,
        "code": 610723,
        "pid": 610700,
        "level": 2,
        "name": "洋县"
    },
    {
        "id": 610728,
        "code": 610728,
        "pid": 610700,
        "level": 2,
        "name": "镇巴县"
    },
    {
        "id": 610729,
        "code": 610729,
        "pid": 610700,
        "level": 2,
        "name": "留坝县"
    },
    {
        "id": 611000,
        "code": 611000,
        "pid": 610000,
        "level": 1,
        "name": "商洛市"
    },
    {
        "id": 611021,
        "code": 611021,
        "pid": 611000,
        "level": 2,
        "name": "洛南县"
    },
    {
        "id": 611022,
        "code": 611022,
        "pid": 611000,
        "level": 2,
        "name": "丹凤县"
    },
    {
        "id": 611023,
        "code": 611023,
        "pid": 611000,
        "level": 2,
        "name": "商南县"
    },
    {
        "id": 611024,
        "code": 611024,
        "pid": 611000,
        "level": 2,
        "name": "山阳县"
    },
    {
        "id": 611025,
        "code": 611025,
        "pid": 611000,
        "level": 2,
        "name": "镇安县"
    },
    {
        "id": 611026,
        "code": 611026,
        "pid": 611000,
        "level": 2,
        "name": "柞水县"
    },
    {
        "id": 611002,
        "code": 611002,
        "pid": 611000,
        "level": 2,
        "name": "商州区"
    },
    {
        "id": 610600,
        "code": 610600,
        "pid": 610000,
        "level": 1,
        "name": "延安市"
    },
    {
        "id": 610629,
        "code": 610629,
        "pid": 610600,
        "level": 2,
        "name": "洛川县"
    },
    {
        "id": 610628,
        "code": 610628,
        "pid": 610600,
        "level": 2,
        "name": "富县"
    },
    {
        "id": 610622,
        "code": 610622,
        "pid": 610600,
        "level": 2,
        "name": "延川县"
    },
    {
        "id": 610621,
        "code": 610621,
        "pid": 610600,
        "level": 2,
        "name": "延长县"
    },
    {
        "id": 610632,
        "code": 610632,
        "pid": 610600,
        "level": 2,
        "name": "黄陵县"
    },
    {
        "id": 610630,
        "code": 610630,
        "pid": 610600,
        "level": 2,
        "name": "宜川县"
    },
    {
        "id": 610631,
        "code": 610631,
        "pid": 610600,
        "level": 2,
        "name": "黄龙县"
    },
    {
        "id": 610625,
        "code": 610625,
        "pid": 610600,
        "level": 2,
        "name": "志丹县"
    },
    {
        "id": 610627,
        "code": 610627,
        "pid": 610600,
        "level": 2,
        "name": "甘泉县"
    },
    {
        "id": 610626,
        "code": 610626,
        "pid": 610600,
        "level": 2,
        "name": "吴起县"
    },
    {
        "id": 610603,
        "code": 610603,
        "pid": 610600,
        "level": 2,
        "name": "安塞区"
    },
    {
        "id": 610602,
        "code": 610602,
        "pid": 610600,
        "level": 2,
        "name": "宝塔区"
    },
    {
        "id": 610623,
        "code": 610623,
        "pid": 610600,
        "level": 2,
        "name": "子长县"
    },
    {
        "id": 610900,
        "code": 610900,
        "pid": 610000,
        "level": 1,
        "name": "安康市"
    },
    {
        "id": 610928,
        "code": 610928,
        "pid": 610900,
        "level": 2,
        "name": "旬阳县"
    },
    {
        "id": 610929,
        "code": 610929,
        "pid": 610900,
        "level": 2,
        "name": "白河县"
    },
    {
        "id": 610922,
        "code": 610922,
        "pid": 610900,
        "level": 2,
        "name": "石泉县"
    },
    {
        "id": 610923,
        "code": 610923,
        "pid": 610900,
        "level": 2,
        "name": "宁陕县"
    },
    {
        "id": 610921,
        "code": 610921,
        "pid": 610900,
        "level": 2,
        "name": "汉阴县"
    },
    {
        "id": 610926,
        "code": 610926,
        "pid": 610900,
        "level": 2,
        "name": "平利县"
    },
    {
        "id": 610927,
        "code": 610927,
        "pid": 610900,
        "level": 2,
        "name": "镇坪县"
    },
    {
        "id": 610924,
        "code": 610924,
        "pid": 610900,
        "level": 2,
        "name": "紫阳县"
    },
    {
        "id": 610925,
        "code": 610925,
        "pid": 610900,
        "level": 2,
        "name": "岚皋县"
    },
    {
        "id": 610902,
        "code": 610902,
        "pid": 610900,
        "level": 2,
        "name": "汉滨区"
    },
    {
        "id": 610300,
        "code": 610300,
        "pid": 610000,
        "level": 1,
        "name": "宝鸡市"
    },
    {
        "id": 610328,
        "code": 610328,
        "pid": 610300,
        "level": 2,
        "name": "千阳县"
    },
    {
        "id": 610329,
        "code": 610329,
        "pid": 610300,
        "level": 2,
        "name": "麟游县"
    },
    {
        "id": 610302,
        "code": 610302,
        "pid": 610300,
        "level": 2,
        "name": "渭滨区"
    },
    {
        "id": 610304,
        "code": 610304,
        "pid": 610300,
        "level": 2,
        "name": "陈仓区"
    },
    {
        "id": 610323,
        "code": 610323,
        "pid": 610300,
        "level": 2,
        "name": "岐山县"
    },
    {
        "id": 610324,
        "code": 610324,
        "pid": 610300,
        "level": 2,
        "name": "扶风县"
    },
    {
        "id": 610303,
        "code": 610303,
        "pid": 610300,
        "level": 2,
        "name": "金台区"
    },
    {
        "id": 610326,
        "code": 610326,
        "pid": 610300,
        "level": 2,
        "name": "眉县"
    },
    {
        "id": 610327,
        "code": 610327,
        "pid": 610300,
        "level": 2,
        "name": "陇县"
    },
    {
        "id": 610331,
        "code": 610331,
        "pid": 610300,
        "level": 2,
        "name": "太白县"
    },
    {
        "id": 610330,
        "code": 610330,
        "pid": 610300,
        "level": 2,
        "name": "凤县"
    },
    {
        "id": 610322,
        "code": 610322,
        "pid": 610300,
        "level": 2,
        "name": "凤翔县"
    },
    {
        "id": 610200,
        "code": 610200,
        "pid": 610000,
        "level": 1,
        "name": "铜川市"
    },
    {
        "id": 610204,
        "code": 610204,
        "pid": 610200,
        "level": 2,
        "name": "耀州区"
    },
    {
        "id": 610203,
        "code": 610203,
        "pid": 610200,
        "level": 2,
        "name": "印台区"
    },
    {
        "id": 610202,
        "code": 610202,
        "pid": 610200,
        "level": 2,
        "name": "王益区"
    },
    {
        "id": 610222,
        "code": 610222,
        "pid": 610200,
        "level": 2,
        "name": "宜君县"
    },
    {
        "id": 610500,
        "code": 610500,
        "pid": 610000,
        "level": 1,
        "name": "渭南市"
    },
    {
        "id": 610581,
        "code": 610581,
        "pid": 610500,
        "level": 2,
        "name": "韩城市"
    },
    {
        "id": 610582,
        "code": 610582,
        "pid": 610500,
        "level": 2,
        "name": "华阴市"
    },
    {
        "id": 610525,
        "code": 610525,
        "pid": 610500,
        "level": 2,
        "name": "澄城县"
    },
    {
        "id": 610524,
        "code": 610524,
        "pid": 610500,
        "level": 2,
        "name": "合阳县"
    },
    {
        "id": 610528,
        "code": 610528,
        "pid": 610500,
        "level": 2,
        "name": "富平县"
    },
    {
        "id": 610526,
        "code": 610526,
        "pid": 610500,
        "level": 2,
        "name": "蒲城县"
    },
    {
        "id": 610527,
        "code": 610527,
        "pid": 610500,
        "level": 2,
        "name": "白水县"
    },
    {
        "id": 610502,
        "code": 610502,
        "pid": 610500,
        "level": 2,
        "name": "临渭区"
    },
    {
        "id": 610503,
        "code": 610503,
        "pid": 610500,
        "level": 2,
        "name": "华州区"
    },
    {
        "id": 610522,
        "code": 610522,
        "pid": 610500,
        "level": 2,
        "name": "潼关县"
    },
    {
        "id": 610523,
        "code": 610523,
        "pid": 610500,
        "level": 2,
        "name": "大荔县"
    },
    {
        "id": 610100,
        "code": 610100,
        "pid": 610000,
        "level": 1,
        "name": "西安市"
    },
    {
        "id": 610122,
        "code": 610122,
        "pid": 610100,
        "level": 2,
        "name": "蓝田县"
    },
    {
        "id": 610104,
        "code": 610104,
        "pid": 610100,
        "level": 2,
        "name": "莲湖区"
    },
    {
        "id": 610102,
        "code": 610102,
        "pid": 610100,
        "level": 2,
        "name": "新城区"
    },
    {
        "id": 610124,
        "code": 610124,
        "pid": 610100,
        "level": 2,
        "name": "周至县"
    },
    {
        "id": 610125,
        "code": 610125,
        "pid": 610100,
        "level": 2,
        "name": "户县"
    },
    {
        "id": 610113,
        "code": 610113,
        "pid": 610100,
        "level": 2,
        "name": "雁塔区"
    },
    {
        "id": 610112,
        "code": 610112,
        "pid": 610100,
        "level": 2,
        "name": "未央区"
    },
    {
        "id": 610111,
        "code": 610111,
        "pid": 610100,
        "level": 2,
        "name": "灞桥区"
    },
    {
        "id": 610103,
        "code": 610103,
        "pid": 610100,
        "level": 2,
        "name": "碑林区"
    },
    {
        "id": 610117,
        "code": 610117,
        "pid": 610100,
        "level": 2,
        "name": "高陵区"
    },
    {
        "id": 610116,
        "code": 610116,
        "pid": 610100,
        "level": 2,
        "name": "长安区"
    },
    {
        "id": 610115,
        "code": 610115,
        "pid": 610100,
        "level": 2,
        "name": "临潼区"
    },
    {
        "id": 610114,
        "code": 610114,
        "pid": 610100,
        "level": 2,
        "name": "阎良区"
    },
    {
        "id": 610800,
        "code": 610800,
        "pid": 610000,
        "level": 1,
        "name": "榆林市"
    },
    {
        "id": 610827,
        "code": 610827,
        "pid": 610800,
        "level": 2,
        "name": "米脂县"
    },
    {
        "id": 610826,
        "code": 610826,
        "pid": 610800,
        "level": 2,
        "name": "绥德县"
    },
    {
        "id": 610825,
        "code": 610825,
        "pid": 610800,
        "level": 2,
        "name": "定边县"
    },
    {
        "id": 610824,
        "code": 610824,
        "pid": 610800,
        "level": 2,
        "name": "靖边县"
    },
    {
        "id": 610822,
        "code": 610822,
        "pid": 610800,
        "level": 2,
        "name": "府谷县"
    },
    {
        "id": 610821,
        "code": 610821,
        "pid": 610800,
        "level": 2,
        "name": "神木县"
    },
    {
        "id": 610829,
        "code": 610829,
        "pid": 610800,
        "level": 2,
        "name": "吴堡县"
    },
    {
        "id": 610828,
        "code": 610828,
        "pid": 610800,
        "level": 2,
        "name": "佳县"
    },
    {
        "id": 610830,
        "code": 610830,
        "pid": 610800,
        "level": 2,
        "name": "清涧县"
    },
    {
        "id": 610831,
        "code": 610831,
        "pid": 610800,
        "level": 2,
        "name": "子洲县"
    },
    {
        "id": 610803,
        "code": 610803,
        "pid": 610800,
        "level": 2,
        "name": "横山区"
    },
    {
        "id": 610802,
        "code": 610802,
        "pid": 610800,
        "level": 2,
        "name": "榆阳区"
    },
    {
        "id": 130000,
        "code": 130000,
        "pid": 0,
        "level": 0,
        "name": "河北省"
    },
    {
        "id": 130400,
        "code": 130400,
        "pid": 130000,
        "level": 1,
        "name": "邯郸市"
    },
    {
        "id": 130402,
        "code": 130402,
        "pid": 130400,
        "level": 2,
        "name": "邯山区"
    },
    {
        "id": 130403,
        "code": 130403,
        "pid": 130400,
        "level": 2,
        "name": "丛台区"
    },
    {
        "id": 130427,
        "code": 130427,
        "pid": 130400,
        "level": 2,
        "name": "磁县"
    },
    {
        "id": 130406,
        "code": 130406,
        "pid": 130400,
        "level": 2,
        "name": "峰峰矿区"
    },
    {
        "id": 130429,
        "code": 130429,
        "pid": 130400,
        "level": 2,
        "name": "永年县"
    },
    {
        "id": 130404,
        "code": 130404,
        "pid": 130400,
        "level": 2,
        "name": "复兴区"
    },
    {
        "id": 130433,
        "code": 130433,
        "pid": 130400,
        "level": 2,
        "name": "馆陶县"
    },
    {
        "id": 130432,
        "code": 130432,
        "pid": 130400,
        "level": 2,
        "name": "广平县"
    },
    {
        "id": 130426,
        "code": 130426,
        "pid": 130400,
        "level": 2,
        "name": "涉县"
    },
    {
        "id": 130481,
        "code": 130481,
        "pid": 130400,
        "level": 2,
        "name": "武安市"
    },
    {
        "id": 130421,
        "code": 130421,
        "pid": 130400,
        "level": 2,
        "name": "邯郸县"
    },
    {
        "id": 130435,
        "code": 130435,
        "pid": 130400,
        "level": 2,
        "name": "曲周县"
    },
    {
        "id": 130434,
        "code": 130434,
        "pid": 130400,
        "level": 2,
        "name": "魏县"
    },
    {
        "id": 130424,
        "code": 130424,
        "pid": 130400,
        "level": 2,
        "name": "成安县"
    },
    {
        "id": 130430,
        "code": 130430,
        "pid": 130400,
        "level": 2,
        "name": "邱县"
    },
    {
        "id": 130425,
        "code": 130425,
        "pid": 130400,
        "level": 2,
        "name": "大名县"
    },
    {
        "id": 130428,
        "code": 130428,
        "pid": 130400,
        "level": 2,
        "name": "肥乡县"
    },
    {
        "id": 130423,
        "code": 130423,
        "pid": 130400,
        "level": 2,
        "name": "临漳县"
    },
    {
        "id": 130431,
        "code": 130431,
        "pid": 130400,
        "level": 2,
        "name": "鸡泽县"
    },
    {
        "id": 130300,
        "code": 130300,
        "pid": 130000,
        "level": 1,
        "name": "秦皇岛市"
    },
    {
        "id": 130324,
        "code": 130324,
        "pid": 130300,
        "level": 2,
        "name": "卢龙县"
    },
    {
        "id": 130322,
        "code": 130322,
        "pid": 130300,
        "level": 2,
        "name": "昌黎县"
    },
    {
        "id": 130321,
        "code": 130321,
        "pid": 130300,
        "level": 2,
        "name": "青龙满族自治县"
    },
    {
        "id": 130304,
        "code": 130304,
        "pid": 130300,
        "level": 2,
        "name": "北戴河区"
    },
    {
        "id": 130306,
        "code": 130306,
        "pid": 130300,
        "level": 2,
        "name": "抚宁区"
    },
    {
        "id": 130303,
        "code": 130303,
        "pid": 130300,
        "level": 2,
        "name": "山海关区"
    },
    {
        "id": 130302,
        "code": 130302,
        "pid": 130300,
        "level": 2,
        "name": "海港区"
    },
    {
        "id": 130200,
        "code": 130200,
        "pid": 130000,
        "level": 1,
        "name": "唐山市"
    },
    {
        "id": 130229,
        "code": 130229,
        "pid": 130200,
        "level": 2,
        "name": "玉田县"
    },
    {
        "id": 130223,
        "code": 130223,
        "pid": 130200,
        "level": 2,
        "name": "滦县"
    },
    {
        "id": 130281,
        "code": 130281,
        "pid": 130200,
        "level": 2,
        "name": "遵化市"
    },
    {
        "id": 130224,
        "code": 130224,
        "pid": 130200,
        "level": 2,
        "name": "滦南县"
    },
    {
        "id": 130283,
        "code": 130283,
        "pid": 130200,
        "level": 2,
        "name": "迁安市"
    },
    {
        "id": 130204,
        "code": 130204,
        "pid": 130200,
        "level": 2,
        "name": "古冶区"
    },
    {
        "id": 130205,
        "code": 130205,
        "pid": 130200,
        "level": 2,
        "name": "开平区"
    },
    {
        "id": 130207,
        "code": 130207,
        "pid": 130200,
        "level": 2,
        "name": "丰南区"
    },
    {
        "id": 130227,
        "code": 130227,
        "pid": 130200,
        "level": 2,
        "name": "迁西县"
    },
    {
        "id": 130202,
        "code": 130202,
        "pid": 130200,
        "level": 2,
        "name": "路南区"
    },
    {
        "id": 130203,
        "code": 130203,
        "pid": 130200,
        "level": 2,
        "name": "路北区"
    },
    {
        "id": 130225,
        "code": 130225,
        "pid": 130200,
        "level": 2,
        "name": "乐亭县"
    },
    {
        "id": 130208,
        "code": 130208,
        "pid": 130200,
        "level": 2,
        "name": "丰润区"
    },
    {
        "id": 130209,
        "code": 130209,
        "pid": 130200,
        "level": 2,
        "name": "曹妃甸区"
    },
    {
        "id": 130500,
        "code": 130500,
        "pid": 130000,
        "level": 1,
        "name": "邢台市"
    },
    {
        "id": 130532,
        "code": 130532,
        "pid": 130500,
        "level": 2,
        "name": "平乡县"
    },
    {
        "id": 130533,
        "code": 130533,
        "pid": 130500,
        "level": 2,
        "name": "威县"
    },
    {
        "id": 130530,
        "code": 130530,
        "pid": 130500,
        "level": 2,
        "name": "新河县"
    },
    {
        "id": 130531,
        "code": 130531,
        "pid": 130500,
        "level": 2,
        "name": "广宗县"
    },
    {
        "id": 130582,
        "code": 130582,
        "pid": 130500,
        "level": 2,
        "name": "沙河市"
    },
    {
        "id": 130524,
        "code": 130524,
        "pid": 130500,
        "level": 2,
        "name": "柏乡县"
    },
    {
        "id": 130534,
        "code": 130534,
        "pid": 130500,
        "level": 2,
        "name": "清河县"
    },
    {
        "id": 130535,
        "code": 130535,
        "pid": 130500,
        "level": 2,
        "name": "临西县"
    },
    {
        "id": 130529,
        "code": 130529,
        "pid": 130500,
        "level": 2,
        "name": "巨鹿县"
    },
    {
        "id": 130528,
        "code": 130528,
        "pid": 130500,
        "level": 2,
        "name": "宁晋县"
    },
    {
        "id": 130526,
        "code": 130526,
        "pid": 130500,
        "level": 2,
        "name": "任县"
    },
    {
        "id": 130523,
        "code": 130523,
        "pid": 130500,
        "level": 2,
        "name": "内丘县"
    },
    {
        "id": 130521,
        "code": 130521,
        "pid": 130500,
        "level": 2,
        "name": "邢台县"
    },
    {
        "id": 130503,
        "code": 130503,
        "pid": 130500,
        "level": 2,
        "name": "桥西区"
    },
    {
        "id": 130581,
        "code": 130581,
        "pid": 130500,
        "level": 2,
        "name": "南宫市"
    },
    {
        "id": 130522,
        "code": 130522,
        "pid": 130500,
        "level": 2,
        "name": "临城县"
    },
    {
        "id": 130527,
        "code": 130527,
        "pid": 130500,
        "level": 2,
        "name": "南和县"
    },
    {
        "id": 130502,
        "code": 130502,
        "pid": 130500,
        "level": 2,
        "name": "桥东区"
    },
    {
        "id": 130525,
        "code": 130525,
        "pid": 130500,
        "level": 2,
        "name": "隆尧县"
    },
    {
        "id": 130800,
        "code": 130800,
        "pid": 130000,
        "level": 1,
        "name": "承德市"
    },
    {
        "id": 130828,
        "code": 130828,
        "pid": 130800,
        "level": 2,
        "name": "围场满族蒙古族自治县"
    },
    {
        "id": 130821,
        "code": 130821,
        "pid": 130800,
        "level": 2,
        "name": "承德县"
    },
    {
        "id": 130822,
        "code": 130822,
        "pid": 130800,
        "level": 2,
        "name": "兴隆县"
    },
    {
        "id": 130823,
        "code": 130823,
        "pid": 130800,
        "level": 2,
        "name": "平泉县"
    },
    {
        "id": 130824,
        "code": 130824,
        "pid": 130800,
        "level": 2,
        "name": "滦平县"
    },
    {
        "id": 130825,
        "code": 130825,
        "pid": 130800,
        "level": 2,
        "name": "隆化县"
    },
    {
        "id": 130826,
        "code": 130826,
        "pid": 130800,
        "level": 2,
        "name": "丰宁满族自治县"
    },
    {
        "id": 130827,
        "code": 130827,
        "pid": 130800,
        "level": 2,
        "name": "宽城满族自治县"
    },
    {
        "id": 130802,
        "code": 130802,
        "pid": 130800,
        "level": 2,
        "name": "双桥区"
    },
    {
        "id": 130804,
        "code": 130804,
        "pid": 130800,
        "level": 2,
        "name": "鹰手营子矿区"
    },
    {
        "id": 130803,
        "code": 130803,
        "pid": 130800,
        "level": 2,
        "name": "双滦区"
    },
    {
        "id": 130100,
        "code": 130100,
        "pid": 130000,
        "level": 1,
        "name": "石家庄市"
    },
    {
        "id": 130125,
        "code": 130125,
        "pid": 130100,
        "level": 2,
        "name": "行唐县"
    },
    {
        "id": 130110,
        "code": 130110,
        "pid": 130100,
        "level": 2,
        "name": "鹿泉区"
    },
    {
        "id": 130127,
        "code": 130127,
        "pid": 130100,
        "level": 2,
        "name": "高邑县"
    },
    {
        "id": 130184,
        "code": 130184,
        "pid": 130100,
        "level": 2,
        "name": "新乐市"
    },
    {
        "id": 130121,
        "code": 130121,
        "pid": 130100,
        "level": 2,
        "name": "井陉县"
    },
    {
        "id": 130130,
        "code": 130130,
        "pid": 130100,
        "level": 2,
        "name": "无极县"
    },
    {
        "id": 130123,
        "code": 130123,
        "pid": 130100,
        "level": 2,
        "name": "正定县"
    },
    {
        "id": 130131,
        "code": 130131,
        "pid": 130100,
        "level": 2,
        "name": "平山县"
    },
    {
        "id": 130107,
        "code": 130107,
        "pid": 130100,
        "level": 2,
        "name": "井陉矿区"
    },
    {
        "id": 130132,
        "code": 130132,
        "pid": 130100,
        "level": 2,
        "name": "元氏县"
    },
    {
        "id": 130105,
        "code": 130105,
        "pid": 130100,
        "level": 2,
        "name": "新华区"
    },
    {
        "id": 130104,
        "code": 130104,
        "pid": 130100,
        "level": 2,
        "name": "桥西区"
    },
    {
        "id": 130129,
        "code": 130129,
        "pid": 130100,
        "level": 2,
        "name": "赞皇县"
    },
    {
        "id": 130128,
        "code": 130128,
        "pid": 130100,
        "level": 2,
        "name": "深泽县"
    },
    {
        "id": 130102,
        "code": 130102,
        "pid": 130100,
        "level": 2,
        "name": "长安区"
    },
    {
        "id": 130126,
        "code": 130126,
        "pid": 130100,
        "level": 2,
        "name": "灵寿县"
    },
    {
        "id": 130108,
        "code": 130108,
        "pid": 130100,
        "level": 2,
        "name": "裕华区"
    },
    {
        "id": 130183,
        "code": 130183,
        "pid": 130100,
        "level": 2,
        "name": "晋州市"
    },
    {
        "id": 130111,
        "code": 130111,
        "pid": 130100,
        "level": 2,
        "name": "栾城区"
    },
    {
        "id": 130109,
        "code": 130109,
        "pid": 130100,
        "level": 2,
        "name": "藁城区"
    },
    {
        "id": 130133,
        "code": 130133,
        "pid": 130100,
        "level": 2,
        "name": "赵县"
    },
    {
        "id": 130600,
        "code": 130600,
        "pid": 130000,
        "level": 1,
        "name": "保定市"
    },
    {
        "id": 130635,
        "code": 130635,
        "pid": 130600,
        "level": 2,
        "name": "蠡县"
    },
    {
        "id": 130634,
        "code": 130634,
        "pid": 130600,
        "level": 2,
        "name": "曲阳县"
    },
    {
        "id": 130637,
        "code": 130637,
        "pid": 130600,
        "level": 2,
        "name": "博野县"
    },
    {
        "id": 130636,
        "code": 130636,
        "pid": 130600,
        "level": 2,
        "name": "顺平县"
    },
    {
        "id": 130631,
        "code": 130631,
        "pid": 130600,
        "level": 2,
        "name": "望都县"
    },
    {
        "id": 130630,
        "code": 130630,
        "pid": 130600,
        "level": 2,
        "name": "涞源县"
    },
    {
        "id": 130633,
        "code": 130633,
        "pid": 130600,
        "level": 2,
        "name": "易县"
    },
    {
        "id": 130632,
        "code": 130632,
        "pid": 130600,
        "level": 2,
        "name": "安新县"
    },
    {
        "id": 130638,
        "code": 130638,
        "pid": 130600,
        "level": 2,
        "name": "雄县"
    },
    {
        "id": 130681,
        "code": 130681,
        "pid": 130600,
        "level": 2,
        "name": "涿州市"
    },
    {
        "id": 130683,
        "code": 130683,
        "pid": 130600,
        "level": 2,
        "name": "安国市"
    },
    {
        "id": 130684,
        "code": 130684,
        "pid": 130600,
        "level": 2,
        "name": "高碑店市"
    },
    {
        "id": 130626,
        "code": 130626,
        "pid": 130600,
        "level": 2,
        "name": "定兴县"
    },
    {
        "id": 130627,
        "code": 130627,
        "pid": 130600,
        "level": 2,
        "name": "唐县"
    },
    {
        "id": 130624,
        "code": 130624,
        "pid": 130600,
        "level": 2,
        "name": "阜平县"
    },
    {
        "id": 130623,
        "code": 130623,
        "pid": 130600,
        "level": 2,
        "name": "涞水县"
    },
    {
        "id": 130606,
        "code": 130606,
        "pid": 130600,
        "level": 2,
        "name": "莲池区"
    },
    {
        "id": 130607,
        "code": 130607,
        "pid": 130600,
        "level": 2,
        "name": "满城区"
    },
    {
        "id": 130608,
        "code": 130608,
        "pid": 130600,
        "level": 2,
        "name": "清苑区"
    },
    {
        "id": 130609,
        "code": 130609,
        "pid": 130600,
        "level": 2,
        "name": "徐水区"
    },
    {
        "id": 130628,
        "code": 130628,
        "pid": 130600,
        "level": 2,
        "name": "高阳县"
    },
    {
        "id": 130629,
        "code": 130629,
        "pid": 130600,
        "level": 2,
        "name": "容城县"
    },
    {
        "id": 130602,
        "code": 130602,
        "pid": 130600,
        "level": 2,
        "name": "竞秀区"
    },
    {
        "id": 131100,
        "code": 131100,
        "pid": 130000,
        "level": 1,
        "name": "衡水市"
    },
    {
        "id": 131128,
        "code": 131128,
        "pid": 131100,
        "level": 2,
        "name": "阜城县"
    },
    {
        "id": 131122,
        "code": 131122,
        "pid": 131100,
        "level": 2,
        "name": "武邑县"
    },
    {
        "id": 131123,
        "code": 131123,
        "pid": 131100,
        "level": 2,
        "name": "武强县"
    },
    {
        "id": 131121,
        "code": 131121,
        "pid": 131100,
        "level": 2,
        "name": "枣强县"
    },
    {
        "id": 131126,
        "code": 131126,
        "pid": 131100,
        "level": 2,
        "name": "故城县"
    },
    {
        "id": 131127,
        "code": 131127,
        "pid": 131100,
        "level": 2,
        "name": "景县"
    },
    {
        "id": 131124,
        "code": 131124,
        "pid": 131100,
        "level": 2,
        "name": "饶阳县"
    },
    {
        "id": 131125,
        "code": 131125,
        "pid": 131100,
        "level": 2,
        "name": "安平县"
    },
    {
        "id": 131182,
        "code": 131182,
        "pid": 131100,
        "level": 2,
        "name": "深州市"
    },
    {
        "id": 131102,
        "code": 131102,
        "pid": 131100,
        "level": 2,
        "name": "桃城区"
    },
    {
        "id": 131103,
        "code": 131103,
        "pid": 131100,
        "level": 2,
        "name": "冀州区"
    },
    {
        "id": 139000,
        "code": 139000,
        "pid": 130000,
        "level": 1,
        "name": "直辖县市"
    },
    {
        "id": 139001,
        "code": 139001,
        "pid": 139000,
        "level": 2,
        "name": "定州市"
    },
    {
        "id": 139002,
        "code": 139002,
        "pid": 139000,
        "level": 2,
        "name": "辛集市"
    },
    {
        "id": 130900,
        "code": 130900,
        "pid": 130000,
        "level": 1,
        "name": "沧州市"
    },
    {
        "id": 130929,
        "code": 130929,
        "pid": 130900,
        "level": 2,
        "name": "献县"
    },
    {
        "id": 130928,
        "code": 130928,
        "pid": 130900,
        "level": 2,
        "name": "吴桥县"
    },
    {
        "id": 130925,
        "code": 130925,
        "pid": 130900,
        "level": 2,
        "name": "盐山县"
    },
    {
        "id": 130924,
        "code": 130924,
        "pid": 130900,
        "level": 2,
        "name": "海兴县"
    },
    {
        "id": 130927,
        "code": 130927,
        "pid": 130900,
        "level": 2,
        "name": "南皮县"
    },
    {
        "id": 130926,
        "code": 130926,
        "pid": 130900,
        "level": 2,
        "name": "肃宁县"
    },
    {
        "id": 130921,
        "code": 130921,
        "pid": 130900,
        "level": 2,
        "name": "沧县"
    },
    {
        "id": 130923,
        "code": 130923,
        "pid": 130900,
        "level": 2,
        "name": "东光县"
    },
    {
        "id": 130922,
        "code": 130922,
        "pid": 130900,
        "level": 2,
        "name": "青县"
    },
    {
        "id": 130903,
        "code": 130903,
        "pid": 130900,
        "level": 2,
        "name": "运河区"
    },
    {
        "id": 130930,
        "code": 130930,
        "pid": 130900,
        "level": 2,
        "name": "孟村回族自治县"
    },
    {
        "id": 130984,
        "code": 130984,
        "pid": 130900,
        "level": 2,
        "name": "河间市"
    },
    {
        "id": 130983,
        "code": 130983,
        "pid": 130900,
        "level": 2,
        "name": "黄骅市"
    },
    {
        "id": 130982,
        "code": 130982,
        "pid": 130900,
        "level": 2,
        "name": "任丘市"
    },
    {
        "id": 130981,
        "code": 130981,
        "pid": 130900,
        "level": 2,
        "name": "泊头市"
    },
    {
        "id": 130902,
        "code": 130902,
        "pid": 130900,
        "level": 2,
        "name": "新华区"
    },
    {
        "id": 130700,
        "code": 130700,
        "pid": 130000,
        "level": 1,
        "name": "张家口市"
    },
    {
        "id": 130723,
        "code": 130723,
        "pid": 130700,
        "level": 2,
        "name": "康保县"
    },
    {
        "id": 130722,
        "code": 130722,
        "pid": 130700,
        "level": 2,
        "name": "张北县"
    },
    {
        "id": 130727,
        "code": 130727,
        "pid": 130700,
        "level": 2,
        "name": "阳原县"
    },
    {
        "id": 130726,
        "code": 130726,
        "pid": 130700,
        "level": 2,
        "name": "蔚县"
    },
    {
        "id": 130725,
        "code": 130725,
        "pid": 130700,
        "level": 2,
        "name": "尚义县"
    },
    {
        "id": 130724,
        "code": 130724,
        "pid": 130700,
        "level": 2,
        "name": "沽源县"
    },
    {
        "id": 130728,
        "code": 130728,
        "pid": 130700,
        "level": 2,
        "name": "怀安县"
    },
    {
        "id": 130706,
        "code": 130706,
        "pid": 130700,
        "level": 2,
        "name": "下花园区"
    },
    {
        "id": 130709,
        "code": 130709,
        "pid": 130700,
        "level": 2,
        "name": "崇礼区"
    },
    {
        "id": 130708,
        "code": 130708,
        "pid": 130700,
        "level": 2,
        "name": "万全区"
    },
    {
        "id": 130732,
        "code": 130732,
        "pid": 130700,
        "level": 2,
        "name": "赤城县"
    },
    {
        "id": 130730,
        "code": 130730,
        "pid": 130700,
        "level": 2,
        "name": "怀来县"
    },
    {
        "id": 130703,
        "code": 130703,
        "pid": 130700,
        "level": 2,
        "name": "桥西区"
    },
    {
        "id": 130702,
        "code": 130702,
        "pid": 130700,
        "level": 2,
        "name": "桥东区"
    },
    {
        "id": 130705,
        "code": 130705,
        "pid": 130700,
        "level": 2,
        "name": "宣化区"
    },
    {
        "id": 130731,
        "code": 130731,
        "pid": 130700,
        "level": 2,
        "name": "涿鹿县"
    },
    {
        "id": 131000,
        "code": 131000,
        "pid": 130000,
        "level": 1,
        "name": "廊坊市"
    },
    {
        "id": 131026,
        "code": 131026,
        "pid": 131000,
        "level": 2,
        "name": "文安县"
    },
    {
        "id": 131025,
        "code": 131025,
        "pid": 131000,
        "level": 2,
        "name": "大城县"
    },
    {
        "id": 131024,
        "code": 131024,
        "pid": 131000,
        "level": 2,
        "name": "香河县"
    },
    {
        "id": 131023,
        "code": 131023,
        "pid": 131000,
        "level": 2,
        "name": "永清县"
    },
    {
        "id": 131022,
        "code": 131022,
        "pid": 131000,
        "level": 2,
        "name": "固安县"
    },
    {
        "id": 131082,
        "code": 131082,
        "pid": 131000,
        "level": 2,
        "name": "三河市"
    },
    {
        "id": 131028,
        "code": 131028,
        "pid": 131000,
        "level": 2,
        "name": "大厂回族自治县"
    },
    {
        "id": 131081,
        "code": 131081,
        "pid": 131000,
        "level": 2,
        "name": "霸州市"
    },
    {
        "id": 131003,
        "code": 131003,
        "pid": 131000,
        "level": 2,
        "name": "广阳区"
    },
    {
        "id": 131002,
        "code": 131002,
        "pid": 131000,
        "level": 2,
        "name": "安次区"
    },
    {
        "id": 440000,
        "code": 440000,
        "pid": 0,
        "level": 0,
        "name": "广东省"
    },
    {
        "id": 445100,
        "code": 445100,
        "pid": 440000,
        "level": 1,
        "name": "潮州市"
    },
    {
        "id": 445102,
        "code": 445102,
        "pid": 445100,
        "level": 2,
        "name": "湘桥区"
    },
    {
        "id": 445103,
        "code": 445103,
        "pid": 445100,
        "level": 2,
        "name": "潮安区"
    },
    {
        "id": 445122,
        "code": 445122,
        "pid": 445100,
        "level": 2,
        "name": "饶平县"
    },
    {
        "id": 441400,
        "code": 441400,
        "pid": 440000,
        "level": 1,
        "name": "梅州市"
    },
    {
        "id": 441403,
        "code": 441403,
        "pid": 441400,
        "level": 2,
        "name": "梅县区"
    },
    {
        "id": 441402,
        "code": 441402,
        "pid": 441400,
        "level": 2,
        "name": "梅江区"
    },
    {
        "id": 441481,
        "code": 441481,
        "pid": 441400,
        "level": 2,
        "name": "兴宁市"
    },
    {
        "id": 441422,
        "code": 441422,
        "pid": 441400,
        "level": 2,
        "name": "大埔县"
    },
    {
        "id": 441427,
        "code": 441427,
        "pid": 441400,
        "level": 2,
        "name": "蕉岭县"
    },
    {
        "id": 441426,
        "code": 441426,
        "pid": 441400,
        "level": 2,
        "name": "平远县"
    },
    {
        "id": 441424,
        "code": 441424,
        "pid": 441400,
        "level": 2,
        "name": "五华县"
    },
    {
        "id": 441423,
        "code": 441423,
        "pid": 441400,
        "level": 2,
        "name": "丰顺县"
    },
    {
        "id": 442000,
        "code": 442000,
        "pid": 440000,
        "level": 1,
        "name": "中山市"
    },
    {
        "id": 440300,
        "code": 440300,
        "pid": 440000,
        "level": 1,
        "name": "深圳市"
    },
    {
        "id": 440305,
        "code": 440305,
        "pid": 440300,
        "level": 2,
        "name": "南山区"
    },
    {
        "id": 440304,
        "code": 440304,
        "pid": 440300,
        "level": 2,
        "name": "福田区"
    },
    {
        "id": 440307,
        "code": 440307,
        "pid": 440300,
        "level": 2,
        "name": "龙岗区"
    },
    {
        "id": 440306,
        "code": 440306,
        "pid": 440300,
        "level": 2,
        "name": "宝安区"
    },
    {
        "id": 440303,
        "code": 440303,
        "pid": 440300,
        "level": 2,
        "name": "罗湖区"
    },
    {
        "id": 440308,
        "code": 440308,
        "pid": 440300,
        "level": 2,
        "name": "盐田区"
    },
    {
        "id": 440800,
        "code": 440800,
        "pid": 440000,
        "level": 1,
        "name": "湛江市"
    },
    {
        "id": 440804,
        "code": 440804,
        "pid": 440800,
        "level": 2,
        "name": "坡头区"
    },
    {
        "id": 440823,
        "code": 440823,
        "pid": 440800,
        "level": 2,
        "name": "遂溪县"
    },
    {
        "id": 440811,
        "code": 440811,
        "pid": 440800,
        "level": 2,
        "name": "麻章区"
    },
    {
        "id": 440803,
        "code": 440803,
        "pid": 440800,
        "level": 2,
        "name": "霞山区"
    },
    {
        "id": 440825,
        "code": 440825,
        "pid": 440800,
        "level": 2,
        "name": "徐闻县"
    },
    {
        "id": 440802,
        "code": 440802,
        "pid": 440800,
        "level": 2,
        "name": "赤坎区"
    },
    {
        "id": 440882,
        "code": 440882,
        "pid": 440800,
        "level": 2,
        "name": "雷州市"
    },
    {
        "id": 440883,
        "code": 440883,
        "pid": 440800,
        "level": 2,
        "name": "吴川市"
    },
    {
        "id": 440881,
        "code": 440881,
        "pid": 440800,
        "level": 2,
        "name": "廉江市"
    },
    {
        "id": 440700,
        "code": 440700,
        "pid": 440000,
        "level": 1,
        "name": "江门市"
    },
    {
        "id": 440703,
        "code": 440703,
        "pid": 440700,
        "level": 2,
        "name": "蓬江区"
    },
    {
        "id": 440705,
        "code": 440705,
        "pid": 440700,
        "level": 2,
        "name": "新会区"
    },
    {
        "id": 440704,
        "code": 440704,
        "pid": 440700,
        "level": 2,
        "name": "江海区"
    },
    {
        "id": 440781,
        "code": 440781,
        "pid": 440700,
        "level": 2,
        "name": "台山市"
    },
    {
        "id": 440783,
        "code": 440783,
        "pid": 440700,
        "level": 2,
        "name": "开平市"
    },
    {
        "id": 440785,
        "code": 440785,
        "pid": 440700,
        "level": 2,
        "name": "恩平市"
    },
    {
        "id": 440784,
        "code": 440784,
        "pid": 440700,
        "level": 2,
        "name": "鹤山市"
    },
    {
        "id": 440400,
        "code": 440400,
        "pid": 440000,
        "level": 1,
        "name": "珠海市"
    },
    {
        "id": 440402,
        "code": 440402,
        "pid": 440400,
        "level": 2,
        "name": "香洲区"
    },
    {
        "id": 440403,
        "code": 440403,
        "pid": 440400,
        "level": 2,
        "name": "斗门区"
    },
    {
        "id": 440404,
        "code": 440404,
        "pid": 440400,
        "level": 2,
        "name": "金湾区"
    },
    {
        "id": 441200,
        "code": 441200,
        "pid": 440000,
        "level": 1,
        "name": "肇庆市"
    },
    {
        "id": 441225,
        "code": 441225,
        "pid": 441200,
        "level": 2,
        "name": "封开县"
    },
    {
        "id": 441224,
        "code": 441224,
        "pid": 441200,
        "level": 2,
        "name": "怀集县"
    },
    {
        "id": 441226,
        "code": 441226,
        "pid": 441200,
        "level": 2,
        "name": "德庆县"
    },
    {
        "id": 441223,
        "code": 441223,
        "pid": 441200,
        "level": 2,
        "name": "广宁县"
    },
    {
        "id": 441204,
        "code": 441204,
        "pid": 441200,
        "level": 2,
        "name": "高要区"
    },
    {
        "id": 441203,
        "code": 441203,
        "pid": 441200,
        "level": 2,
        "name": "鼎湖区"
    },
    {
        "id": 441202,
        "code": 441202,
        "pid": 441200,
        "level": 2,
        "name": "端州区"
    },
    {
        "id": 441284,
        "code": 441284,
        "pid": 441200,
        "level": 2,
        "name": "四会市"
    },
    {
        "id": 441300,
        "code": 441300,
        "pid": 440000,
        "level": 1,
        "name": "惠州市"
    },
    {
        "id": 441302,
        "code": 441302,
        "pid": 441300,
        "level": 2,
        "name": "惠城区"
    },
    {
        "id": 441322,
        "code": 441322,
        "pid": 441300,
        "level": 2,
        "name": "博罗县"
    },
    {
        "id": 441323,
        "code": 441323,
        "pid": 441300,
        "level": 2,
        "name": "惠东县"
    },
    {
        "id": 441324,
        "code": 441324,
        "pid": 441300,
        "level": 2,
        "name": "龙门县"
    },
    {
        "id": 441303,
        "code": 441303,
        "pid": 441300,
        "level": 2,
        "name": "惠阳区"
    },
    {
        "id": 440900,
        "code": 440900,
        "pid": 440000,
        "level": 1,
        "name": "茂名市"
    },
    {
        "id": 440904,
        "code": 440904,
        "pid": 440900,
        "level": 2,
        "name": "电白区"
    },
    {
        "id": 440983,
        "code": 440983,
        "pid": 440900,
        "level": 2,
        "name": "信宜市"
    },
    {
        "id": 440902,
        "code": 440902,
        "pid": 440900,
        "level": 2,
        "name": "茂南区"
    },
    {
        "id": 440981,
        "code": 440981,
        "pid": 440900,
        "level": 2,
        "name": "高州市"
    },
    {
        "id": 440982,
        "code": 440982,
        "pid": 440900,
        "level": 2,
        "name": "化州市"
    },
    {
        "id": 440600,
        "code": 440600,
        "pid": 440000,
        "level": 1,
        "name": "佛山市"
    },
    {
        "id": 440608,
        "code": 440608,
        "pid": 440600,
        "level": 2,
        "name": "高明区"
    },
    {
        "id": 440604,
        "code": 440604,
        "pid": 440600,
        "level": 2,
        "name": "禅城区"
    },
    {
        "id": 440605,
        "code": 440605,
        "pid": 440600,
        "level": 2,
        "name": "南海区"
    },
    {
        "id": 440606,
        "code": 440606,
        "pid": 440600,
        "level": 2,
        "name": "顺德区"
    },
    {
        "id": 440607,
        "code": 440607,
        "pid": 440600,
        "level": 2,
        "name": "三水区"
    },
    {
        "id": 445300,
        "code": 445300,
        "pid": 440000,
        "level": 1,
        "name": "云浮市"
    },
    {
        "id": 445302,
        "code": 445302,
        "pid": 445300,
        "level": 2,
        "name": "云城区"
    },
    {
        "id": 445303,
        "code": 445303,
        "pid": 445300,
        "level": 2,
        "name": "云安区"
    },
    {
        "id": 445381,
        "code": 445381,
        "pid": 445300,
        "level": 2,
        "name": "罗定市"
    },
    {
        "id": 445321,
        "code": 445321,
        "pid": 445300,
        "level": 2,
        "name": "新兴县"
    },
    {
        "id": 445322,
        "code": 445322,
        "pid": 445300,
        "level": 2,
        "name": "郁南县"
    },
    {
        "id": 441600,
        "code": 441600,
        "pid": 440000,
        "level": 1,
        "name": "河源市"
    },
    {
        "id": 441621,
        "code": 441621,
        "pid": 441600,
        "level": 2,
        "name": "紫金县"
    },
    {
        "id": 441623,
        "code": 441623,
        "pid": 441600,
        "level": 2,
        "name": "连平县"
    },
    {
        "id": 441622,
        "code": 441622,
        "pid": 441600,
        "level": 2,
        "name": "龙川县"
    },
    {
        "id": 441625,
        "code": 441625,
        "pid": 441600,
        "level": 2,
        "name": "东源县"
    },
    {
        "id": 441624,
        "code": 441624,
        "pid": 441600,
        "level": 2,
        "name": "和平县"
    },
    {
        "id": 441602,
        "code": 441602,
        "pid": 441600,
        "level": 2,
        "name": "源城区"
    },
    {
        "id": 441700,
        "code": 441700,
        "pid": 440000,
        "level": 1,
        "name": "阳江市"
    },
    {
        "id": 441702,
        "code": 441702,
        "pid": 441700,
        "level": 2,
        "name": "江城区"
    },
    {
        "id": 441781,
        "code": 441781,
        "pid": 441700,
        "level": 2,
        "name": "阳春市"
    },
    {
        "id": 441721,
        "code": 441721,
        "pid": 441700,
        "level": 2,
        "name": "阳西县"
    },
    {
        "id": 441704,
        "code": 441704,
        "pid": 441700,
        "level": 2,
        "name": "阳东区"
    },
    {
        "id": 440100,
        "code": 440100,
        "pid": 440000,
        "level": 1,
        "name": "广州市"
    },
    {
        "id": 440118,
        "code": 440118,
        "pid": 440100,
        "level": 2,
        "name": "增城区"
    },
    {
        "id": 440111,
        "code": 440111,
        "pid": 440100,
        "level": 2,
        "name": "白云区"
    },
    {
        "id": 440112,
        "code": 440112,
        "pid": 440100,
        "level": 2,
        "name": "黄埔区"
    },
    {
        "id": 440113,
        "code": 440113,
        "pid": 440100,
        "level": 2,
        "name": "番禺区"
    },
    {
        "id": 440114,
        "code": 440114,
        "pid": 440100,
        "level": 2,
        "name": "花都区"
    },
    {
        "id": 440115,
        "code": 440115,
        "pid": 440100,
        "level": 2,
        "name": "南沙区"
    },
    {
        "id": 440117,
        "code": 440117,
        "pid": 440100,
        "level": 2,
        "name": "从化区"
    },
    {
        "id": 440106,
        "code": 440106,
        "pid": 440100,
        "level": 2,
        "name": "天河区"
    },
    {
        "id": 440105,
        "code": 440105,
        "pid": 440100,
        "level": 2,
        "name": "海珠区"
    },
    {
        "id": 440104,
        "code": 440104,
        "pid": 440100,
        "level": 2,
        "name": "越秀区"
    },
    {
        "id": 440103,
        "code": 440103,
        "pid": 440100,
        "level": 2,
        "name": "荔湾区"
    },
    {
        "id": 441500,
        "code": 441500,
        "pid": 440000,
        "level": 1,
        "name": "汕尾市"
    },
    {
        "id": 441581,
        "code": 441581,
        "pid": 441500,
        "level": 2,
        "name": "陆丰市"
    },
    {
        "id": 441502,
        "code": 441502,
        "pid": 441500,
        "level": 2,
        "name": "城区"
    },
    {
        "id": 441523,
        "code": 441523,
        "pid": 441500,
        "level": 2,
        "name": "陆河县"
    },
    {
        "id": 441521,
        "code": 441521,
        "pid": 441500,
        "level": 2,
        "name": "海丰县"
    },
    {
        "id": 441900,
        "code": 441900,
        "pid": 440000,
        "level": 1,
        "name": "东莞市"
    },
    {
        "id": 445200,
        "code": 445200,
        "pid": 440000,
        "level": 1,
        "name": "揭阳市"
    },
    {
        "id": 445203,
        "code": 445203,
        "pid": 445200,
        "level": 2,
        "name": "揭东区"
    },
    {
        "id": 445202,
        "code": 445202,
        "pid": 445200,
        "level": 2,
        "name": "榕城区"
    },
    {
        "id": 445281,
        "code": 445281,
        "pid": 445200,
        "level": 2,
        "name": "普宁市"
    },
    {
        "id": 445222,
        "code": 445222,
        "pid": 445200,
        "level": 2,
        "name": "揭西县"
    },
    {
        "id": 445224,
        "code": 445224,
        "pid": 445200,
        "level": 2,
        "name": "惠来县"
    },
    {
        "id": 440200,
        "code": 440200,
        "pid": 440000,
        "level": 1,
        "name": "韶关市"
    },
    {
        "id": 440281,
        "code": 440281,
        "pid": 440200,
        "level": 2,
        "name": "乐昌市"
    },
    {
        "id": 440282,
        "code": 440282,
        "pid": 440200,
        "level": 2,
        "name": "南雄市"
    },
    {
        "id": 440222,
        "code": 440222,
        "pid": 440200,
        "level": 2,
        "name": "始兴县"
    },
    {
        "id": 440233,
        "code": 440233,
        "pid": 440200,
        "level": 2,
        "name": "新丰县"
    },
    {
        "id": 440232,
        "code": 440232,
        "pid": 440200,
        "level": 2,
        "name": "乳源瑶族自治县"
    },
    {
        "id": 440224,
        "code": 440224,
        "pid": 440200,
        "level": 2,
        "name": "仁化县"
    },
    {
        "id": 440204,
        "code": 440204,
        "pid": 440200,
        "level": 2,
        "name": "浈江区"
    },
    {
        "id": 440205,
        "code": 440205,
        "pid": 440200,
        "level": 2,
        "name": "曲江区"
    },
    {
        "id": 440229,
        "code": 440229,
        "pid": 440200,
        "level": 2,
        "name": "翁源县"
    },
    {
        "id": 440203,
        "code": 440203,
        "pid": 440200,
        "level": 2,
        "name": "武江区"
    },
    {
        "id": 441800,
        "code": 441800,
        "pid": 440000,
        "level": 1,
        "name": "清远市"
    },
    {
        "id": 441826,
        "code": 441826,
        "pid": 441800,
        "level": 2,
        "name": "连南瑶族自治县"
    },
    {
        "id": 441825,
        "code": 441825,
        "pid": 441800,
        "level": 2,
        "name": "连山壮族瑶族自治县"
    },
    {
        "id": 441881,
        "code": 441881,
        "pid": 441800,
        "level": 2,
        "name": "英德市"
    },
    {
        "id": 441821,
        "code": 441821,
        "pid": 441800,
        "level": 2,
        "name": "佛冈县"
    },
    {
        "id": 441882,
        "code": 441882,
        "pid": 441800,
        "level": 2,
        "name": "连州市"
    },
    {
        "id": 441823,
        "code": 441823,
        "pid": 441800,
        "level": 2,
        "name": "阳山县"
    },
    {
        "id": 441803,
        "code": 441803,
        "pid": 441800,
        "level": 2,
        "name": "清新区"
    },
    {
        "id": 441802,
        "code": 441802,
        "pid": 441800,
        "level": 2,
        "name": "清城区"
    },
    {
        "id": 440500,
        "code": 440500,
        "pid": 440000,
        "level": 1,
        "name": "汕头市"
    },
    {
        "id": 440523,
        "code": 440523,
        "pid": 440500,
        "level": 2,
        "name": "南澳县"
    },
    {
        "id": 440514,
        "code": 440514,
        "pid": 440500,
        "level": 2,
        "name": "潮南区"
    },
    {
        "id": 440515,
        "code": 440515,
        "pid": 440500,
        "level": 2,
        "name": "澄海区"
    },
    {
        "id": 440507,
        "code": 440507,
        "pid": 440500,
        "level": 2,
        "name": "龙湖区"
    },
    {
        "id": 440511,
        "code": 440511,
        "pid": 440500,
        "level": 2,
        "name": "金平区"
    },
    {
        "id": 440512,
        "code": 440512,
        "pid": 440500,
        "level": 2,
        "name": "濠江区"
    },
    {
        "id": 440513,
        "code": 440513,
        "pid": 440500,
        "level": 2,
        "name": "潮阳区"
    },
    {
        "id": 640000,
        "code": 640000,
        "pid": 0,
        "level": 0,
        "name": "宁夏回族自治区"
    },
    {
        "id": 640100,
        "code": 640100,
        "pid": 640000,
        "level": 1,
        "name": "银川市"
    },
    {
        "id": 640122,
        "code": 640122,
        "pid": 640100,
        "level": 2,
        "name": "贺兰县"
    },
    {
        "id": 640121,
        "code": 640121,
        "pid": 640100,
        "level": 2,
        "name": "永宁县"
    },
    {
        "id": 640181,
        "code": 640181,
        "pid": 640100,
        "level": 2,
        "name": "灵武市"
    },
    {
        "id": 640105,
        "code": 640105,
        "pid": 640100,
        "level": 2,
        "name": "西夏区"
    },
    {
        "id": 640104,
        "code": 640104,
        "pid": 640100,
        "level": 2,
        "name": "兴庆区"
    },
    {
        "id": 640106,
        "code": 640106,
        "pid": 640100,
        "level": 2,
        "name": "金凤区"
    },
    {
        "id": 640200,
        "code": 640200,
        "pid": 640000,
        "level": 1,
        "name": "石嘴山市"
    },
    {
        "id": 640202,
        "code": 640202,
        "pid": 640200,
        "level": 2,
        "name": "大武口区"
    },
    {
        "id": 640221,
        "code": 640221,
        "pid": 640200,
        "level": 2,
        "name": "平罗县"
    },
    {
        "id": 640205,
        "code": 640205,
        "pid": 640200,
        "level": 2,
        "name": "惠农区"
    },
    {
        "id": 640300,
        "code": 640300,
        "pid": 640000,
        "level": 1,
        "name": "吴忠市"
    },
    {
        "id": 640303,
        "code": 640303,
        "pid": 640300,
        "level": 2,
        "name": "红寺堡区"
    },
    {
        "id": 640381,
        "code": 640381,
        "pid": 640300,
        "level": 2,
        "name": "青铜峡市"
    },
    {
        "id": 640323,
        "code": 640323,
        "pid": 640300,
        "level": 2,
        "name": "盐池县"
    },
    {
        "id": 640324,
        "code": 640324,
        "pid": 640300,
        "level": 2,
        "name": "同心县"
    },
    {
        "id": 640302,
        "code": 640302,
        "pid": 640300,
        "level": 2,
        "name": "利通区"
    },
    {
        "id": 640400,
        "code": 640400,
        "pid": 640000,
        "level": 1,
        "name": "固原市"
    },
    {
        "id": 640422,
        "code": 640422,
        "pid": 640400,
        "level": 2,
        "name": "西吉县"
    },
    {
        "id": 640423,
        "code": 640423,
        "pid": 640400,
        "level": 2,
        "name": "隆德县"
    },
    {
        "id": 640402,
        "code": 640402,
        "pid": 640400,
        "level": 2,
        "name": "原州区"
    },
    {
        "id": 640424,
        "code": 640424,
        "pid": 640400,
        "level": 2,
        "name": "泾源县"
    },
    {
        "id": 640425,
        "code": 640425,
        "pid": 640400,
        "level": 2,
        "name": "彭阳县"
    },
    {
        "id": 640500,
        "code": 640500,
        "pid": 640000,
        "level": 1,
        "name": "中卫市"
    },
    {
        "id": 640522,
        "code": 640522,
        "pid": 640500,
        "level": 2,
        "name": "海原县"
    },
    {
        "id": 640521,
        "code": 640521,
        "pid": 640500,
        "level": 2,
        "name": "中宁县"
    },
    {
        "id": 640502,
        "code": 640502,
        "pid": 640500,
        "level": 2,
        "name": "沙坡头区"
    },
    {
        "id": 510000,
        "code": 510000,
        "pid": 0,
        "level": 0,
        "name": "四川省"
    },
    {
        "id": 510800,
        "code": 510800,
        "pid": 510000,
        "level": 1,
        "name": "广元市"
    },
    {
        "id": 510824,
        "code": 510824,
        "pid": 510800,
        "level": 2,
        "name": "苍溪县"
    },
    {
        "id": 510822,
        "code": 510822,
        "pid": 510800,
        "level": 2,
        "name": "青川县"
    },
    {
        "id": 510823,
        "code": 510823,
        "pid": 510800,
        "level": 2,
        "name": "剑阁县"
    },
    {
        "id": 510821,
        "code": 510821,
        "pid": 510800,
        "level": 2,
        "name": "旺苍县"
    },
    {
        "id": 510802,
        "code": 510802,
        "pid": 510800,
        "level": 2,
        "name": "利州区"
    },
    {
        "id": 510811,
        "code": 510811,
        "pid": 510800,
        "level": 2,
        "name": "昭化区"
    },
    {
        "id": 510812,
        "code": 510812,
        "pid": 510800,
        "level": 2,
        "name": "朝天区"
    },
    {
        "id": 511500,
        "code": 511500,
        "pid": 510000,
        "level": 1,
        "name": "宜宾市"
    },
    {
        "id": 511502,
        "code": 511502,
        "pid": 511500,
        "level": 2,
        "name": "翠屏区"
    },
    {
        "id": 511503,
        "code": 511503,
        "pid": 511500,
        "level": 2,
        "name": "南溪区"
    },
    {
        "id": 511528,
        "code": 511528,
        "pid": 511500,
        "level": 2,
        "name": "兴文县"
    },
    {
        "id": 511529,
        "code": 511529,
        "pid": 511500,
        "level": 2,
        "name": "屏山县"
    },
    {
        "id": 511524,
        "code": 511524,
        "pid": 511500,
        "level": 2,
        "name": "长宁县"
    },
    {
        "id": 511525,
        "code": 511525,
        "pid": 511500,
        "level": 2,
        "name": "高县"
    },
    {
        "id": 511526,
        "code": 511526,
        "pid": 511500,
        "level": 2,
        "name": "珙县"
    },
    {
        "id": 511527,
        "code": 511527,
        "pid": 511500,
        "level": 2,
        "name": "筠连县"
    },
    {
        "id": 511521,
        "code": 511521,
        "pid": 511500,
        "level": 2,
        "name": "宜宾县"
    },
    {
        "id": 511523,
        "code": 511523,
        "pid": 511500,
        "level": 2,
        "name": "江安县"
    },
    {
        "id": 511400,
        "code": 511400,
        "pid": 510000,
        "level": 1,
        "name": "眉山市"
    },
    {
        "id": 511421,
        "code": 511421,
        "pid": 511400,
        "level": 2,
        "name": "仁寿县"
    },
    {
        "id": 511423,
        "code": 511423,
        "pid": 511400,
        "level": 2,
        "name": "洪雅县"
    },
    {
        "id": 511425,
        "code": 511425,
        "pid": 511400,
        "level": 2,
        "name": "青神县"
    },
    {
        "id": 511424,
        "code": 511424,
        "pid": 511400,
        "level": 2,
        "name": "丹棱县"
    },
    {
        "id": 511403,
        "code": 511403,
        "pid": 511400,
        "level": 2,
        "name": "彭山区"
    },
    {
        "id": 511402,
        "code": 511402,
        "pid": 511400,
        "level": 2,
        "name": "东坡区"
    },
    {
        "id": 513400,
        "code": 513400,
        "pid": 510000,
        "level": 1,
        "name": "凉山彝族自治州"
    },
    {
        "id": 513437,
        "code": 513437,
        "pid": 513400,
        "level": 2,
        "name": "雷波县"
    },
    {
        "id": 513430,
        "code": 513430,
        "pid": 513400,
        "level": 2,
        "name": "金阳县"
    },
    {
        "id": 513431,
        "code": 513431,
        "pid": 513400,
        "level": 2,
        "name": "昭觉县"
    },
    {
        "id": 513401,
        "code": 513401,
        "pid": 513400,
        "level": 2,
        "name": "西昌市"
    },
    {
        "id": 513434,
        "code": 513434,
        "pid": 513400,
        "level": 2,
        "name": "越西县"
    },
    {
        "id": 513429,
        "code": 513429,
        "pid": 513400,
        "level": 2,
        "name": "布拖县"
    },
    {
        "id": 513428,
        "code": 513428,
        "pid": 513400,
        "level": 2,
        "name": "普格县"
    },
    {
        "id": 513432,
        "code": 513432,
        "pid": 513400,
        "level": 2,
        "name": "喜德县"
    },
    {
        "id": 513435,
        "code": 513435,
        "pid": 513400,
        "level": 2,
        "name": "甘洛县"
    },
    {
        "id": 513423,
        "code": 513423,
        "pid": 513400,
        "level": 2,
        "name": "盐源县"
    },
    {
        "id": 513422,
        "code": 513422,
        "pid": 513400,
        "level": 2,
        "name": "木里藏族自治县"
    },
    {
        "id": 513436,
        "code": 513436,
        "pid": 513400,
        "level": 2,
        "name": "美姑县"
    },
    {
        "id": 513433,
        "code": 513433,
        "pid": 513400,
        "level": 2,
        "name": "冕宁县"
    },
    {
        "id": 513427,
        "code": 513427,
        "pid": 513400,
        "level": 2,
        "name": "宁南县"
    },
    {
        "id": 513426,
        "code": 513426,
        "pid": 513400,
        "level": 2,
        "name": "会东县"
    },
    {
        "id": 513425,
        "code": 513425,
        "pid": 513400,
        "level": 2,
        "name": "会理县"
    },
    {
        "id": 513424,
        "code": 513424,
        "pid": 513400,
        "level": 2,
        "name": "德昌县"
    },
    {
        "id": 511100,
        "code": 511100,
        "pid": 510000,
        "level": 1,
        "name": "乐山市"
    },
    {
        "id": 511123,
        "code": 511123,
        "pid": 511100,
        "level": 2,
        "name": "犍为县"
    },
    {
        "id": 511124,
        "code": 511124,
        "pid": 511100,
        "level": 2,
        "name": "井研县"
    },
    {
        "id": 511126,
        "code": 511126,
        "pid": 511100,
        "level": 2,
        "name": "夹江县"
    },
    {
        "id": 511113,
        "code": 511113,
        "pid": 511100,
        "level": 2,
        "name": "金口河区"
    },
    {
        "id": 511112,
        "code": 511112,
        "pid": 511100,
        "level": 2,
        "name": "五通桥区"
    },
    {
        "id": 511129,
        "code": 511129,
        "pid": 511100,
        "level": 2,
        "name": "沐川县"
    },
    {
        "id": 511133,
        "code": 511133,
        "pid": 511100,
        "level": 2,
        "name": "马边彝族自治县"
    },
    {
        "id": 511132,
        "code": 511132,
        "pid": 511100,
        "level": 2,
        "name": "峨边彝族自治县"
    },
    {
        "id": 511102,
        "code": 511102,
        "pid": 511100,
        "level": 2,
        "name": "市中区"
    },
    {
        "id": 511111,
        "code": 511111,
        "pid": 511100,
        "level": 2,
        "name": "沙湾区"
    },
    {
        "id": 511181,
        "code": 511181,
        "pid": 511100,
        "level": 2,
        "name": "峨眉山市"
    },
    {
        "id": 513200,
        "code": 513200,
        "pid": 510000,
        "level": 1,
        "name": "阿坝藏族羌族自治州"
    },
    {
        "id": 513201,
        "code": 513201,
        "pid": 513200,
        "level": 2,
        "name": "马尔康市"
    },
    {
        "id": 513232,
        "code": 513232,
        "pid": 513200,
        "level": 2,
        "name": "若尔盖县"
    },
    {
        "id": 513231,
        "code": 513231,
        "pid": 513200,
        "level": 2,
        "name": "阿坝县"
    },
    {
        "id": 513230,
        "code": 513230,
        "pid": 513200,
        "level": 2,
        "name": "壤塘县"
    },
    {
        "id": 513228,
        "code": 513228,
        "pid": 513200,
        "level": 2,
        "name": "黑水县"
    },
    {
        "id": 513225,
        "code": 513225,
        "pid": 513200,
        "level": 2,
        "name": "九寨沟县"
    },
    {
        "id": 513224,
        "code": 513224,
        "pid": 513200,
        "level": 2,
        "name": "松潘县"
    },
    {
        "id": 513227,
        "code": 513227,
        "pid": 513200,
        "level": 2,
        "name": "小金县"
    },
    {
        "id": 513226,
        "code": 513226,
        "pid": 513200,
        "level": 2,
        "name": "金川县"
    },
    {
        "id": 513221,
        "code": 513221,
        "pid": 513200,
        "level": 2,
        "name": "汶川县"
    },
    {
        "id": 513233,
        "code": 513233,
        "pid": 513200,
        "level": 2,
        "name": "红原县"
    },
    {
        "id": 513223,
        "code": 513223,
        "pid": 513200,
        "level": 2,
        "name": "茂县"
    },
    {
        "id": 513222,
        "code": 513222,
        "pid": 513200,
        "level": 2,
        "name": "理县"
    },
    {
        "id": 510900,
        "code": 510900,
        "pid": 510000,
        "level": 1,
        "name": "遂宁市"
    },
    {
        "id": 510923,
        "code": 510923,
        "pid": 510900,
        "level": 2,
        "name": "大英县"
    },
    {
        "id": 510922,
        "code": 510922,
        "pid": 510900,
        "level": 2,
        "name": "射洪县"
    },
    {
        "id": 510921,
        "code": 510921,
        "pid": 510900,
        "level": 2,
        "name": "蓬溪县"
    },
    {
        "id": 510903,
        "code": 510903,
        "pid": 510900,
        "level": 2,
        "name": "船山区"
    },
    {
        "id": 510904,
        "code": 510904,
        "pid": 510900,
        "level": 2,
        "name": "安居区"
    },
    {
        "id": 510700,
        "code": 510700,
        "pid": 510000,
        "level": 1,
        "name": "绵阳市"
    },
    {
        "id": 510705,
        "code": 510705,
        "pid": 510700,
        "level": 2,
        "name": "安州区"
    },
    {
        "id": 510704,
        "code": 510704,
        "pid": 510700,
        "level": 2,
        "name": "游仙区"
    },
    {
        "id": 510703,
        "code": 510703,
        "pid": 510700,
        "level": 2,
        "name": "涪城区"
    },
    {
        "id": 510781,
        "code": 510781,
        "pid": 510700,
        "level": 2,
        "name": "江油市"
    },
    {
        "id": 510725,
        "code": 510725,
        "pid": 510700,
        "level": 2,
        "name": "梓潼县"
    },
    {
        "id": 510727,
        "code": 510727,
        "pid": 510700,
        "level": 2,
        "name": "平武县"
    },
    {
        "id": 510726,
        "code": 510726,
        "pid": 510700,
        "level": 2,
        "name": "北川羌族自治县"
    },
    {
        "id": 510723,
        "code": 510723,
        "pid": 510700,
        "level": 2,
        "name": "盐亭县"
    },
    {
        "id": 510722,
        "code": 510722,
        "pid": 510700,
        "level": 2,
        "name": "三台县"
    },
    {
        "id": 510400,
        "code": 510400,
        "pid": 510000,
        "level": 1,
        "name": "攀枝花市"
    },
    {
        "id": 510422,
        "code": 510422,
        "pid": 510400,
        "level": 2,
        "name": "盐边县"
    },
    {
        "id": 510411,
        "code": 510411,
        "pid": 510400,
        "level": 2,
        "name": "仁和区"
    },
    {
        "id": 510421,
        "code": 510421,
        "pid": 510400,
        "level": 2,
        "name": "米易县"
    },
    {
        "id": 510402,
        "code": 510402,
        "pid": 510400,
        "level": 2,
        "name": "东区"
    },
    {
        "id": 510403,
        "code": 510403,
        "pid": 510400,
        "level": 2,
        "name": "西区"
    },
    {
        "id": 510600,
        "code": 510600,
        "pid": 510000,
        "level": 1,
        "name": "德阳市"
    },
    {
        "id": 510682,
        "code": 510682,
        "pid": 510600,
        "level": 2,
        "name": "什邡市"
    },
    {
        "id": 510683,
        "code": 510683,
        "pid": 510600,
        "level": 2,
        "name": "绵竹市"
    },
    {
        "id": 510681,
        "code": 510681,
        "pid": 510600,
        "level": 2,
        "name": "广汉市"
    },
    {
        "id": 510623,
        "code": 510623,
        "pid": 510600,
        "level": 2,
        "name": "中江县"
    },
    {
        "id": 510603,
        "code": 510603,
        "pid": 510600,
        "level": 2,
        "name": "旌阳区"
    },
    {
        "id": 510626,
        "code": 510626,
        "pid": 510600,
        "level": 2,
        "name": "罗江县"
    },
    {
        "id": 511000,
        "code": 511000,
        "pid": 510000,
        "level": 1,
        "name": "内江市"
    },
    {
        "id": 511025,
        "code": 511025,
        "pid": 511000,
        "level": 2,
        "name": "资中县"
    },
    {
        "id": 511024,
        "code": 511024,
        "pid": 511000,
        "level": 2,
        "name": "威远县"
    },
    {
        "id": 511028,
        "code": 511028,
        "pid": 511000,
        "level": 2,
        "name": "隆昌县"
    },
    {
        "id": 511002,
        "code": 511002,
        "pid": 511000,
        "level": 2,
        "name": "市中区"
    },
    {
        "id": 511011,
        "code": 511011,
        "pid": 511000,
        "level": 2,
        "name": "东兴区"
    },
    {
        "id": 511700,
        "code": 511700,
        "pid": 510000,
        "level": 1,
        "name": "达州市"
    },
    {
        "id": 511781,
        "code": 511781,
        "pid": 511700,
        "level": 2,
        "name": "万源市"
    },
    {
        "id": 511724,
        "code": 511724,
        "pid": 511700,
        "level": 2,
        "name": "大竹县"
    },
    {
        "id": 511702,
        "code": 511702,
        "pid": 511700,
        "level": 2,
        "name": "通川区"
    },
    {
        "id": 511725,
        "code": 511725,
        "pid": 511700,
        "level": 2,
        "name": "渠县"
    },
    {
        "id": 511722,
        "code": 511722,
        "pid": 511700,
        "level": 2,
        "name": "宣汉县"
    },
    {
        "id": 511723,
        "code": 511723,
        "pid": 511700,
        "level": 2,
        "name": "开江县"
    },
    {
        "id": 511703,
        "code": 511703,
        "pid": 511700,
        "level": 2,
        "name": "达川区"
    },
    {
        "id": 510100,
        "code": 510100,
        "pid": 510000,
        "level": 1,
        "name": "成都市"
    },
    {
        "id": 510107,
        "code": 510107,
        "pid": 510100,
        "level": 2,
        "name": "武侯区"
    },
    {
        "id": 510104,
        "code": 510104,
        "pid": 510100,
        "level": 2,
        "name": "锦江区"
    },
    {
        "id": 510108,
        "code": 510108,
        "pid": 510100,
        "level": 2,
        "name": "成华区"
    },
    {
        "id": 510106,
        "code": 510106,
        "pid": 510100,
        "level": 2,
        "name": "金牛区"
    },
    {
        "id": 510131,
        "code": 510131,
        "pid": 510100,
        "level": 2,
        "name": "蒲江县"
    },
    {
        "id": 510112,
        "code": 510112,
        "pid": 510100,
        "level": 2,
        "name": "龙泉驿区"
    },
    {
        "id": 510113,
        "code": 510113,
        "pid": 510100,
        "level": 2,
        "name": "青白江区"
    },
    {
        "id": 510129,
        "code": 510129,
        "pid": 510100,
        "level": 2,
        "name": "大邑县"
    },
    {
        "id": 510116,
        "code": 510116,
        "pid": 510100,
        "level": 2,
        "name": "双流区"
    },
    {
        "id": 510124,
        "code": 510124,
        "pid": 510100,
        "level": 2,
        "name": "郫县"
    },
    {
        "id": 510114,
        "code": 510114,
        "pid": 510100,
        "level": 2,
        "name": "新都区"
    },
    {
        "id": 510115,
        "code": 510115,
        "pid": 510100,
        "level": 2,
        "name": "温江区"
    },
    {
        "id": 510181,
        "code": 510181,
        "pid": 510100,
        "level": 2,
        "name": "都江堰市"
    },
    {
        "id": 510105,
        "code": 510105,
        "pid": 510100,
        "level": 2,
        "name": "青羊区"
    },
    {
        "id": 510183,
        "code": 510183,
        "pid": 510100,
        "level": 2,
        "name": "邛崃市"
    },
    {
        "id": 510182,
        "code": 510182,
        "pid": 510100,
        "level": 2,
        "name": "彭州市"
    },
    {
        "id": 510185,
        "code": 510185,
        "pid": 510100,
        "level": 2,
        "name": "简阳市"
    },
    {
        "id": 510184,
        "code": 510184,
        "pid": 510100,
        "level": 2,
        "name": "崇州市"
    },
    {
        "id": 510132,
        "code": 510132,
        "pid": 510100,
        "level": 2,
        "name": "新津县"
    },
    {
        "id": 510121,
        "code": 510121,
        "pid": 510100,
        "level": 2,
        "name": "金堂县"
    },
    {
        "id": 510300,
        "code": 510300,
        "pid": 510000,
        "level": 1,
        "name": "自贡市"
    },
    {
        "id": 510303,
        "code": 510303,
        "pid": 510300,
        "level": 2,
        "name": "贡井区"
    },
    {
        "id": 510302,
        "code": 510302,
        "pid": 510300,
        "level": 2,
        "name": "自流井区"
    },
    {
        "id": 510311,
        "code": 510311,
        "pid": 510300,
        "level": 2,
        "name": "沿滩区"
    },
    {
        "id": 510304,
        "code": 510304,
        "pid": 510300,
        "level": 2,
        "name": "大安区"
    },
    {
        "id": 510321,
        "code": 510321,
        "pid": 510300,
        "level": 2,
        "name": "荣县"
    },
    {
        "id": 510322,
        "code": 510322,
        "pid": 510300,
        "level": 2,
        "name": "富顺县"
    },
    {
        "id": 511300,
        "code": 511300,
        "pid": 510000,
        "level": 1,
        "name": "南充市"
    },
    {
        "id": 511322,
        "code": 511322,
        "pid": 511300,
        "level": 2,
        "name": "营山县"
    },
    {
        "id": 511323,
        "code": 511323,
        "pid": 511300,
        "level": 2,
        "name": "蓬安县"
    },
    {
        "id": 511321,
        "code": 511321,
        "pid": 511300,
        "level": 2,
        "name": "南部县"
    },
    {
        "id": 511381,
        "code": 511381,
        "pid": 511300,
        "level": 2,
        "name": "阆中市"
    },
    {
        "id": 511324,
        "code": 511324,
        "pid": 511300,
        "level": 2,
        "name": "仪陇县"
    },
    {
        "id": 511325,
        "code": 511325,
        "pid": 511300,
        "level": 2,
        "name": "西充县"
    },
    {
        "id": 511304,
        "code": 511304,
        "pid": 511300,
        "level": 2,
        "name": "嘉陵区"
    },
    {
        "id": 511302,
        "code": 511302,
        "pid": 511300,
        "level": 2,
        "name": "顺庆区"
    },
    {
        "id": 511303,
        "code": 511303,
        "pid": 511300,
        "level": 2,
        "name": "高坪区"
    },
    {
        "id": 510500,
        "code": 510500,
        "pid": 510000,
        "level": 1,
        "name": "泸州市"
    },
    {
        "id": 510504,
        "code": 510504,
        "pid": 510500,
        "level": 2,
        "name": "龙马潭区"
    },
    {
        "id": 510503,
        "code": 510503,
        "pid": 510500,
        "level": 2,
        "name": "纳溪区"
    },
    {
        "id": 510502,
        "code": 510502,
        "pid": 510500,
        "level": 2,
        "name": "江阳区"
    },
    {
        "id": 510525,
        "code": 510525,
        "pid": 510500,
        "level": 2,
        "name": "古蔺县"
    },
    {
        "id": 510524,
        "code": 510524,
        "pid": 510500,
        "level": 2,
        "name": "叙永县"
    },
    {
        "id": 510522,
        "code": 510522,
        "pid": 510500,
        "level": 2,
        "name": "合江县"
    },
    {
        "id": 510521,
        "code": 510521,
        "pid": 510500,
        "level": 2,
        "name": "泸县"
    },
    {
        "id": 511800,
        "code": 511800,
        "pid": 510000,
        "level": 1,
        "name": "雅安市"
    },
    {
        "id": 511825,
        "code": 511825,
        "pid": 511800,
        "level": 2,
        "name": "天全县"
    },
    {
        "id": 511824,
        "code": 511824,
        "pid": 511800,
        "level": 2,
        "name": "石棉县"
    },
    {
        "id": 511827,
        "code": 511827,
        "pid": 511800,
        "level": 2,
        "name": "宝兴县"
    },
    {
        "id": 511826,
        "code": 511826,
        "pid": 511800,
        "level": 2,
        "name": "芦山县"
    },
    {
        "id": 511823,
        "code": 511823,
        "pid": 511800,
        "level": 2,
        "name": "汉源县"
    },
    {
        "id": 511822,
        "code": 511822,
        "pid": 511800,
        "level": 2,
        "name": "荥经县"
    },
    {
        "id": 511803,
        "code": 511803,
        "pid": 511800,
        "level": 2,
        "name": "名山区"
    },
    {
        "id": 511802,
        "code": 511802,
        "pid": 511800,
        "level": 2,
        "name": "雨城区"
    },
    {
        "id": 511900,
        "code": 511900,
        "pid": 510000,
        "level": 1,
        "name": "巴中市"
    },
    {
        "id": 511921,
        "code": 511921,
        "pid": 511900,
        "level": 2,
        "name": "通江县"
    },
    {
        "id": 511922,
        "code": 511922,
        "pid": 511900,
        "level": 2,
        "name": "南江县"
    },
    {
        "id": 511923,
        "code": 511923,
        "pid": 511900,
        "level": 2,
        "name": "平昌县"
    },
    {
        "id": 511902,
        "code": 511902,
        "pid": 511900,
        "level": 2,
        "name": "巴州区"
    },
    {
        "id": 511903,
        "code": 511903,
        "pid": 511900,
        "level": 2,
        "name": "恩阳区"
    },
    {
        "id": 511600,
        "code": 511600,
        "pid": 510000,
        "level": 1,
        "name": "广安市"
    },
    {
        "id": 511623,
        "code": 511623,
        "pid": 511600,
        "level": 2,
        "name": "邻水县"
    },
    {
        "id": 511622,
        "code": 511622,
        "pid": 511600,
        "level": 2,
        "name": "武胜县"
    },
    {
        "id": 511621,
        "code": 511621,
        "pid": 511600,
        "level": 2,
        "name": "岳池县"
    },
    {
        "id": 511681,
        "code": 511681,
        "pid": 511600,
        "level": 2,
        "name": "华蓥市"
    },
    {
        "id": 511603,
        "code": 511603,
        "pid": 511600,
        "level": 2,
        "name": "前锋区"
    },
    {
        "id": 511602,
        "code": 511602,
        "pid": 511600,
        "level": 2,
        "name": "广安区"
    },
    {
        "id": 513300,
        "code": 513300,
        "pid": 510000,
        "level": 1,
        "name": "甘孜藏族自治州"
    },
    {
        "id": 513337,
        "code": 513337,
        "pid": 513300,
        "level": 2,
        "name": "稻城县"
    },
    {
        "id": 513336,
        "code": 513336,
        "pid": 513300,
        "level": 2,
        "name": "乡城县"
    },
    {
        "id": 513335,
        "code": 513335,
        "pid": 513300,
        "level": 2,
        "name": "巴塘县"
    },
    {
        "id": 513334,
        "code": 513334,
        "pid": 513300,
        "level": 2,
        "name": "理塘县"
    },
    {
        "id": 513333,
        "code": 513333,
        "pid": 513300,
        "level": 2,
        "name": "色达县"
    },
    {
        "id": 513332,
        "code": 513332,
        "pid": 513300,
        "level": 2,
        "name": "石渠县"
    },
    {
        "id": 513331,
        "code": 513331,
        "pid": 513300,
        "level": 2,
        "name": "白玉县"
    },
    {
        "id": 513330,
        "code": 513330,
        "pid": 513300,
        "level": 2,
        "name": "德格县"
    },
    {
        "id": 513301,
        "code": 513301,
        "pid": 513300,
        "level": 2,
        "name": "康定市"
    },
    {
        "id": 513338,
        "code": 513338,
        "pid": 513300,
        "level": 2,
        "name": "得荣县"
    },
    {
        "id": 513328,
        "code": 513328,
        "pid": 513300,
        "level": 2,
        "name": "甘孜县"
    },
    {
        "id": 513329,
        "code": 513329,
        "pid": 513300,
        "level": 2,
        "name": "新龙县"
    },
    {
        "id": 513322,
        "code": 513322,
        "pid": 513300,
        "level": 2,
        "name": "泸定县"
    },
    {
        "id": 513323,
        "code": 513323,
        "pid": 513300,
        "level": 2,
        "name": "丹巴县"
    },
    {
        "id": 513324,
        "code": 513324,
        "pid": 513300,
        "level": 2,
        "name": "九龙县"
    },
    {
        "id": 513325,
        "code": 513325,
        "pid": 513300,
        "level": 2,
        "name": "雅江县"
    },
    {
        "id": 513326,
        "code": 513326,
        "pid": 513300,
        "level": 2,
        "name": "道孚县"
    },
    {
        "id": 513327,
        "code": 513327,
        "pid": 513300,
        "level": 2,
        "name": "炉霍县"
    },
    {
        "id": 512000,
        "code": 512000,
        "pid": 510000,
        "level": 1,
        "name": "资阳市"
    },
    {
        "id": 512021,
        "code": 512021,
        "pid": 512000,
        "level": 2,
        "name": "安岳县"
    },
    {
        "id": 512022,
        "code": 512022,
        "pid": 512000,
        "level": 2,
        "name": "乐至县"
    },
    {
        "id": 512002,
        "code": 512002,
        "pid": 512000,
        "level": 2,
        "name": "雁江区"
    },
    {
        "id": 320000,
        "code": 320000,
        "pid": 0,
        "level": 0,
        "name": "江苏省"
    },
    {
        "id": 320700,
        "code": 320700,
        "pid": 320000,
        "level": 1,
        "name": "连云港市"
    },
    {
        "id": 320703,
        "code": 320703,
        "pid": 320700,
        "level": 2,
        "name": "连云区"
    },
    {
        "id": 320706,
        "code": 320706,
        "pid": 320700,
        "level": 2,
        "name": "海州区"
    },
    {
        "id": 320707,
        "code": 320707,
        "pid": 320700,
        "level": 2,
        "name": "赣榆区"
    },
    {
        "id": 320724,
        "code": 320724,
        "pid": 320700,
        "level": 2,
        "name": "灌南县"
    },
    {
        "id": 320722,
        "code": 320722,
        "pid": 320700,
        "level": 2,
        "name": "东海县"
    },
    {
        "id": 320723,
        "code": 320723,
        "pid": 320700,
        "level": 2,
        "name": "灌云县"
    },
    {
        "id": 320800,
        "code": 320800,
        "pid": 320000,
        "level": 1,
        "name": "淮安市"
    },
    {
        "id": 320830,
        "code": 320830,
        "pid": 320800,
        "level": 2,
        "name": "盱眙县"
    },
    {
        "id": 320804,
        "code": 320804,
        "pid": 320800,
        "level": 2,
        "name": "淮阴区"
    },
    {
        "id": 320812,
        "code": 320812,
        "pid": 320800,
        "level": 2,
        "name": "清江浦区"
    },
    {
        "id": 320813,
        "code": 320813,
        "pid": 320800,
        "level": 2,
        "name": "洪泽区"
    },
    {
        "id": 320803,
        "code": 320803,
        "pid": 320800,
        "level": 2,
        "name": "淮安区"
    },
    {
        "id": 320831,
        "code": 320831,
        "pid": 320800,
        "level": 2,
        "name": "金湖县"
    },
    {
        "id": 320826,
        "code": 320826,
        "pid": 320800,
        "level": 2,
        "name": "涟水县"
    },
    {
        "id": 320300,
        "code": 320300,
        "pid": 320000,
        "level": 1,
        "name": "徐州市"
    },
    {
        "id": 320321,
        "code": 320321,
        "pid": 320300,
        "level": 2,
        "name": "丰县"
    },
    {
        "id": 320322,
        "code": 320322,
        "pid": 320300,
        "level": 2,
        "name": "沛县"
    },
    {
        "id": 320305,
        "code": 320305,
        "pid": 320300,
        "level": 2,
        "name": "贾汪区"
    },
    {
        "id": 320324,
        "code": 320324,
        "pid": 320300,
        "level": 2,
        "name": "睢宁县"
    },
    {
        "id": 320303,
        "code": 320303,
        "pid": 320300,
        "level": 2,
        "name": "云龙区"
    },
    {
        "id": 320312,
        "code": 320312,
        "pid": 320300,
        "level": 2,
        "name": "铜山区"
    },
    {
        "id": 320311,
        "code": 320311,
        "pid": 320300,
        "level": 2,
        "name": "泉山区"
    },
    {
        "id": 320302,
        "code": 320302,
        "pid": 320300,
        "level": 2,
        "name": "鼓楼区"
    },
    {
        "id": 320382,
        "code": 320382,
        "pid": 320300,
        "level": 2,
        "name": "邳州市"
    },
    {
        "id": 320381,
        "code": 320381,
        "pid": 320300,
        "level": 2,
        "name": "新沂市"
    },
    {
        "id": 320600,
        "code": 320600,
        "pid": 320000,
        "level": 1,
        "name": "南通市"
    },
    {
        "id": 320621,
        "code": 320621,
        "pid": 320600,
        "level": 2,
        "name": "海安县"
    },
    {
        "id": 320623,
        "code": 320623,
        "pid": 320600,
        "level": 2,
        "name": "如东县"
    },
    {
        "id": 320602,
        "code": 320602,
        "pid": 320600,
        "level": 2,
        "name": "崇川区"
    },
    {
        "id": 320611,
        "code": 320611,
        "pid": 320600,
        "level": 2,
        "name": "港闸区"
    },
    {
        "id": 320612,
        "code": 320612,
        "pid": 320600,
        "level": 2,
        "name": "通州区"
    },
    {
        "id": 320682,
        "code": 320682,
        "pid": 320600,
        "level": 2,
        "name": "如皋市"
    },
    {
        "id": 320681,
        "code": 320681,
        "pid": 320600,
        "level": 2,
        "name": "启东市"
    },
    {
        "id": 320684,
        "code": 320684,
        "pid": 320600,
        "level": 2,
        "name": "海门市"
    },
    {
        "id": 321100,
        "code": 321100,
        "pid": 320000,
        "level": 1,
        "name": "镇江市"
    },
    {
        "id": 321111,
        "code": 321111,
        "pid": 321100,
        "level": 2,
        "name": "润州区"
    },
    {
        "id": 321112,
        "code": 321112,
        "pid": 321100,
        "level": 2,
        "name": "丹徒区"
    },
    {
        "id": 321183,
        "code": 321183,
        "pid": 321100,
        "level": 2,
        "name": "句容市"
    },
    {
        "id": 321182,
        "code": 321182,
        "pid": 321100,
        "level": 2,
        "name": "扬中市"
    },
    {
        "id": 321181,
        "code": 321181,
        "pid": 321100,
        "level": 2,
        "name": "丹阳市"
    },
    {
        "id": 321102,
        "code": 321102,
        "pid": 321100,
        "level": 2,
        "name": "京口区"
    },
    {
        "id": 320500,
        "code": 320500,
        "pid": 320000,
        "level": 1,
        "name": "苏州市"
    },
    {
        "id": 320581,
        "code": 320581,
        "pid": 320500,
        "level": 2,
        "name": "常熟市"
    },
    {
        "id": 320582,
        "code": 320582,
        "pid": 320500,
        "level": 2,
        "name": "张家港市"
    },
    {
        "id": 320583,
        "code": 320583,
        "pid": 320500,
        "level": 2,
        "name": "昆山市"
    },
    {
        "id": 320585,
        "code": 320585,
        "pid": 320500,
        "level": 2,
        "name": "太仓市"
    },
    {
        "id": 320505,
        "code": 320505,
        "pid": 320500,
        "level": 2,
        "name": "虎丘区"
    },
    {
        "id": 320506,
        "code": 320506,
        "pid": 320500,
        "level": 2,
        "name": "吴中区"
    },
    {
        "id": 320507,
        "code": 320507,
        "pid": 320500,
        "level": 2,
        "name": "相城区"
    },
    {
        "id": 320508,
        "code": 320508,
        "pid": 320500,
        "level": 2,
        "name": "姑苏区"
    },
    {
        "id": 320509,
        "code": 320509,
        "pid": 320500,
        "level": 2,
        "name": "吴江区"
    },
    {
        "id": 320100,
        "code": 320100,
        "pid": 320000,
        "level": 1,
        "name": "南京市"
    },
    {
        "id": 320113,
        "code": 320113,
        "pid": 320100,
        "level": 2,
        "name": "栖霞区"
    },
    {
        "id": 320115,
        "code": 320115,
        "pid": 320100,
        "level": 2,
        "name": "江宁区"
    },
    {
        "id": 320111,
        "code": 320111,
        "pid": 320100,
        "level": 2,
        "name": "浦口区"
    },
    {
        "id": 320104,
        "code": 320104,
        "pid": 320100,
        "level": 2,
        "name": "秦淮区"
    },
    {
        "id": 320105,
        "code": 320105,
        "pid": 320100,
        "level": 2,
        "name": "建邺区"
    },
    {
        "id": 320106,
        "code": 320106,
        "pid": 320100,
        "level": 2,
        "name": "鼓楼区"
    },
    {
        "id": 320117,
        "code": 320117,
        "pid": 320100,
        "level": 2,
        "name": "溧水区"
    },
    {
        "id": 320116,
        "code": 320116,
        "pid": 320100,
        "level": 2,
        "name": "六合区"
    },
    {
        "id": 320102,
        "code": 320102,
        "pid": 320100,
        "level": 2,
        "name": "玄武区"
    },
    {
        "id": 320114,
        "code": 320114,
        "pid": 320100,
        "level": 2,
        "name": "雨花台区"
    },
    {
        "id": 320118,
        "code": 320118,
        "pid": 320100,
        "level": 2,
        "name": "高淳区"
    },
    {
        "id": 320400,
        "code": 320400,
        "pid": 320000,
        "level": 1,
        "name": "常州市"
    },
    {
        "id": 320411,
        "code": 320411,
        "pid": 320400,
        "level": 2,
        "name": "新北区"
    },
    {
        "id": 320481,
        "code": 320481,
        "pid": 320400,
        "level": 2,
        "name": "溧阳市"
    },
    {
        "id": 320412,
        "code": 320412,
        "pid": 320400,
        "level": 2,
        "name": "武进区"
    },
    {
        "id": 320413,
        "code": 320413,
        "pid": 320400,
        "level": 2,
        "name": "金坛区"
    },
    {
        "id": 320402,
        "code": 320402,
        "pid": 320400,
        "level": 2,
        "name": "天宁区"
    },
    {
        "id": 320404,
        "code": 320404,
        "pid": 320400,
        "level": 2,
        "name": "钟楼区"
    },
    {
        "id": 321000,
        "code": 321000,
        "pid": 320000,
        "level": 1,
        "name": "扬州市"
    },
    {
        "id": 321023,
        "code": 321023,
        "pid": 321000,
        "level": 2,
        "name": "宝应县"
    },
    {
        "id": 321002,
        "code": 321002,
        "pid": 321000,
        "level": 2,
        "name": "广陵区"
    },
    {
        "id": 321003,
        "code": 321003,
        "pid": 321000,
        "level": 2,
        "name": "邗江区"
    },
    {
        "id": 321012,
        "code": 321012,
        "pid": 321000,
        "level": 2,
        "name": "江都区"
    },
    {
        "id": 321084,
        "code": 321084,
        "pid": 321000,
        "level": 2,
        "name": "高邮市"
    },
    {
        "id": 321081,
        "code": 321081,
        "pid": 321000,
        "level": 2,
        "name": "仪征市"
    },
    {
        "id": 321200,
        "code": 321200,
        "pid": 320000,
        "level": 1,
        "name": "泰州市"
    },
    {
        "id": 321281,
        "code": 321281,
        "pid": 321200,
        "level": 2,
        "name": "兴化市"
    },
    {
        "id": 321282,
        "code": 321282,
        "pid": 321200,
        "level": 2,
        "name": "靖江市"
    },
    {
        "id": 321283,
        "code": 321283,
        "pid": 321200,
        "level": 2,
        "name": "泰兴市"
    },
    {
        "id": 321204,
        "code": 321204,
        "pid": 321200,
        "level": 2,
        "name": "姜堰区"
    },
    {
        "id": 321202,
        "code": 321202,
        "pid": 321200,
        "level": 2,
        "name": "海陵区"
    },
    {
        "id": 321203,
        "code": 321203,
        "pid": 321200,
        "level": 2,
        "name": "高港区"
    },
    {
        "id": 320200,
        "code": 320200,
        "pid": 320000,
        "level": 1,
        "name": "无锡市"
    },
    {
        "id": 320211,
        "code": 320211,
        "pid": 320200,
        "level": 2,
        "name": "滨湖区"
    },
    {
        "id": 320213,
        "code": 320213,
        "pid": 320200,
        "level": 2,
        "name": "梁溪区"
    },
    {
        "id": 320214,
        "code": 320214,
        "pid": 320200,
        "level": 2,
        "name": "新吴区"
    },
    {
        "id": 320282,
        "code": 320282,
        "pid": 320200,
        "level": 2,
        "name": "宜兴市"
    },
    {
        "id": 320281,
        "code": 320281,
        "pid": 320200,
        "level": 2,
        "name": "江阴市"
    },
    {
        "id": 320206,
        "code": 320206,
        "pid": 320200,
        "level": 2,
        "name": "惠山区"
    },
    {
        "id": 320205,
        "code": 320205,
        "pid": 320200,
        "level": 2,
        "name": "锡山区"
    },
    {
        "id": 320900,
        "code": 320900,
        "pid": 320000,
        "level": 1,
        "name": "盐城市"
    },
    {
        "id": 320981,
        "code": 320981,
        "pid": 320900,
        "level": 2,
        "name": "东台市"
    },
    {
        "id": 320922,
        "code": 320922,
        "pid": 320900,
        "level": 2,
        "name": "滨海县"
    },
    {
        "id": 320923,
        "code": 320923,
        "pid": 320900,
        "level": 2,
        "name": "阜宁县"
    },
    {
        "id": 320921,
        "code": 320921,
        "pid": 320900,
        "level": 2,
        "name": "响水县"
    },
    {
        "id": 320924,
        "code": 320924,
        "pid": 320900,
        "level": 2,
        "name": "射阳县"
    },
    {
        "id": 320925,
        "code": 320925,
        "pid": 320900,
        "level": 2,
        "name": "建湖县"
    },
    {
        "id": 320904,
        "code": 320904,
        "pid": 320900,
        "level": 2,
        "name": "大丰区"
    },
    {
        "id": 320902,
        "code": 320902,
        "pid": 320900,
        "level": 2,
        "name": "亭湖区"
    },
    {
        "id": 320903,
        "code": 320903,
        "pid": 320900,
        "level": 2,
        "name": "盐都区"
    },
    {
        "id": 321300,
        "code": 321300,
        "pid": 320000,
        "level": 1,
        "name": "宿迁市"
    },
    {
        "id": 321324,
        "code": 321324,
        "pid": 321300,
        "level": 2,
        "name": "泗洪县"
    },
    {
        "id": 321323,
        "code": 321323,
        "pid": 321300,
        "level": 2,
        "name": "泗阳县"
    },
    {
        "id": 321322,
        "code": 321322,
        "pid": 321300,
        "level": 2,
        "name": "沭阳县"
    },
    {
        "id": 321311,
        "code": 321311,
        "pid": 321300,
        "level": 2,
        "name": "宿豫区"
    },
    {
        "id": 321302,
        "code": 321302,
        "pid": 321300,
        "level": 2,
        "name": "宿城区"
    },
    {
        "id": 120000,
        "code": 120000,
        "pid": 0,
        "level": 0,
        "name": "天津市"
    },
    {
        "id": 120100,
        "code": 120100,
        "pid": 120000,
        "level": 1,
        "name": "市辖区"
    },
    {
        "id": 120116,
        "code": 120116,
        "pid": 120100,
        "level": 2,
        "name": "滨海新区"
    },
    {
        "id": 120119,
        "code": 120119,
        "pid": 120100,
        "level": 2,
        "name": "蓟州区"
    },
    {
        "id": 120118,
        "code": 120118,
        "pid": 120100,
        "level": 2,
        "name": "静海区"
    },
    {
        "id": 120106,
        "code": 120106,
        "pid": 120100,
        "level": 2,
        "name": "红桥区"
    },
    {
        "id": 120111,
        "code": 120111,
        "pid": 120100,
        "level": 2,
        "name": "西青区"
    },
    {
        "id": 120104,
        "code": 120104,
        "pid": 120100,
        "level": 2,
        "name": "南开区"
    },
    {
        "id": 120105,
        "code": 120105,
        "pid": 120100,
        "level": 2,
        "name": "河北区"
    },
    {
        "id": 120102,
        "code": 120102,
        "pid": 120100,
        "level": 2,
        "name": "河东区"
    },
    {
        "id": 120103,
        "code": 120103,
        "pid": 120100,
        "level": 2,
        "name": "河西区"
    },
    {
        "id": 120113,
        "code": 120113,
        "pid": 120100,
        "level": 2,
        "name": "北辰区"
    },
    {
        "id": 120101,
        "code": 120101,
        "pid": 120100,
        "level": 2,
        "name": "和平区"
    },
    {
        "id": 120115,
        "code": 120115,
        "pid": 120100,
        "level": 2,
        "name": "宝坻区"
    },
    {
        "id": 120114,
        "code": 120114,
        "pid": 120100,
        "level": 2,
        "name": "武清区"
    },
    {
        "id": 120112,
        "code": 120112,
        "pid": 120100,
        "level": 2,
        "name": "津南区"
    },
    {
        "id": 120110,
        "code": 120110,
        "pid": 120100,
        "level": 2,
        "name": "东丽区"
    },
    {
        "id": 120117,
        "code": 120117,
        "pid": 120100,
        "level": 2,
        "name": "宁河区"
    },
    {
        "id": 650000,
        "code": 650000,
        "pid": 0,
        "level": 0,
        "name": "新疆维吾尔自治区"
    },
    {
        "id": 652300,
        "code": 652300,
        "pid": 650000,
        "level": 1,
        "name": "昌吉回族自治州"
    },
    {
        "id": 652327,
        "code": 652327,
        "pid": 652300,
        "level": 2,
        "name": "吉木萨尔县"
    },
    {
        "id": 652324,
        "code": 652324,
        "pid": 652300,
        "level": 2,
        "name": "玛纳斯县"
    },
    {
        "id": 652325,
        "code": 652325,
        "pid": 652300,
        "level": 2,
        "name": "奇台县"
    },
    {
        "id": 652323,
        "code": 652323,
        "pid": 652300,
        "level": 2,
        "name": "呼图壁县"
    },
    {
        "id": 652301,
        "code": 652301,
        "pid": 652300,
        "level": 2,
        "name": "昌吉市"
    },
    {
        "id": 652302,
        "code": 652302,
        "pid": 652300,
        "level": 2,
        "name": "阜康市"
    },
    {
        "id": 652328,
        "code": 652328,
        "pid": 652300,
        "level": 2,
        "name": "木垒哈萨克自治县"
    },
    {
        "id": 659000,
        "code": 659000,
        "pid": 650000,
        "level": 1,
        "name": "直辖县市"
    },
    {
        "id": 659002,
        "code": 659002,
        "pid": 659000,
        "level": 2,
        "name": "阿拉尔市"
    },
    {
        "id": 659003,
        "code": 659003,
        "pid": 659000,
        "level": 2,
        "name": "图木舒克市"
    },
    {
        "id": 659001,
        "code": 659001,
        "pid": 659000,
        "level": 2,
        "name": "石河子市"
    },
    {
        "id": 659006,
        "code": 659006,
        "pid": 659000,
        "level": 2,
        "name": "铁门关市"
    },
    {
        "id": 659004,
        "code": 659004,
        "pid": 659000,
        "level": 2,
        "name": "五家渠市"
    },
    {
        "id": 652800,
        "code": 652800,
        "pid": 650000,
        "level": 1,
        "name": "巴音郭楞蒙古自治州"
    },
    {
        "id": 652801,
        "code": 652801,
        "pid": 652800,
        "level": 2,
        "name": "库尔勒市"
    },
    {
        "id": 652829,
        "code": 652829,
        "pid": 652800,
        "level": 2,
        "name": "博湖县"
    },
    {
        "id": 652828,
        "code": 652828,
        "pid": 652800,
        "level": 2,
        "name": "和硕县"
    },
    {
        "id": 652823,
        "code": 652823,
        "pid": 652800,
        "level": 2,
        "name": "尉犁县"
    },
    {
        "id": 652822,
        "code": 652822,
        "pid": 652800,
        "level": 2,
        "name": "轮台县"
    },
    {
        "id": 652825,
        "code": 652825,
        "pid": 652800,
        "level": 2,
        "name": "且末县"
    },
    {
        "id": 652824,
        "code": 652824,
        "pid": 652800,
        "level": 2,
        "name": "若羌县"
    },
    {
        "id": 652827,
        "code": 652827,
        "pid": 652800,
        "level": 2,
        "name": "和静县"
    },
    {
        "id": 652826,
        "code": 652826,
        "pid": 652800,
        "level": 2,
        "name": "焉耆回族自治县"
    },
    {
        "id": 653000,
        "code": 653000,
        "pid": 650000,
        "level": 1,
        "name": "克孜勒苏柯尔克孜自治州"
    },
    {
        "id": 653022,
        "code": 653022,
        "pid": 653000,
        "level": 2,
        "name": "阿克陶县"
    },
    {
        "id": 653023,
        "code": 653023,
        "pid": 653000,
        "level": 2,
        "name": "阿合奇县"
    },
    {
        "id": 653001,
        "code": 653001,
        "pid": 653000,
        "level": 2,
        "name": "阿图什市"
    },
    {
        "id": 653024,
        "code": 653024,
        "pid": 653000,
        "level": 2,
        "name": "乌恰县"
    },
    {
        "id": 650400,
        "code": 650400,
        "pid": 650000,
        "level": 1,
        "name": "吐鲁番市"
    },
    {
        "id": 650422,
        "code": 650422,
        "pid": 650400,
        "level": 2,
        "name": "托克逊县"
    },
    {
        "id": 650421,
        "code": 650421,
        "pid": 650400,
        "level": 2,
        "name": "鄯善县"
    },
    {
        "id": 650402,
        "code": 650402,
        "pid": 650400,
        "level": 2,
        "name": "高昌区"
    },
    {
        "id": 654300,
        "code": 654300,
        "pid": 650000,
        "level": 1,
        "name": "阿勒泰地区"
    },
    {
        "id": 654321,
        "code": 654321,
        "pid": 654300,
        "level": 2,
        "name": "布尔津县"
    },
    {
        "id": 654322,
        "code": 654322,
        "pid": 654300,
        "level": 2,
        "name": "富蕴县"
    },
    {
        "id": 654323,
        "code": 654323,
        "pid": 654300,
        "level": 2,
        "name": "福海县"
    },
    {
        "id": 654324,
        "code": 654324,
        "pid": 654300,
        "level": 2,
        "name": "哈巴河县"
    },
    {
        "id": 654325,
        "code": 654325,
        "pid": 654300,
        "level": 2,
        "name": "青河县"
    },
    {
        "id": 654326,
        "code": 654326,
        "pid": 654300,
        "level": 2,
        "name": "吉木乃县"
    },
    {
        "id": 654301,
        "code": 654301,
        "pid": 654300,
        "level": 2,
        "name": "阿勒泰市"
    },
    {
        "id": 653100,
        "code": 653100,
        "pid": 650000,
        "level": 1,
        "name": "喀什地区"
    },
    {
        "id": 653130,
        "code": 653130,
        "pid": 653100,
        "level": 2,
        "name": "巴楚县"
    },
    {
        "id": 653131,
        "code": 653131,
        "pid": 653100,
        "level": 2,
        "name": "塔什库尔干塔吉克自治县"
    },
    {
        "id": 653101,
        "code": 653101,
        "pid": 653100,
        "level": 2,
        "name": "喀什市"
    },
    {
        "id": 653127,
        "code": 653127,
        "pid": 653100,
        "level": 2,
        "name": "麦盖提县"
    },
    {
        "id": 653126,
        "code": 653126,
        "pid": 653100,
        "level": 2,
        "name": "叶城县"
    },
    {
        "id": 653125,
        "code": 653125,
        "pid": 653100,
        "level": 2,
        "name": "莎车县"
    },
    {
        "id": 653124,
        "code": 653124,
        "pid": 653100,
        "level": 2,
        "name": "泽普县"
    },
    {
        "id": 653123,
        "code": 653123,
        "pid": 653100,
        "level": 2,
        "name": "英吉沙县"
    },
    {
        "id": 653122,
        "code": 653122,
        "pid": 653100,
        "level": 2,
        "name": "疏勒县"
    },
    {
        "id": 653121,
        "code": 653121,
        "pid": 653100,
        "level": 2,
        "name": "疏附县"
    },
    {
        "id": 653129,
        "code": 653129,
        "pid": 653100,
        "level": 2,
        "name": "伽师县"
    },
    {
        "id": 653128,
        "code": 653128,
        "pid": 653100,
        "level": 2,
        "name": "岳普湖县"
    },
    {
        "id": 654200,
        "code": 654200,
        "pid": 650000,
        "level": 1,
        "name": "塔城地区"
    },
    {
        "id": 654225,
        "code": 654225,
        "pid": 654200,
        "level": 2,
        "name": "裕民县"
    },
    {
        "id": 654224,
        "code": 654224,
        "pid": 654200,
        "level": 2,
        "name": "托里县"
    },
    {
        "id": 654226,
        "code": 654226,
        "pid": 654200,
        "level": 2,
        "name": "和布克赛尔蒙古自治县"
    },
    {
        "id": 654221,
        "code": 654221,
        "pid": 654200,
        "level": 2,
        "name": "额敏县"
    },
    {
        "id": 654223,
        "code": 654223,
        "pid": 654200,
        "level": 2,
        "name": "沙湾县"
    },
    {
        "id": 654202,
        "code": 654202,
        "pid": 654200,
        "level": 2,
        "name": "乌苏市"
    },
    {
        "id": 654201,
        "code": 654201,
        "pid": 654200,
        "level": 2,
        "name": "塔城市"
    },
    {
        "id": 650200,
        "code": 650200,
        "pid": 650000,
        "level": 1,
        "name": "克拉玛依市"
    },
    {
        "id": 650203,
        "code": 650203,
        "pid": 650200,
        "level": 2,
        "name": "克拉玛依区"
    },
    {
        "id": 650202,
        "code": 650202,
        "pid": 650200,
        "level": 2,
        "name": "独山子区"
    },
    {
        "id": 650205,
        "code": 650205,
        "pid": 650200,
        "level": 2,
        "name": "乌尔禾区"
    },
    {
        "id": 650204,
        "code": 650204,
        "pid": 650200,
        "level": 2,
        "name": "白碱滩区"
    },
    {
        "id": 653200,
        "code": 653200,
        "pid": 650000,
        "level": 1,
        "name": "和田地区"
    },
    {
        "id": 653201,
        "code": 653201,
        "pid": 653200,
        "level": 2,
        "name": "和田市"
    },
    {
        "id": 653221,
        "code": 653221,
        "pid": 653200,
        "level": 2,
        "name": "和田县"
    },
    {
        "id": 653222,
        "code": 653222,
        "pid": 653200,
        "level": 2,
        "name": "墨玉县"
    },
    {
        "id": 653223,
        "code": 653223,
        "pid": 653200,
        "level": 2,
        "name": "皮山县"
    },
    {
        "id": 653224,
        "code": 653224,
        "pid": 653200,
        "level": 2,
        "name": "洛浦县"
    },
    {
        "id": 653225,
        "code": 653225,
        "pid": 653200,
        "level": 2,
        "name": "策勒县"
    },
    {
        "id": 653226,
        "code": 653226,
        "pid": 653200,
        "level": 2,
        "name": "于田县"
    },
    {
        "id": 653227,
        "code": 653227,
        "pid": 653200,
        "level": 2,
        "name": "民丰县"
    },
    {
        "id": 650100,
        "code": 650100,
        "pid": 650000,
        "level": 1,
        "name": "乌鲁木齐市"
    },
    {
        "id": 650109,
        "code": 650109,
        "pid": 650100,
        "level": 2,
        "name": "米东区"
    },
    {
        "id": 650107,
        "code": 650107,
        "pid": 650100,
        "level": 2,
        "name": "达坂城区"
    },
    {
        "id": 650102,
        "code": 650102,
        "pid": 650100,
        "level": 2,
        "name": "天山区"
    },
    {
        "id": 650103,
        "code": 650103,
        "pid": 650100,
        "level": 2,
        "name": "沙依巴克区"
    },
    {
        "id": 650104,
        "code": 650104,
        "pid": 650100,
        "level": 2,
        "name": "新市区"
    },
    {
        "id": 650105,
        "code": 650105,
        "pid": 650100,
        "level": 2,
        "name": "水磨沟区"
    },
    {
        "id": 650106,
        "code": 650106,
        "pid": 650100,
        "level": 2,
        "name": "头屯河区"
    },
    {
        "id": 650121,
        "code": 650121,
        "pid": 650100,
        "level": 2,
        "name": "乌鲁木齐县"
    },
    {
        "id": 652700,
        "code": 652700,
        "pid": 650000,
        "level": 1,
        "name": "博尔塔拉蒙古自治州"
    },
    {
        "id": 652722,
        "code": 652722,
        "pid": 652700,
        "level": 2,
        "name": "精河县"
    },
    {
        "id": 652723,
        "code": 652723,
        "pid": 652700,
        "level": 2,
        "name": "温泉县"
    },
    {
        "id": 652701,
        "code": 652701,
        "pid": 652700,
        "level": 2,
        "name": "博乐市"
    },
    {
        "id": 652702,
        "code": 652702,
        "pid": 652700,
        "level": 2,
        "name": "阿拉山口市"
    },
    {
        "id": 652900,
        "code": 652900,
        "pid": 650000,
        "level": 1,
        "name": "阿克苏地区"
    },
    {
        "id": 652924,
        "code": 652924,
        "pid": 652900,
        "level": 2,
        "name": "沙雅县"
    },
    {
        "id": 652925,
        "code": 652925,
        "pid": 652900,
        "level": 2,
        "name": "新和县"
    },
    {
        "id": 652926,
        "code": 652926,
        "pid": 652900,
        "level": 2,
        "name": "拜城县"
    },
    {
        "id": 652927,
        "code": 652927,
        "pid": 652900,
        "level": 2,
        "name": "乌什县"
    },
    {
        "id": 652922,
        "code": 652922,
        "pid": 652900,
        "level": 2,
        "name": "温宿县"
    },
    {
        "id": 652923,
        "code": 652923,
        "pid": 652900,
        "level": 2,
        "name": "库车县"
    },
    {
        "id": 652928,
        "code": 652928,
        "pid": 652900,
        "level": 2,
        "name": "阿瓦提县"
    },
    {
        "id": 652929,
        "code": 652929,
        "pid": 652900,
        "level": 2,
        "name": "柯坪县"
    },
    {
        "id": 652901,
        "code": 652901,
        "pid": 652900,
        "level": 2,
        "name": "阿克苏市"
    },
    {
        "id": 650500,
        "code": 650500,
        "pid": 650000,
        "level": 1,
        "name": "哈密市"
    },
    {
        "id": 650522,
        "code": 650522,
        "pid": 650500,
        "level": 2,
        "name": "伊吾县"
    },
    {
        "id": 650521,
        "code": 650521,
        "pid": 650500,
        "level": 2,
        "name": "巴里坤哈萨克自治县"
    },
    {
        "id": 650502,
        "code": 650502,
        "pid": 650500,
        "level": 2,
        "name": "伊州区"
    },
    {
        "id": 654000,
        "code": 654000,
        "pid": 650000,
        "level": 1,
        "name": "伊犁哈萨克自治州"
    },
    {
        "id": 654027,
        "code": 654027,
        "pid": 654000,
        "level": 2,
        "name": "特克斯县"
    },
    {
        "id": 654026,
        "code": 654026,
        "pid": 654000,
        "level": 2,
        "name": "昭苏县"
    },
    {
        "id": 654025,
        "code": 654025,
        "pid": 654000,
        "level": 2,
        "name": "新源县"
    },
    {
        "id": 654024,
        "code": 654024,
        "pid": 654000,
        "level": 2,
        "name": "巩留县"
    },
    {
        "id": 654023,
        "code": 654023,
        "pid": 654000,
        "level": 2,
        "name": "霍城县"
    },
    {
        "id": 654022,
        "code": 654022,
        "pid": 654000,
        "level": 2,
        "name": "察布查尔锡伯自治县"
    },
    {
        "id": 654021,
        "code": 654021,
        "pid": 654000,
        "level": 2,
        "name": "伊宁县"
    },
    {
        "id": 654028,
        "code": 654028,
        "pid": 654000,
        "level": 2,
        "name": "尼勒克县"
    },
    {
        "id": 654004,
        "code": 654004,
        "pid": 654000,
        "level": 2,
        "name": "霍尔果斯市"
    },
    {
        "id": 654003,
        "code": 654003,
        "pid": 654000,
        "level": 2,
        "name": "奎屯市"
    },
    {
        "id": 654002,
        "code": 654002,
        "pid": 654000,
        "level": 2,
        "name": "伊宁市"
    },
    {
        "id": 370000,
        "code": 370000,
        "pid": 0,
        "level": 0,
        "name": "山东省"
    },
    {
        "id": 370800,
        "code": 370800,
        "pid": 370000,
        "level": 1,
        "name": "济宁市"
    },
    {
        "id": 370826,
        "code": 370826,
        "pid": 370800,
        "level": 2,
        "name": "微山县"
    },
    {
        "id": 370827,
        "code": 370827,
        "pid": 370800,
        "level": 2,
        "name": "鱼台县"
    },
    {
        "id": 370831,
        "code": 370831,
        "pid": 370800,
        "level": 2,
        "name": "泗水县"
    },
    {
        "id": 370830,
        "code": 370830,
        "pid": 370800,
        "level": 2,
        "name": "汶上县"
    },
    {
        "id": 370832,
        "code": 370832,
        "pid": 370800,
        "level": 2,
        "name": "梁山县"
    },
    {
        "id": 370812,
        "code": 370812,
        "pid": 370800,
        "level": 2,
        "name": "兖州区"
    },
    {
        "id": 370828,
        "code": 370828,
        "pid": 370800,
        "level": 2,
        "name": "金乡县"
    },
    {
        "id": 370829,
        "code": 370829,
        "pid": 370800,
        "level": 2,
        "name": "嘉祥县"
    },
    {
        "id": 370811,
        "code": 370811,
        "pid": 370800,
        "level": 2,
        "name": "任城区"
    },
    {
        "id": 370881,
        "code": 370881,
        "pid": 370800,
        "level": 2,
        "name": "曲阜市"
    },
    {
        "id": 370883,
        "code": 370883,
        "pid": 370800,
        "level": 2,
        "name": "邹城市"
    },
    {
        "id": 371500,
        "code": 371500,
        "pid": 370000,
        "level": 1,
        "name": "聊城市"
    },
    {
        "id": 371502,
        "code": 371502,
        "pid": 371500,
        "level": 2,
        "name": "东昌府区"
    },
    {
        "id": 371524,
        "code": 371524,
        "pid": 371500,
        "level": 2,
        "name": "东阿县"
    },
    {
        "id": 371525,
        "code": 371525,
        "pid": 371500,
        "level": 2,
        "name": "冠县"
    },
    {
        "id": 371526,
        "code": 371526,
        "pid": 371500,
        "level": 2,
        "name": "高唐县"
    },
    {
        "id": 371581,
        "code": 371581,
        "pid": 371500,
        "level": 2,
        "name": "临清市"
    },
    {
        "id": 371521,
        "code": 371521,
        "pid": 371500,
        "level": 2,
        "name": "阳谷县"
    },
    {
        "id": 371522,
        "code": 371522,
        "pid": 371500,
        "level": 2,
        "name": "莘县"
    },
    {
        "id": 371523,
        "code": 371523,
        "pid": 371500,
        "level": 2,
        "name": "茌平县"
    },
    {
        "id": 370300,
        "code": 370300,
        "pid": 370000,
        "level": 1,
        "name": "淄博市"
    },
    {
        "id": 370303,
        "code": 370303,
        "pid": 370300,
        "level": 2,
        "name": "张店区"
    },
    {
        "id": 370302,
        "code": 370302,
        "pid": 370300,
        "level": 2,
        "name": "淄川区"
    },
    {
        "id": 370306,
        "code": 370306,
        "pid": 370300,
        "level": 2,
        "name": "周村区"
    },
    {
        "id": 370305,
        "code": 370305,
        "pid": 370300,
        "level": 2,
        "name": "临淄区"
    },
    {
        "id": 370304,
        "code": 370304,
        "pid": 370300,
        "level": 2,
        "name": "博山区"
    },
    {
        "id": 370321,
        "code": 370321,
        "pid": 370300,
        "level": 2,
        "name": "桓台县"
    },
    {
        "id": 370323,
        "code": 370323,
        "pid": 370300,
        "level": 2,
        "name": "沂源县"
    },
    {
        "id": 370322,
        "code": 370322,
        "pid": 370300,
        "level": 2,
        "name": "高青县"
    },
    {
        "id": 371100,
        "code": 371100,
        "pid": 370000,
        "level": 1,
        "name": "日照市"
    },
    {
        "id": 371121,
        "code": 371121,
        "pid": 371100,
        "level": 2,
        "name": "五莲县"
    },
    {
        "id": 371122,
        "code": 371122,
        "pid": 371100,
        "level": 2,
        "name": "莒县"
    },
    {
        "id": 371102,
        "code": 371102,
        "pid": 371100,
        "level": 2,
        "name": "东港区"
    },
    {
        "id": 371103,
        "code": 371103,
        "pid": 371100,
        "level": 2,
        "name": "岚山区"
    },
    {
        "id": 370700,
        "code": 370700,
        "pid": 370000,
        "level": 1,
        "name": "潍坊市"
    },
    {
        "id": 370705,
        "code": 370705,
        "pid": 370700,
        "level": 2,
        "name": "奎文区"
    },
    {
        "id": 370704,
        "code": 370704,
        "pid": 370700,
        "level": 2,
        "name": "坊子区"
    },
    {
        "id": 370703,
        "code": 370703,
        "pid": 370700,
        "level": 2,
        "name": "寒亭区"
    },
    {
        "id": 370702,
        "code": 370702,
        "pid": 370700,
        "level": 2,
        "name": "潍城区"
    },
    {
        "id": 370786,
        "code": 370786,
        "pid": 370700,
        "level": 2,
        "name": "昌邑市"
    },
    {
        "id": 370785,
        "code": 370785,
        "pid": 370700,
        "level": 2,
        "name": "高密市"
    },
    {
        "id": 370784,
        "code": 370784,
        "pid": 370700,
        "level": 2,
        "name": "安丘市"
    },
    {
        "id": 370783,
        "code": 370783,
        "pid": 370700,
        "level": 2,
        "name": "寿光市"
    },
    {
        "id": 370782,
        "code": 370782,
        "pid": 370700,
        "level": 2,
        "name": "诸城市"
    },
    {
        "id": 370781,
        "code": 370781,
        "pid": 370700,
        "level": 2,
        "name": "青州市"
    },
    {
        "id": 370725,
        "code": 370725,
        "pid": 370700,
        "level": 2,
        "name": "昌乐县"
    },
    {
        "id": 370724,
        "code": 370724,
        "pid": 370700,
        "level": 2,
        "name": "临朐县"
    },
    {
        "id": 370900,
        "code": 370900,
        "pid": 370000,
        "level": 1,
        "name": "泰安市"
    },
    {
        "id": 370983,
        "code": 370983,
        "pid": 370900,
        "level": 2,
        "name": "肥城市"
    },
    {
        "id": 370982,
        "code": 370982,
        "pid": 370900,
        "level": 2,
        "name": "新泰市"
    },
    {
        "id": 370911,
        "code": 370911,
        "pid": 370900,
        "level": 2,
        "name": "岱岳区"
    },
    {
        "id": 370902,
        "code": 370902,
        "pid": 370900,
        "level": 2,
        "name": "泰山区"
    },
    {
        "id": 370923,
        "code": 370923,
        "pid": 370900,
        "level": 2,
        "name": "东平县"
    },
    {
        "id": 370921,
        "code": 370921,
        "pid": 370900,
        "level": 2,
        "name": "宁阳县"
    },
    {
        "id": 371400,
        "code": 371400,
        "pid": 370000,
        "level": 1,
        "name": "德州市"
    },
    {
        "id": 371423,
        "code": 371423,
        "pid": 371400,
        "level": 2,
        "name": "庆云县"
    },
    {
        "id": 371422,
        "code": 371422,
        "pid": 371400,
        "level": 2,
        "name": "宁津县"
    },
    {
        "id": 371425,
        "code": 371425,
        "pid": 371400,
        "level": 2,
        "name": "齐河县"
    },
    {
        "id": 371424,
        "code": 371424,
        "pid": 371400,
        "level": 2,
        "name": "临邑县"
    },
    {
        "id": 371427,
        "code": 371427,
        "pid": 371400,
        "level": 2,
        "name": "夏津县"
    },
    {
        "id": 371426,
        "code": 371426,
        "pid": 371400,
        "level": 2,
        "name": "平原县"
    },
    {
        "id": 371403,
        "code": 371403,
        "pid": 371400,
        "level": 2,
        "name": "陵城区"
    },
    {
        "id": 371402,
        "code": 371402,
        "pid": 371400,
        "level": 2,
        "name": "德城区"
    },
    {
        "id": 371482,
        "code": 371482,
        "pid": 371400,
        "level": 2,
        "name": "禹城市"
    },
    {
        "id": 371481,
        "code": 371481,
        "pid": 371400,
        "level": 2,
        "name": "乐陵市"
    },
    {
        "id": 371428,
        "code": 371428,
        "pid": 371400,
        "level": 2,
        "name": "武城县"
    },
    {
        "id": 370400,
        "code": 370400,
        "pid": 370000,
        "level": 1,
        "name": "枣庄市"
    },
    {
        "id": 370404,
        "code": 370404,
        "pid": 370400,
        "level": 2,
        "name": "峄城区"
    },
    {
        "id": 370405,
        "code": 370405,
        "pid": 370400,
        "level": 2,
        "name": "台儿庄区"
    },
    {
        "id": 370406,
        "code": 370406,
        "pid": 370400,
        "level": 2,
        "name": "山亭区"
    },
    {
        "id": 370402,
        "code": 370402,
        "pid": 370400,
        "level": 2,
        "name": "市中区"
    },
    {
        "id": 370403,
        "code": 370403,
        "pid": 370400,
        "level": 2,
        "name": "薛城区"
    },
    {
        "id": 370481,
        "code": 370481,
        "pid": 370400,
        "level": 2,
        "name": "滕州市"
    },
    {
        "id": 371000,
        "code": 371000,
        "pid": 370000,
        "level": 1,
        "name": "威海市"
    },
    {
        "id": 371083,
        "code": 371083,
        "pid": 371000,
        "level": 2,
        "name": "乳山市"
    },
    {
        "id": 371003,
        "code": 371003,
        "pid": 371000,
        "level": 2,
        "name": "文登区"
    },
    {
        "id": 371002,
        "code": 371002,
        "pid": 371000,
        "level": 2,
        "name": "环翠区"
    },
    {
        "id": 371082,
        "code": 371082,
        "pid": 371000,
        "level": 2,
        "name": "荣成市"
    },
    {
        "id": 371700,
        "code": 371700,
        "pid": 370000,
        "level": 1,
        "name": "菏泽市"
    },
    {
        "id": 371703,
        "code": 371703,
        "pid": 371700,
        "level": 2,
        "name": "定陶区"
    },
    {
        "id": 371702,
        "code": 371702,
        "pid": 371700,
        "level": 2,
        "name": "牡丹区"
    },
    {
        "id": 371726,
        "code": 371726,
        "pid": 371700,
        "level": 2,
        "name": "鄄城县"
    },
    {
        "id": 371724,
        "code": 371724,
        "pid": 371700,
        "level": 2,
        "name": "巨野县"
    },
    {
        "id": 371725,
        "code": 371725,
        "pid": 371700,
        "level": 2,
        "name": "郓城县"
    },
    {
        "id": 371722,
        "code": 371722,
        "pid": 371700,
        "level": 2,
        "name": "单县"
    },
    {
        "id": 371723,
        "code": 371723,
        "pid": 371700,
        "level": 2,
        "name": "成武县"
    },
    {
        "id": 371721,
        "code": 371721,
        "pid": 371700,
        "level": 2,
        "name": "曹县"
    },
    {
        "id": 371728,
        "code": 371728,
        "pid": 371700,
        "level": 2,
        "name": "东明县"
    },
    {
        "id": 370100,
        "code": 370100,
        "pid": 370000,
        "level": 1,
        "name": "济南市"
    },
    {
        "id": 370112,
        "code": 370112,
        "pid": 370100,
        "level": 2,
        "name": "历城区"
    },
    {
        "id": 370113,
        "code": 370113,
        "pid": 370100,
        "level": 2,
        "name": "长清区"
    },
    {
        "id": 370103,
        "code": 370103,
        "pid": 370100,
        "level": 2,
        "name": "市中区"
    },
    {
        "id": 370102,
        "code": 370102,
        "pid": 370100,
        "level": 2,
        "name": "历下区"
    },
    {
        "id": 370105,
        "code": 370105,
        "pid": 370100,
        "level": 2,
        "name": "天桥区"
    },
    {
        "id": 370104,
        "code": 370104,
        "pid": 370100,
        "level": 2,
        "name": "槐荫区"
    },
    {
        "id": 370181,
        "code": 370181,
        "pid": 370100,
        "level": 2,
        "name": "章丘市"
    },
    {
        "id": 370126,
        "code": 370126,
        "pid": 370100,
        "level": 2,
        "name": "商河县"
    },
    {
        "id": 370125,
        "code": 370125,
        "pid": 370100,
        "level": 2,
        "name": "济阳县"
    },
    {
        "id": 370124,
        "code": 370124,
        "pid": 370100,
        "level": 2,
        "name": "平阴县"
    },
    {
        "id": 371300,
        "code": 371300,
        "pid": 370000,
        "level": 1,
        "name": "临沂市"
    },
    {
        "id": 371328,
        "code": 371328,
        "pid": 371300,
        "level": 2,
        "name": "蒙阴县"
    },
    {
        "id": 371329,
        "code": 371329,
        "pid": 371300,
        "level": 2,
        "name": "临沭县"
    },
    {
        "id": 371322,
        "code": 371322,
        "pid": 371300,
        "level": 2,
        "name": "郯城县"
    },
    {
        "id": 371323,
        "code": 371323,
        "pid": 371300,
        "level": 2,
        "name": "沂水县"
    },
    {
        "id": 371321,
        "code": 371321,
        "pid": 371300,
        "level": 2,
        "name": "沂南县"
    },
    {
        "id": 371326,
        "code": 371326,
        "pid": 371300,
        "level": 2,
        "name": "平邑县"
    },
    {
        "id": 371327,
        "code": 371327,
        "pid": 371300,
        "level": 2,
        "name": "莒南县"
    },
    {
        "id": 371324,
        "code": 371324,
        "pid": 371300,
        "level": 2,
        "name": "兰陵县"
    },
    {
        "id": 371325,
        "code": 371325,
        "pid": 371300,
        "level": 2,
        "name": "费县"
    },
    {
        "id": 371312,
        "code": 371312,
        "pid": 371300,
        "level": 2,
        "name": "河东区"
    },
    {
        "id": 371311,
        "code": 371311,
        "pid": 371300,
        "level": 2,
        "name": "罗庄区"
    },
    {
        "id": 371302,
        "code": 371302,
        "pid": 371300,
        "level": 2,
        "name": "兰山区"
    },
    {
        "id": 370500,
        "code": 370500,
        "pid": 370000,
        "level": 1,
        "name": "东营市"
    },
    {
        "id": 370505,
        "code": 370505,
        "pid": 370500,
        "level": 2,
        "name": "垦利区"
    },
    {
        "id": 370523,
        "code": 370523,
        "pid": 370500,
        "level": 2,
        "name": "广饶县"
    },
    {
        "id": 370522,
        "code": 370522,
        "pid": 370500,
        "level": 2,
        "name": "利津县"
    },
    {
        "id": 370503,
        "code": 370503,
        "pid": 370500,
        "level": 2,
        "name": "河口区"
    },
    {
        "id": 370502,
        "code": 370502,
        "pid": 370500,
        "level": 2,
        "name": "东营区"
    },
    {
        "id": 371600,
        "code": 371600,
        "pid": 370000,
        "level": 1,
        "name": "滨州市"
    },
    {
        "id": 371623,
        "code": 371623,
        "pid": 371600,
        "level": 2,
        "name": "无棣县"
    },
    {
        "id": 371622,
        "code": 371622,
        "pid": 371600,
        "level": 2,
        "name": "阳信县"
    },
    {
        "id": 371621,
        "code": 371621,
        "pid": 371600,
        "level": 2,
        "name": "惠民县"
    },
    {
        "id": 371626,
        "code": 371626,
        "pid": 371600,
        "level": 2,
        "name": "邹平县"
    },
    {
        "id": 371625,
        "code": 371625,
        "pid": 371600,
        "level": 2,
        "name": "博兴县"
    },
    {
        "id": 371603,
        "code": 371603,
        "pid": 371600,
        "level": 2,
        "name": "沾化区"
    },
    {
        "id": 371602,
        "code": 371602,
        "pid": 371600,
        "level": 2,
        "name": "滨城区"
    },
    {
        "id": 370200,
        "code": 370200,
        "pid": 370000,
        "level": 1,
        "name": "青岛市"
    },
    {
        "id": 370202,
        "code": 370202,
        "pid": 370200,
        "level": 2,
        "name": "市南区"
    },
    {
        "id": 370282,
        "code": 370282,
        "pid": 370200,
        "level": 2,
        "name": "即墨市"
    },
    {
        "id": 370283,
        "code": 370283,
        "pid": 370200,
        "level": 2,
        "name": "平度市"
    },
    {
        "id": 370281,
        "code": 370281,
        "pid": 370200,
        "level": 2,
        "name": "胶州市"
    },
    {
        "id": 370285,
        "code": 370285,
        "pid": 370200,
        "level": 2,
        "name": "莱西市"
    },
    {
        "id": 370211,
        "code": 370211,
        "pid": 370200,
        "level": 2,
        "name": "黄岛区"
    },
    {
        "id": 370203,
        "code": 370203,
        "pid": 370200,
        "level": 2,
        "name": "市北区"
    },
    {
        "id": 370213,
        "code": 370213,
        "pid": 370200,
        "level": 2,
        "name": "李沧区"
    },
    {
        "id": 370212,
        "code": 370212,
        "pid": 370200,
        "level": 2,
        "name": "崂山区"
    },
    {
        "id": 370214,
        "code": 370214,
        "pid": 370200,
        "level": 2,
        "name": "城阳区"
    },
    {
        "id": 371200,
        "code": 371200,
        "pid": 370000,
        "level": 1,
        "name": "莱芜市"
    },
    {
        "id": 371203,
        "code": 371203,
        "pid": 371200,
        "level": 2,
        "name": "钢城区"
    },
    {
        "id": 371202,
        "code": 371202,
        "pid": 371200,
        "level": 2,
        "name": "莱城区"
    },
    {
        "id": 370600,
        "code": 370600,
        "pid": 370000,
        "level": 1,
        "name": "烟台市"
    },
    {
        "id": 370686,
        "code": 370686,
        "pid": 370600,
        "level": 2,
        "name": "栖霞市"
    },
    {
        "id": 370687,
        "code": 370687,
        "pid": 370600,
        "level": 2,
        "name": "海阳市"
    },
    {
        "id": 370684,
        "code": 370684,
        "pid": 370600,
        "level": 2,
        "name": "蓬莱市"
    },
    {
        "id": 370685,
        "code": 370685,
        "pid": 370600,
        "level": 2,
        "name": "招远市"
    },
    {
        "id": 370682,
        "code": 370682,
        "pid": 370600,
        "level": 2,
        "name": "莱阳市"
    },
    {
        "id": 370683,
        "code": 370683,
        "pid": 370600,
        "level": 2,
        "name": "莱州市"
    },
    {
        "id": 370681,
        "code": 370681,
        "pid": 370600,
        "level": 2,
        "name": "龙口市"
    },
    {
        "id": 370602,
        "code": 370602,
        "pid": 370600,
        "level": 2,
        "name": "芝罘区"
    },
    {
        "id": 370634,
        "code": 370634,
        "pid": 370600,
        "level": 2,
        "name": "长岛县"
    },
    {
        "id": 370611,
        "code": 370611,
        "pid": 370600,
        "level": 2,
        "name": "福山区"
    },
    {
        "id": 370613,
        "code": 370613,
        "pid": 370600,
        "level": 2,
        "name": "莱山区"
    },
    {
        "id": 370612,
        "code": 370612,
        "pid": 370600,
        "level": 2,
        "name": "牟平区"
    },
    {
        "id": 330000,
        "code": 330000,
        "pid": 0,
        "level": 0,
        "name": "浙江省"
    },
    {
        "id": 330700,
        "code": 330700,
        "pid": 330000,
        "level": 1,
        "name": "金华市"
    },
    {
        "id": 330703,
        "code": 330703,
        "pid": 330700,
        "level": 2,
        "name": "金东区"
    },
    {
        "id": 330702,
        "code": 330702,
        "pid": 330700,
        "level": 2,
        "name": "婺城区"
    },
    {
        "id": 330783,
        "code": 330783,
        "pid": 330700,
        "level": 2,
        "name": "东阳市"
    },
    {
        "id": 330782,
        "code": 330782,
        "pid": 330700,
        "level": 2,
        "name": "义乌市"
    },
    {
        "id": 330723,
        "code": 330723,
        "pid": 330700,
        "level": 2,
        "name": "武义县"
    },
    {
        "id": 330784,
        "code": 330784,
        "pid": 330700,
        "level": 2,
        "name": "永康市"
    },
    {
        "id": 330781,
        "code": 330781,
        "pid": 330700,
        "level": 2,
        "name": "兰溪市"
    },
    {
        "id": 330727,
        "code": 330727,
        "pid": 330700,
        "level": 2,
        "name": "磐安县"
    },
    {
        "id": 330726,
        "code": 330726,
        "pid": 330700,
        "level": 2,
        "name": "浦江县"
    },
    {
        "id": 330800,
        "code": 330800,
        "pid": 330000,
        "level": 1,
        "name": "衢州市"
    },
    {
        "id": 330802,
        "code": 330802,
        "pid": 330800,
        "level": 2,
        "name": "柯城区"
    },
    {
        "id": 330803,
        "code": 330803,
        "pid": 330800,
        "level": 2,
        "name": "衢江区"
    },
    {
        "id": 330822,
        "code": 330822,
        "pid": 330800,
        "level": 2,
        "name": "常山县"
    },
    {
        "id": 330881,
        "code": 330881,
        "pid": 330800,
        "level": 2,
        "name": "江山市"
    },
    {
        "id": 330824,
        "code": 330824,
        "pid": 330800,
        "level": 2,
        "name": "开化县"
    },
    {
        "id": 330825,
        "code": 330825,
        "pid": 330800,
        "level": 2,
        "name": "龙游县"
    },
    {
        "id": 330300,
        "code": 330300,
        "pid": 330000,
        "level": 1,
        "name": "温州市"
    },
    {
        "id": 330305,
        "code": 330305,
        "pid": 330300,
        "level": 2,
        "name": "洞头区"
    },
    {
        "id": 330304,
        "code": 330304,
        "pid": 330300,
        "level": 2,
        "name": "瓯海区"
    },
    {
        "id": 330303,
        "code": 330303,
        "pid": 330300,
        "level": 2,
        "name": "龙湾区"
    },
    {
        "id": 330302,
        "code": 330302,
        "pid": 330300,
        "level": 2,
        "name": "鹿城区"
    },
    {
        "id": 330382,
        "code": 330382,
        "pid": 330300,
        "level": 2,
        "name": "乐清市"
    },
    {
        "id": 330381,
        "code": 330381,
        "pid": 330300,
        "level": 2,
        "name": "瑞安市"
    },
    {
        "id": 330329,
        "code": 330329,
        "pid": 330300,
        "level": 2,
        "name": "泰顺县"
    },
    {
        "id": 330328,
        "code": 330328,
        "pid": 330300,
        "level": 2,
        "name": "文成县"
    },
    {
        "id": 330324,
        "code": 330324,
        "pid": 330300,
        "level": 2,
        "name": "永嘉县"
    },
    {
        "id": 330327,
        "code": 330327,
        "pid": 330300,
        "level": 2,
        "name": "苍南县"
    },
    {
        "id": 330326,
        "code": 330326,
        "pid": 330300,
        "level": 2,
        "name": "平阳县"
    },
    {
        "id": 330400,
        "code": 330400,
        "pid": 330000,
        "level": 1,
        "name": "嘉兴市"
    },
    {
        "id": 330402,
        "code": 330402,
        "pid": 330400,
        "level": 2,
        "name": "南湖区"
    },
    {
        "id": 330421,
        "code": 330421,
        "pid": 330400,
        "level": 2,
        "name": "嘉善县"
    },
    {
        "id": 330481,
        "code": 330481,
        "pid": 330400,
        "level": 2,
        "name": "海宁市"
    },
    {
        "id": 330482,
        "code": 330482,
        "pid": 330400,
        "level": 2,
        "name": "平湖市"
    },
    {
        "id": 330483,
        "code": 330483,
        "pid": 330400,
        "level": 2,
        "name": "桐乡市"
    },
    {
        "id": 330411,
        "code": 330411,
        "pid": 330400,
        "level": 2,
        "name": "秀洲区"
    },
    {
        "id": 330424,
        "code": 330424,
        "pid": 330400,
        "level": 2,
        "name": "海盐县"
    },
    {
        "id": 330900,
        "code": 330900,
        "pid": 330000,
        "level": 1,
        "name": "舟山市"
    },
    {
        "id": 330903,
        "code": 330903,
        "pid": 330900,
        "level": 2,
        "name": "普陀区"
    },
    {
        "id": 330922,
        "code": 330922,
        "pid": 330900,
        "level": 2,
        "name": "嵊泗县"
    },
    {
        "id": 330921,
        "code": 330921,
        "pid": 330900,
        "level": 2,
        "name": "岱山县"
    },
    {
        "id": 330902,
        "code": 330902,
        "pid": 330900,
        "level": 2,
        "name": "定海区"
    },
    {
        "id": 330500,
        "code": 330500,
        "pid": 330000,
        "level": 1,
        "name": "湖州市"
    },
    {
        "id": 330523,
        "code": 330523,
        "pid": 330500,
        "level": 2,
        "name": "安吉县"
    },
    {
        "id": 330522,
        "code": 330522,
        "pid": 330500,
        "level": 2,
        "name": "长兴县"
    },
    {
        "id": 330521,
        "code": 330521,
        "pid": 330500,
        "level": 2,
        "name": "德清县"
    },
    {
        "id": 330502,
        "code": 330502,
        "pid": 330500,
        "level": 2,
        "name": "吴兴区"
    },
    {
        "id": 330503,
        "code": 330503,
        "pid": 330500,
        "level": 2,
        "name": "南浔区"
    },
    {
        "id": 331000,
        "code": 331000,
        "pid": 330000,
        "level": 1,
        "name": "台州市"
    },
    {
        "id": 331003,
        "code": 331003,
        "pid": 331000,
        "level": 2,
        "name": "黄岩区"
    },
    {
        "id": 331002,
        "code": 331002,
        "pid": 331000,
        "level": 2,
        "name": "椒江区"
    },
    {
        "id": 331004,
        "code": 331004,
        "pid": 331000,
        "level": 2,
        "name": "路桥区"
    },
    {
        "id": 331024,
        "code": 331024,
        "pid": 331000,
        "level": 2,
        "name": "仙居县"
    },
    {
        "id": 331021,
        "code": 331021,
        "pid": 331000,
        "level": 2,
        "name": "玉环县"
    },
    {
        "id": 331082,
        "code": 331082,
        "pid": 331000,
        "level": 2,
        "name": "临海市"
    },
    {
        "id": 331081,
        "code": 331081,
        "pid": 331000,
        "level": 2,
        "name": "温岭市"
    },
    {
        "id": 331022,
        "code": 331022,
        "pid": 331000,
        "level": 2,
        "name": "三门县"
    },
    {
        "id": 331023,
        "code": 331023,
        "pid": 331000,
        "level": 2,
        "name": "天台县"
    },
    {
        "id": 330100,
        "code": 330100,
        "pid": 330000,
        "level": 1,
        "name": "杭州市"
    },
    {
        "id": 330110,
        "code": 330110,
        "pid": 330100,
        "level": 2,
        "name": "余杭区"
    },
    {
        "id": 330185,
        "code": 330185,
        "pid": 330100,
        "level": 2,
        "name": "临安市"
    },
    {
        "id": 330111,
        "code": 330111,
        "pid": 330100,
        "level": 2,
        "name": "富阳区"
    },
    {
        "id": 330108,
        "code": 330108,
        "pid": 330100,
        "level": 2,
        "name": "滨江区"
    },
    {
        "id": 330182,
        "code": 330182,
        "pid": 330100,
        "level": 2,
        "name": "建德市"
    },
    {
        "id": 330105,
        "code": 330105,
        "pid": 330100,
        "level": 2,
        "name": "拱墅区"
    },
    {
        "id": 330104,
        "code": 330104,
        "pid": 330100,
        "level": 2,
        "name": "江干区"
    },
    {
        "id": 330106,
        "code": 330106,
        "pid": 330100,
        "level": 2,
        "name": "西湖区"
    },
    {
        "id": 330103,
        "code": 330103,
        "pid": 330100,
        "level": 2,
        "name": "下城区"
    },
    {
        "id": 330102,
        "code": 330102,
        "pid": 330100,
        "level": 2,
        "name": "上城区"
    },
    {
        "id": 330127,
        "code": 330127,
        "pid": 330100,
        "level": 2,
        "name": "淳安县"
    },
    {
        "id": 330109,
        "code": 330109,
        "pid": 330100,
        "level": 2,
        "name": "萧山区"
    },
    {
        "id": 330122,
        "code": 330122,
        "pid": 330100,
        "level": 2,
        "name": "桐庐县"
    },
    {
        "id": 330600,
        "code": 330600,
        "pid": 330000,
        "level": 1,
        "name": "绍兴市"
    },
    {
        "id": 330624,
        "code": 330624,
        "pid": 330600,
        "level": 2,
        "name": "新昌县"
    },
    {
        "id": 330683,
        "code": 330683,
        "pid": 330600,
        "level": 2,
        "name": "嵊州市"
    },
    {
        "id": 330681,
        "code": 330681,
        "pid": 330600,
        "level": 2,
        "name": "诸暨市"
    },
    {
        "id": 330602,
        "code": 330602,
        "pid": 330600,
        "level": 2,
        "name": "越城区"
    },
    {
        "id": 330603,
        "code": 330603,
        "pid": 330600,
        "level": 2,
        "name": "柯桥区"
    },
    {
        "id": 330604,
        "code": 330604,
        "pid": 330600,
        "level": 2,
        "name": "上虞区"
    },
    {
        "id": 331100,
        "code": 331100,
        "pid": 330000,
        "level": 1,
        "name": "丽水市"
    },
    {
        "id": 331124,
        "code": 331124,
        "pid": 331100,
        "level": 2,
        "name": "松阳县"
    },
    {
        "id": 331125,
        "code": 331125,
        "pid": 331100,
        "level": 2,
        "name": "云和县"
    },
    {
        "id": 331126,
        "code": 331126,
        "pid": 331100,
        "level": 2,
        "name": "庆元县"
    },
    {
        "id": 331127,
        "code": 331127,
        "pid": 331100,
        "level": 2,
        "name": "景宁畲族自治县"
    },
    {
        "id": 331121,
        "code": 331121,
        "pid": 331100,
        "level": 2,
        "name": "青田县"
    },
    {
        "id": 331122,
        "code": 331122,
        "pid": 331100,
        "level": 2,
        "name": "缙云县"
    },
    {
        "id": 331123,
        "code": 331123,
        "pid": 331100,
        "level": 2,
        "name": "遂昌县"
    },
    {
        "id": 331181,
        "code": 331181,
        "pid": 331100,
        "level": 2,
        "name": "龙泉市"
    },
    {
        "id": 331102,
        "code": 331102,
        "pid": 331100,
        "level": 2,
        "name": "莲都区"
    },
    {
        "id": 330200,
        "code": 330200,
        "pid": 330000,
        "level": 1,
        "name": "宁波市"
    },
    {
        "id": 330282,
        "code": 330282,
        "pid": 330200,
        "level": 2,
        "name": "慈溪市"
    },
    {
        "id": 330283,
        "code": 330283,
        "pid": 330200,
        "level": 2,
        "name": "奉化市"
    },
    {
        "id": 330281,
        "code": 330281,
        "pid": 330200,
        "level": 2,
        "name": "余姚市"
    },
    {
        "id": 330203,
        "code": 330203,
        "pid": 330200,
        "level": 2,
        "name": "海曙区"
    },
    {
        "id": 330206,
        "code": 330206,
        "pid": 330200,
        "level": 2,
        "name": "北仑区"
    },
    {
        "id": 330204,
        "code": 330204,
        "pid": 330200,
        "level": 2,
        "name": "江东区"
    },
    {
        "id": 330205,
        "code": 330205,
        "pid": 330200,
        "level": 2,
        "name": "江北区"
    },
    {
        "id": 330211,
        "code": 330211,
        "pid": 330200,
        "level": 2,
        "name": "镇海区"
    },
    {
        "id": 330225,
        "code": 330225,
        "pid": 330200,
        "level": 2,
        "name": "象山县"
    },
    {
        "id": 330226,
        "code": 330226,
        "pid": 330200,
        "level": 2,
        "name": "宁海县"
    },
    {
        "id": 330212,
        "code": 330212,
        "pid": 330200,
        "level": 2,
        "name": "鄞州区"
    },
    {
        "id": 350000,
        "code": 350000,
        "pid": 0,
        "level": 0,
        "name": "福建省"
    },
    {
        "id": 350300,
        "code": 350300,
        "pid": 350000,
        "level": 1,
        "name": "莆田市"
    },
    {
        "id": 350322,
        "code": 350322,
        "pid": 350300,
        "level": 2,
        "name": "仙游县"
    },
    {
        "id": 350303,
        "code": 350303,
        "pid": 350300,
        "level": 2,
        "name": "涵江区"
    },
    {
        "id": 350302,
        "code": 350302,
        "pid": 350300,
        "level": 2,
        "name": "城厢区"
    },
    {
        "id": 350305,
        "code": 350305,
        "pid": 350300,
        "level": 2,
        "name": "秀屿区"
    },
    {
        "id": 350304,
        "code": 350304,
        "pid": 350300,
        "level": 2,
        "name": "荔城区"
    },
    {
        "id": 350800,
        "code": 350800,
        "pid": 350000,
        "level": 1,
        "name": "龙岩市"
    },
    {
        "id": 350802,
        "code": 350802,
        "pid": 350800,
        "level": 2,
        "name": "新罗区"
    },
    {
        "id": 350803,
        "code": 350803,
        "pid": 350800,
        "level": 2,
        "name": "永定区"
    },
    {
        "id": 350824,
        "code": 350824,
        "pid": 350800,
        "level": 2,
        "name": "武平县"
    },
    {
        "id": 350825,
        "code": 350825,
        "pid": 350800,
        "level": 2,
        "name": "连城县"
    },
    {
        "id": 350881,
        "code": 350881,
        "pid": 350800,
        "level": 2,
        "name": "漳平市"
    },
    {
        "id": 350821,
        "code": 350821,
        "pid": 350800,
        "level": 2,
        "name": "长汀县"
    },
    {
        "id": 350823,
        "code": 350823,
        "pid": 350800,
        "level": 2,
        "name": "上杭县"
    },
    {
        "id": 350700,
        "code": 350700,
        "pid": 350000,
        "level": 1,
        "name": "南平市"
    },
    {
        "id": 350703,
        "code": 350703,
        "pid": 350700,
        "level": 2,
        "name": "建阳区"
    },
    {
        "id": 350702,
        "code": 350702,
        "pid": 350700,
        "level": 2,
        "name": "延平区"
    },
    {
        "id": 350725,
        "code": 350725,
        "pid": 350700,
        "level": 2,
        "name": "政和县"
    },
    {
        "id": 350724,
        "code": 350724,
        "pid": 350700,
        "level": 2,
        "name": "松溪县"
    },
    {
        "id": 350723,
        "code": 350723,
        "pid": 350700,
        "level": 2,
        "name": "光泽县"
    },
    {
        "id": 350722,
        "code": 350722,
        "pid": 350700,
        "level": 2,
        "name": "浦城县"
    },
    {
        "id": 350721,
        "code": 350721,
        "pid": 350700,
        "level": 2,
        "name": "顺昌县"
    },
    {
        "id": 350781,
        "code": 350781,
        "pid": 350700,
        "level": 2,
        "name": "邵武市"
    },
    {
        "id": 350783,
        "code": 350783,
        "pid": 350700,
        "level": 2,
        "name": "建瓯市"
    },
    {
        "id": 350782,
        "code": 350782,
        "pid": 350700,
        "level": 2,
        "name": "武夷山市"
    },
    {
        "id": 350900,
        "code": 350900,
        "pid": 350000,
        "level": 1,
        "name": "宁德市"
    },
    {
        "id": 350921,
        "code": 350921,
        "pid": 350900,
        "level": 2,
        "name": "霞浦县"
    },
    {
        "id": 350923,
        "code": 350923,
        "pid": 350900,
        "level": 2,
        "name": "屏南县"
    },
    {
        "id": 350922,
        "code": 350922,
        "pid": 350900,
        "level": 2,
        "name": "古田县"
    },
    {
        "id": 350925,
        "code": 350925,
        "pid": 350900,
        "level": 2,
        "name": "周宁县"
    },
    {
        "id": 350924,
        "code": 350924,
        "pid": 350900,
        "level": 2,
        "name": "寿宁县"
    },
    {
        "id": 350926,
        "code": 350926,
        "pid": 350900,
        "level": 2,
        "name": "柘荣县"
    },
    {
        "id": 350902,
        "code": 350902,
        "pid": 350900,
        "level": 2,
        "name": "蕉城区"
    },
    {
        "id": 350982,
        "code": 350982,
        "pid": 350900,
        "level": 2,
        "name": "福鼎市"
    },
    {
        "id": 350981,
        "code": 350981,
        "pid": 350900,
        "level": 2,
        "name": "福安市"
    },
    {
        "id": 350400,
        "code": 350400,
        "pid": 350000,
        "level": 1,
        "name": "三明市"
    },
    {
        "id": 350428,
        "code": 350428,
        "pid": 350400,
        "level": 2,
        "name": "将乐县"
    },
    {
        "id": 350429,
        "code": 350429,
        "pid": 350400,
        "level": 2,
        "name": "泰宁县"
    },
    {
        "id": 350421,
        "code": 350421,
        "pid": 350400,
        "level": 2,
        "name": "明溪县"
    },
    {
        "id": 350423,
        "code": 350423,
        "pid": 350400,
        "level": 2,
        "name": "清流县"
    },
    {
        "id": 350402,
        "code": 350402,
        "pid": 350400,
        "level": 2,
        "name": "梅列区"
    },
    {
        "id": 350403,
        "code": 350403,
        "pid": 350400,
        "level": 2,
        "name": "三元区"
    },
    {
        "id": 350426,
        "code": 350426,
        "pid": 350400,
        "level": 2,
        "name": "尤溪县"
    },
    {
        "id": 350425,
        "code": 350425,
        "pid": 350400,
        "level": 2,
        "name": "大田县"
    },
    {
        "id": 350481,
        "code": 350481,
        "pid": 350400,
        "level": 2,
        "name": "永安市"
    },
    {
        "id": 350430,
        "code": 350430,
        "pid": 350400,
        "level": 2,
        "name": "建宁县"
    },
    {
        "id": 350427,
        "code": 350427,
        "pid": 350400,
        "level": 2,
        "name": "沙县"
    },
    {
        "id": 350424,
        "code": 350424,
        "pid": 350400,
        "level": 2,
        "name": "宁化县"
    },
    {
        "id": 350100,
        "code": 350100,
        "pid": 350000,
        "level": 1,
        "name": "福州市"
    },
    {
        "id": 350128,
        "code": 350128,
        "pid": 350100,
        "level": 2,
        "name": "平潭县"
    },
    {
        "id": 350121,
        "code": 350121,
        "pid": 350100,
        "level": 2,
        "name": "闽侯县"
    },
    {
        "id": 350182,
        "code": 350182,
        "pid": 350100,
        "level": 2,
        "name": "长乐市"
    },
    {
        "id": 350181,
        "code": 350181,
        "pid": 350100,
        "level": 2,
        "name": "福清市"
    },
    {
        "id": 350122,
        "code": 350122,
        "pid": 350100,
        "level": 2,
        "name": "连江县"
    },
    {
        "id": 350125,
        "code": 350125,
        "pid": 350100,
        "level": 2,
        "name": "永泰县"
    },
    {
        "id": 350124,
        "code": 350124,
        "pid": 350100,
        "level": 2,
        "name": "闽清县"
    },
    {
        "id": 350103,
        "code": 350103,
        "pid": 350100,
        "level": 2,
        "name": "台江区"
    },
    {
        "id": 350102,
        "code": 350102,
        "pid": 350100,
        "level": 2,
        "name": "鼓楼区"
    },
    {
        "id": 350111,
        "code": 350111,
        "pid": 350100,
        "level": 2,
        "name": "晋安区"
    },
    {
        "id": 350105,
        "code": 350105,
        "pid": 350100,
        "level": 2,
        "name": "马尾区"
    },
    {
        "id": 350104,
        "code": 350104,
        "pid": 350100,
        "level": 2,
        "name": "仓山区"
    },
    {
        "id": 350123,
        "code": 350123,
        "pid": 350100,
        "level": 2,
        "name": "罗源县"
    },
    {
        "id": 350500,
        "code": 350500,
        "pid": 350000,
        "level": 1,
        "name": "泉州市"
    },
    {
        "id": 350525,
        "code": 350525,
        "pid": 350500,
        "level": 2,
        "name": "永春县"
    },
    {
        "id": 350524,
        "code": 350524,
        "pid": 350500,
        "level": 2,
        "name": "安溪县"
    },
    {
        "id": 350527,
        "code": 350527,
        "pid": 350500,
        "level": 2,
        "name": "金门县"
    },
    {
        "id": 350526,
        "code": 350526,
        "pid": 350500,
        "level": 2,
        "name": "德化县"
    },
    {
        "id": 350521,
        "code": 350521,
        "pid": 350500,
        "level": 2,
        "name": "惠安县"
    },
    {
        "id": 350505,
        "code": 350505,
        "pid": 350500,
        "level": 2,
        "name": "泉港区"
    },
    {
        "id": 350504,
        "code": 350504,
        "pid": 350500,
        "level": 2,
        "name": "洛江区"
    },
    {
        "id": 350503,
        "code": 350503,
        "pid": 350500,
        "level": 2,
        "name": "丰泽区"
    },
    {
        "id": 350502,
        "code": 350502,
        "pid": 350500,
        "level": 2,
        "name": "鲤城区"
    },
    {
        "id": 350583,
        "code": 350583,
        "pid": 350500,
        "level": 2,
        "name": "南安市"
    },
    {
        "id": 350582,
        "code": 350582,
        "pid": 350500,
        "level": 2,
        "name": "晋江市"
    },
    {
        "id": 350581,
        "code": 350581,
        "pid": 350500,
        "level": 2,
        "name": "石狮市"
    },
    {
        "id": 350200,
        "code": 350200,
        "pid": 350000,
        "level": 1,
        "name": "厦门市"
    },
    {
        "id": 350213,
        "code": 350213,
        "pid": 350200,
        "level": 2,
        "name": "翔安区"
    },
    {
        "id": 350212,
        "code": 350212,
        "pid": 350200,
        "level": 2,
        "name": "同安区"
    },
    {
        "id": 350211,
        "code": 350211,
        "pid": 350200,
        "level": 2,
        "name": "集美区"
    },
    {
        "id": 350203,
        "code": 350203,
        "pid": 350200,
        "level": 2,
        "name": "思明区"
    },
    {
        "id": 350205,
        "code": 350205,
        "pid": 350200,
        "level": 2,
        "name": "海沧区"
    },
    {
        "id": 350206,
        "code": 350206,
        "pid": 350200,
        "level": 2,
        "name": "湖里区"
    },
    {
        "id": 350600,
        "code": 350600,
        "pid": 350000,
        "level": 1,
        "name": "漳州市"
    },
    {
        "id": 350681,
        "code": 350681,
        "pid": 350600,
        "level": 2,
        "name": "龙海市"
    },
    {
        "id": 350622,
        "code": 350622,
        "pid": 350600,
        "level": 2,
        "name": "云霄县"
    },
    {
        "id": 350623,
        "code": 350623,
        "pid": 350600,
        "level": 2,
        "name": "漳浦县"
    },
    {
        "id": 350626,
        "code": 350626,
        "pid": 350600,
        "level": 2,
        "name": "东山县"
    },
    {
        "id": 350627,
        "code": 350627,
        "pid": 350600,
        "level": 2,
        "name": "南靖县"
    },
    {
        "id": 350624,
        "code": 350624,
        "pid": 350600,
        "level": 2,
        "name": "诏安县"
    },
    {
        "id": 350625,
        "code": 350625,
        "pid": 350600,
        "level": 2,
        "name": "长泰县"
    },
    {
        "id": 350628,
        "code": 350628,
        "pid": 350600,
        "level": 2,
        "name": "平和县"
    },
    {
        "id": 350629,
        "code": 350629,
        "pid": 350600,
        "level": 2,
        "name": "华安县"
    },
    {
        "id": 350602,
        "code": 350602,
        "pid": 350600,
        "level": 2,
        "name": "芗城区"
    },
    {
        "id": 350603,
        "code": 350603,
        "pid": 350600,
        "level": 2,
        "name": "龙文区"
    },
    {
        "id": 210000,
        "code": 210000,
        "pid": 0,
        "level": 0,
        "name": "辽宁省"
    },
    {
        "id": 210900,
        "code": 210900,
        "pid": 210000,
        "level": 1,
        "name": "阜新市"
    },
    {
        "id": 210902,
        "code": 210902,
        "pid": 210900,
        "level": 2,
        "name": "海州区"
    },
    {
        "id": 210903,
        "code": 210903,
        "pid": 210900,
        "level": 2,
        "name": "新邱区"
    },
    {
        "id": 210904,
        "code": 210904,
        "pid": 210900,
        "level": 2,
        "name": "太平区"
    },
    {
        "id": 210905,
        "code": 210905,
        "pid": 210900,
        "level": 2,
        "name": "清河门区"
    },
    {
        "id": 210921,
        "code": 210921,
        "pid": 210900,
        "level": 2,
        "name": "阜新蒙古族自治县"
    },
    {
        "id": 210911,
        "code": 210911,
        "pid": 210900,
        "level": 2,
        "name": "细河区"
    },
    {
        "id": 210922,
        "code": 210922,
        "pid": 210900,
        "level": 2,
        "name": "彰武县"
    },
    {
        "id": 211100,
        "code": 211100,
        "pid": 210000,
        "level": 1,
        "name": "盘锦市"
    },
    {
        "id": 211103,
        "code": 211103,
        "pid": 211100,
        "level": 2,
        "name": "兴隆台区"
    },
    {
        "id": 211102,
        "code": 211102,
        "pid": 211100,
        "level": 2,
        "name": "双台子区"
    },
    {
        "id": 211122,
        "code": 211122,
        "pid": 211100,
        "level": 2,
        "name": "盘山县"
    },
    {
        "id": 211104,
        "code": 211104,
        "pid": 211100,
        "level": 2,
        "name": "大洼区"
    },
    {
        "id": 210100,
        "code": 210100,
        "pid": 210000,
        "level": 1,
        "name": "沈阳市"
    },
    {
        "id": 210124,
        "code": 210124,
        "pid": 210100,
        "level": 2,
        "name": "法库县"
    },
    {
        "id": 210103,
        "code": 210103,
        "pid": 210100,
        "level": 2,
        "name": "沈河区"
    },
    {
        "id": 210104,
        "code": 210104,
        "pid": 210100,
        "level": 2,
        "name": "大东区"
    },
    {
        "id": 210123,
        "code": 210123,
        "pid": 210100,
        "level": 2,
        "name": "康平县"
    },
    {
        "id": 210106,
        "code": 210106,
        "pid": 210100,
        "level": 2,
        "name": "铁西区"
    },
    {
        "id": 210105,
        "code": 210105,
        "pid": 210100,
        "level": 2,
        "name": "皇姑区"
    },
    {
        "id": 210181,
        "code": 210181,
        "pid": 210100,
        "level": 2,
        "name": "新民市"
    },
    {
        "id": 210115,
        "code": 210115,
        "pid": 210100,
        "level": 2,
        "name": "辽中区"
    },
    {
        "id": 210114,
        "code": 210114,
        "pid": 210100,
        "level": 2,
        "name": "于洪区"
    },
    {
        "id": 210113,
        "code": 210113,
        "pid": 210100,
        "level": 2,
        "name": "沈北新区"
    },
    {
        "id": 210112,
        "code": 210112,
        "pid": 210100,
        "level": 2,
        "name": "浑南区"
    },
    {
        "id": 210111,
        "code": 210111,
        "pid": 210100,
        "level": 2,
        "name": "苏家屯区"
    },
    {
        "id": 210102,
        "code": 210102,
        "pid": 210100,
        "level": 2,
        "name": "和平区"
    },
    {
        "id": 210600,
        "code": 210600,
        "pid": 210000,
        "level": 1,
        "name": "丹东市"
    },
    {
        "id": 210604,
        "code": 210604,
        "pid": 210600,
        "level": 2,
        "name": "振安区"
    },
    {
        "id": 210603,
        "code": 210603,
        "pid": 210600,
        "level": 2,
        "name": "振兴区"
    },
    {
        "id": 210602,
        "code": 210602,
        "pid": 210600,
        "level": 2,
        "name": "元宝区"
    },
    {
        "id": 210682,
        "code": 210682,
        "pid": 210600,
        "level": 2,
        "name": "凤城市"
    },
    {
        "id": 210681,
        "code": 210681,
        "pid": 210600,
        "level": 2,
        "name": "东港市"
    },
    {
        "id": 210624,
        "code": 210624,
        "pid": 210600,
        "level": 2,
        "name": "宽甸满族自治县"
    },
    {
        "id": 211200,
        "code": 211200,
        "pid": 210000,
        "level": 1,
        "name": "铁岭市"
    },
    {
        "id": 211202,
        "code": 211202,
        "pid": 211200,
        "level": 2,
        "name": "银州区"
    },
    {
        "id": 211204,
        "code": 211204,
        "pid": 211200,
        "level": 2,
        "name": "清河区"
    },
    {
        "id": 211223,
        "code": 211223,
        "pid": 211200,
        "level": 2,
        "name": "西丰县"
    },
    {
        "id": 211221,
        "code": 211221,
        "pid": 211200,
        "level": 2,
        "name": "铁岭县"
    },
    {
        "id": 211281,
        "code": 211281,
        "pid": 211200,
        "level": 2,
        "name": "调兵山市"
    },
    {
        "id": 211282,
        "code": 211282,
        "pid": 211200,
        "level": 2,
        "name": "开原市"
    },
    {
        "id": 211224,
        "code": 211224,
        "pid": 211200,
        "level": 2,
        "name": "昌图县"
    },
    {
        "id": 210800,
        "code": 210800,
        "pid": 210000,
        "level": 1,
        "name": "营口市"
    },
    {
        "id": 210881,
        "code": 210881,
        "pid": 210800,
        "level": 2,
        "name": "盖州市"
    },
    {
        "id": 210882,
        "code": 210882,
        "pid": 210800,
        "level": 2,
        "name": "大石桥市"
    },
    {
        "id": 210803,
        "code": 210803,
        "pid": 210800,
        "level": 2,
        "name": "西市区"
    },
    {
        "id": 210802,
        "code": 210802,
        "pid": 210800,
        "level": 2,
        "name": "站前区"
    },
    {
        "id": 210804,
        "code": 210804,
        "pid": 210800,
        "level": 2,
        "name": "鲅鱼圈区"
    },
    {
        "id": 210811,
        "code": 210811,
        "pid": 210800,
        "level": 2,
        "name": "老边区"
    },
    {
        "id": 210500,
        "code": 210500,
        "pid": 210000,
        "level": 1,
        "name": "本溪市"
    },
    {
        "id": 210522,
        "code": 210522,
        "pid": 210500,
        "level": 2,
        "name": "桓仁满族自治县"
    },
    {
        "id": 210521,
        "code": 210521,
        "pid": 210500,
        "level": 2,
        "name": "本溪满族自治县"
    },
    {
        "id": 210504,
        "code": 210504,
        "pid": 210500,
        "level": 2,
        "name": "明山区"
    },
    {
        "id": 210505,
        "code": 210505,
        "pid": 210500,
        "level": 2,
        "name": "南芬区"
    },
    {
        "id": 210502,
        "code": 210502,
        "pid": 210500,
        "level": 2,
        "name": "平山区"
    },
    {
        "id": 210503,
        "code": 210503,
        "pid": 210500,
        "level": 2,
        "name": "溪湖区"
    },
    {
        "id": 211300,
        "code": 211300,
        "pid": 210000,
        "level": 1,
        "name": "朝阳市"
    },
    {
        "id": 211303,
        "code": 211303,
        "pid": 211300,
        "level": 2,
        "name": "龙城区"
    },
    {
        "id": 211302,
        "code": 211302,
        "pid": 211300,
        "level": 2,
        "name": "双塔区"
    },
    {
        "id": 211381,
        "code": 211381,
        "pid": 211300,
        "level": 2,
        "name": "北票市"
    },
    {
        "id": 211322,
        "code": 211322,
        "pid": 211300,
        "level": 2,
        "name": "建平县"
    },
    {
        "id": 211321,
        "code": 211321,
        "pid": 211300,
        "level": 2,
        "name": "朝阳县"
    },
    {
        "id": 211382,
        "code": 211382,
        "pid": 211300,
        "level": 2,
        "name": "凌源市"
    },
    {
        "id": 211324,
        "code": 211324,
        "pid": 211300,
        "level": 2,
        "name": "喀喇沁左翼蒙古族自治县"
    },
    {
        "id": 210700,
        "code": 210700,
        "pid": 210000,
        "level": 1,
        "name": "锦州市"
    },
    {
        "id": 210782,
        "code": 210782,
        "pid": 210700,
        "level": 2,
        "name": "北镇市"
    },
    {
        "id": 210781,
        "code": 210781,
        "pid": 210700,
        "level": 2,
        "name": "凌海市"
    },
    {
        "id": 210702,
        "code": 210702,
        "pid": 210700,
        "level": 2,
        "name": "古塔区"
    },
    {
        "id": 210711,
        "code": 210711,
        "pid": 210700,
        "level": 2,
        "name": "太和区"
    },
    {
        "id": 210703,
        "code": 210703,
        "pid": 210700,
        "level": 2,
        "name": "凌河区"
    },
    {
        "id": 210726,
        "code": 210726,
        "pid": 210700,
        "level": 2,
        "name": "黑山县"
    },
    {
        "id": 210727,
        "code": 210727,
        "pid": 210700,
        "level": 2,
        "name": "义县"
    },
    {
        "id": 210400,
        "code": 210400,
        "pid": 210000,
        "level": 1,
        "name": "抚顺市"
    },
    {
        "id": 210402,
        "code": 210402,
        "pid": 210400,
        "level": 2,
        "name": "新抚区"
    },
    {
        "id": 210404,
        "code": 210404,
        "pid": 210400,
        "level": 2,
        "name": "望花区"
    },
    {
        "id": 210403,
        "code": 210403,
        "pid": 210400,
        "level": 2,
        "name": "东洲区"
    },
    {
        "id": 210411,
        "code": 210411,
        "pid": 210400,
        "level": 2,
        "name": "顺城区"
    },
    {
        "id": 210423,
        "code": 210423,
        "pid": 210400,
        "level": 2,
        "name": "清原满族自治县"
    },
    {
        "id": 210422,
        "code": 210422,
        "pid": 210400,
        "level": 2,
        "name": "新宾满族自治县"
    },
    {
        "id": 210421,
        "code": 210421,
        "pid": 210400,
        "level": 2,
        "name": "抚顺县"
    },
    {
        "id": 210200,
        "code": 210200,
        "pid": 210000,
        "level": 1,
        "name": "大连市"
    },
    {
        "id": 210214,
        "code": 210214,
        "pid": 210200,
        "level": 2,
        "name": "普兰店区"
    },
    {
        "id": 210202,
        "code": 210202,
        "pid": 210200,
        "level": 2,
        "name": "中山区"
    },
    {
        "id": 210211,
        "code": 210211,
        "pid": 210200,
        "level": 2,
        "name": "甘井子区"
    },
    {
        "id": 210212,
        "code": 210212,
        "pid": 210200,
        "level": 2,
        "name": "旅顺口区"
    },
    {
        "id": 210213,
        "code": 210213,
        "pid": 210200,
        "level": 2,
        "name": "金州区"
    },
    {
        "id": 210203,
        "code": 210203,
        "pid": 210200,
        "level": 2,
        "name": "西岗区"
    },
    {
        "id": 210204,
        "code": 210204,
        "pid": 210200,
        "level": 2,
        "name": "沙河口区"
    },
    {
        "id": 210283,
        "code": 210283,
        "pid": 210200,
        "level": 2,
        "name": "庄河市"
    },
    {
        "id": 210281,
        "code": 210281,
        "pid": 210200,
        "level": 2,
        "name": "瓦房店市"
    },
    {
        "id": 210224,
        "code": 210224,
        "pid": 210200,
        "level": 2,
        "name": "长海县"
    },
    {
        "id": 211000,
        "code": 211000,
        "pid": 210000,
        "level": 1,
        "name": "辽阳市"
    },
    {
        "id": 211021,
        "code": 211021,
        "pid": 211000,
        "level": 2,
        "name": "辽阳县"
    },
    {
        "id": 211002,
        "code": 211002,
        "pid": 211000,
        "level": 2,
        "name": "白塔区"
    },
    {
        "id": 211081,
        "code": 211081,
        "pid": 211000,
        "level": 2,
        "name": "灯塔市"
    },
    {
        "id": 211011,
        "code": 211011,
        "pid": 211000,
        "level": 2,
        "name": "太子河区"
    },
    {
        "id": 211003,
        "code": 211003,
        "pid": 211000,
        "level": 2,
        "name": "文圣区"
    },
    {
        "id": 211004,
        "code": 211004,
        "pid": 211000,
        "level": 2,
        "name": "宏伟区"
    },
    {
        "id": 211005,
        "code": 211005,
        "pid": 211000,
        "level": 2,
        "name": "弓长岭区"
    },
    {
        "id": 210300,
        "code": 210300,
        "pid": 210000,
        "level": 1,
        "name": "鞍山市"
    },
    {
        "id": 210321,
        "code": 210321,
        "pid": 210300,
        "level": 2,
        "name": "台安县"
    },
    {
        "id": 210323,
        "code": 210323,
        "pid": 210300,
        "level": 2,
        "name": "岫岩满族自治县"
    },
    {
        "id": 210302,
        "code": 210302,
        "pid": 210300,
        "level": 2,
        "name": "铁东区"
    },
    {
        "id": 210381,
        "code": 210381,
        "pid": 210300,
        "level": 2,
        "name": "海城市"
    },
    {
        "id": 210311,
        "code": 210311,
        "pid": 210300,
        "level": 2,
        "name": "千山区"
    },
    {
        "id": 210303,
        "code": 210303,
        "pid": 210300,
        "level": 2,
        "name": "铁西区"
    },
    {
        "id": 210304,
        "code": 210304,
        "pid": 210300,
        "level": 2,
        "name": "立山区"
    },
    {
        "id": 211400,
        "code": 211400,
        "pid": 210000,
        "level": 1,
        "name": "葫芦岛市"
    },
    {
        "id": 211481,
        "code": 211481,
        "pid": 211400,
        "level": 2,
        "name": "兴城市"
    },
    {
        "id": 211403,
        "code": 211403,
        "pid": 211400,
        "level": 2,
        "name": "龙港区"
    },
    {
        "id": 211421,
        "code": 211421,
        "pid": 211400,
        "level": 2,
        "name": "绥中县"
    },
    {
        "id": 211422,
        "code": 211422,
        "pid": 211400,
        "level": 2,
        "name": "建昌县"
    },
    {
        "id": 211402,
        "code": 211402,
        "pid": 211400,
        "level": 2,
        "name": "连山区"
    },
    {
        "id": 211404,
        "code": 211404,
        "pid": 211400,
        "level": 2,
        "name": "南票区"
    },
    {
        "id": 710000,
        "code": 710000,
        "pid": 0,
        "level": 0,
        "name": "台湾省"
    },
    {
        "id": 620000,
        "code": 620000,
        "pid": 0,
        "level": 0,
        "name": "甘肃省"
    },
    {
        "id": 620600,
        "code": 620600,
        "pid": 620000,
        "level": 1,
        "name": "武威市"
    },
    {
        "id": 620602,
        "code": 620602,
        "pid": 620600,
        "level": 2,
        "name": "凉州区"
    },
    {
        "id": 620622,
        "code": 620622,
        "pid": 620600,
        "level": 2,
        "name": "古浪县"
    },
    {
        "id": 620623,
        "code": 620623,
        "pid": 620600,
        "level": 2,
        "name": "天祝藏族自治县"
    },
    {
        "id": 620621,
        "code": 620621,
        "pid": 620600,
        "level": 2,
        "name": "民勤县"
    },
    {
        "id": 620500,
        "code": 620500,
        "pid": 620000,
        "level": 1,
        "name": "天水市"
    },
    {
        "id": 620521,
        "code": 620521,
        "pid": 620500,
        "level": 2,
        "name": "清水县"
    },
    {
        "id": 620523,
        "code": 620523,
        "pid": 620500,
        "level": 2,
        "name": "甘谷县"
    },
    {
        "id": 620522,
        "code": 620522,
        "pid": 620500,
        "level": 2,
        "name": "秦安县"
    },
    {
        "id": 620525,
        "code": 620525,
        "pid": 620500,
        "level": 2,
        "name": "张家川回族自治县"
    },
    {
        "id": 620524,
        "code": 620524,
        "pid": 620500,
        "level": 2,
        "name": "武山县"
    },
    {
        "id": 620503,
        "code": 620503,
        "pid": 620500,
        "level": 2,
        "name": "麦积区"
    },
    {
        "id": 620502,
        "code": 620502,
        "pid": 620500,
        "level": 2,
        "name": "秦州区"
    },
    {
        "id": 620200,
        "code": 620200,
        "pid": 620000,
        "level": 1,
        "name": "嘉峪关市"
    },
    {
        "id": 623000,
        "code": 623000,
        "pid": 620000,
        "level": 1,
        "name": "甘南藏族自治州"
    },
    {
        "id": 623001,
        "code": 623001,
        "pid": 623000,
        "level": 2,
        "name": "合作市"
    },
    {
        "id": 623025,
        "code": 623025,
        "pid": 623000,
        "level": 2,
        "name": "玛曲县"
    },
    {
        "id": 623024,
        "code": 623024,
        "pid": 623000,
        "level": 2,
        "name": "迭部县"
    },
    {
        "id": 623027,
        "code": 623027,
        "pid": 623000,
        "level": 2,
        "name": "夏河县"
    },
    {
        "id": 623026,
        "code": 623026,
        "pid": 623000,
        "level": 2,
        "name": "碌曲县"
    },
    {
        "id": 623021,
        "code": 623021,
        "pid": 623000,
        "level": 2,
        "name": "临潭县"
    },
    {
        "id": 623023,
        "code": 623023,
        "pid": 623000,
        "level": 2,
        "name": "舟曲县"
    },
    {
        "id": 623022,
        "code": 623022,
        "pid": 623000,
        "level": 2,
        "name": "卓尼县"
    },
    {
        "id": 620700,
        "code": 620700,
        "pid": 620000,
        "level": 1,
        "name": "张掖市"
    },
    {
        "id": 620702,
        "code": 620702,
        "pid": 620700,
        "level": 2,
        "name": "甘州区"
    },
    {
        "id": 620723,
        "code": 620723,
        "pid": 620700,
        "level": 2,
        "name": "临泽县"
    },
    {
        "id": 620722,
        "code": 620722,
        "pid": 620700,
        "level": 2,
        "name": "民乐县"
    },
    {
        "id": 620721,
        "code": 620721,
        "pid": 620700,
        "level": 2,
        "name": "肃南裕固族自治县"
    },
    {
        "id": 620725,
        "code": 620725,
        "pid": 620700,
        "level": 2,
        "name": "山丹县"
    },
    {
        "id": 620724,
        "code": 620724,
        "pid": 620700,
        "level": 2,
        "name": "高台县"
    },
    {
        "id": 620900,
        "code": 620900,
        "pid": 620000,
        "level": 1,
        "name": "酒泉市"
    },
    {
        "id": 620902,
        "code": 620902,
        "pid": 620900,
        "level": 2,
        "name": "肃州区"
    },
    {
        "id": 620982,
        "code": 620982,
        "pid": 620900,
        "level": 2,
        "name": "敦煌市"
    },
    {
        "id": 620981,
        "code": 620981,
        "pid": 620900,
        "level": 2,
        "name": "玉门市"
    },
    {
        "id": 620924,
        "code": 620924,
        "pid": 620900,
        "level": 2,
        "name": "阿克塞哈萨克族自治县"
    },
    {
        "id": 620921,
        "code": 620921,
        "pid": 620900,
        "level": 2,
        "name": "金塔县"
    },
    {
        "id": 620923,
        "code": 620923,
        "pid": 620900,
        "level": 2,
        "name": "肃北蒙古族自治县"
    },
    {
        "id": 620922,
        "code": 620922,
        "pid": 620900,
        "level": 2,
        "name": "瓜州县"
    },
    {
        "id": 620300,
        "code": 620300,
        "pid": 620000,
        "level": 1,
        "name": "金昌市"
    },
    {
        "id": 620321,
        "code": 620321,
        "pid": 620300,
        "level": 2,
        "name": "永昌县"
    },
    {
        "id": 620302,
        "code": 620302,
        "pid": 620300,
        "level": 2,
        "name": "金川区"
    },
    {
        "id": 621000,
        "code": 621000,
        "pid": 620000,
        "level": 1,
        "name": "庆阳市"
    },
    {
        "id": 621002,
        "code": 621002,
        "pid": 621000,
        "level": 2,
        "name": "西峰区"
    },
    {
        "id": 621027,
        "code": 621027,
        "pid": 621000,
        "level": 2,
        "name": "镇原县"
    },
    {
        "id": 621026,
        "code": 621026,
        "pid": 621000,
        "level": 2,
        "name": "宁县"
    },
    {
        "id": 621025,
        "code": 621025,
        "pid": 621000,
        "level": 2,
        "name": "正宁县"
    },
    {
        "id": 621024,
        "code": 621024,
        "pid": 621000,
        "level": 2,
        "name": "合水县"
    },
    {
        "id": 621023,
        "code": 621023,
        "pid": 621000,
        "level": 2,
        "name": "华池县"
    },
    {
        "id": 621022,
        "code": 621022,
        "pid": 621000,
        "level": 2,
        "name": "环县"
    },
    {
        "id": 621021,
        "code": 621021,
        "pid": 621000,
        "level": 2,
        "name": "庆城县"
    },
    {
        "id": 622900,
        "code": 622900,
        "pid": 620000,
        "level": 1,
        "name": "临夏回族自治州"
    },
    {
        "id": 622901,
        "code": 622901,
        "pid": 622900,
        "level": 2,
        "name": "临夏市"
    },
    {
        "id": 622923,
        "code": 622923,
        "pid": 622900,
        "level": 2,
        "name": "永靖县"
    },
    {
        "id": 622922,
        "code": 622922,
        "pid": 622900,
        "level": 2,
        "name": "康乐县"
    },
    {
        "id": 622921,
        "code": 622921,
        "pid": 622900,
        "level": 2,
        "name": "临夏县"
    },
    {
        "id": 622927,
        "code": 622927,
        "pid": 622900,
        "level": 2,
        "name": "积石山保安族东乡族撒拉族自治县"
    },
    {
        "id": 622926,
        "code": 622926,
        "pid": 622900,
        "level": 2,
        "name": "东乡族自治县"
    },
    {
        "id": 622925,
        "code": 622925,
        "pid": 622900,
        "level": 2,
        "name": "和政县"
    },
    {
        "id": 622924,
        "code": 622924,
        "pid": 622900,
        "level": 2,
        "name": "广河县"
    },
    {
        "id": 620400,
        "code": 620400,
        "pid": 620000,
        "level": 1,
        "name": "白银市"
    },
    {
        "id": 620402,
        "code": 620402,
        "pid": 620400,
        "level": 2,
        "name": "白银区"
    },
    {
        "id": 620403,
        "code": 620403,
        "pid": 620400,
        "level": 2,
        "name": "平川区"
    },
    {
        "id": 620421,
        "code": 620421,
        "pid": 620400,
        "level": 2,
        "name": "靖远县"
    },
    {
        "id": 620422,
        "code": 620422,
        "pid": 620400,
        "level": 2,
        "name": "会宁县"
    },
    {
        "id": 620423,
        "code": 620423,
        "pid": 620400,
        "level": 2,
        "name": "景泰县"
    },
    {
        "id": 621100,
        "code": 621100,
        "pid": 620000,
        "level": 1,
        "name": "定西市"
    },
    {
        "id": 621102,
        "code": 621102,
        "pid": 621100,
        "level": 2,
        "name": "安定区"
    },
    {
        "id": 621122,
        "code": 621122,
        "pid": 621100,
        "level": 2,
        "name": "陇西县"
    },
    {
        "id": 621123,
        "code": 621123,
        "pid": 621100,
        "level": 2,
        "name": "渭源县"
    },
    {
        "id": 621121,
        "code": 621121,
        "pid": 621100,
        "level": 2,
        "name": "通渭县"
    },
    {
        "id": 621126,
        "code": 621126,
        "pid": 621100,
        "level": 2,
        "name": "岷县"
    },
    {
        "id": 621124,
        "code": 621124,
        "pid": 621100,
        "level": 2,
        "name": "临洮县"
    },
    {
        "id": 621125,
        "code": 621125,
        "pid": 621100,
        "level": 2,
        "name": "漳县"
    },
    {
        "id": 621200,
        "code": 621200,
        "pid": 620000,
        "level": 1,
        "name": "陇南市"
    },
    {
        "id": 621202,
        "code": 621202,
        "pid": 621200,
        "level": 2,
        "name": "武都区"
    },
    {
        "id": 621225,
        "code": 621225,
        "pid": 621200,
        "level": 2,
        "name": "西和县"
    },
    {
        "id": 621224,
        "code": 621224,
        "pid": 621200,
        "level": 2,
        "name": "康县"
    },
    {
        "id": 621227,
        "code": 621227,
        "pid": 621200,
        "level": 2,
        "name": "徽县"
    },
    {
        "id": 621226,
        "code": 621226,
        "pid": 621200,
        "level": 2,
        "name": "礼县"
    },
    {
        "id": 621221,
        "code": 621221,
        "pid": 621200,
        "level": 2,
        "name": "成县"
    },
    {
        "id": 621223,
        "code": 621223,
        "pid": 621200,
        "level": 2,
        "name": "宕昌县"
    },
    {
        "id": 621222,
        "code": 621222,
        "pid": 621200,
        "level": 2,
        "name": "文县"
    },
    {
        "id": 621228,
        "code": 621228,
        "pid": 621200,
        "level": 2,
        "name": "两当县"
    },
    {
        "id": 620800,
        "code": 620800,
        "pid": 620000,
        "level": 1,
        "name": "平凉市"
    },
    {
        "id": 620824,
        "code": 620824,
        "pid": 620800,
        "level": 2,
        "name": "华亭县"
    },
    {
        "id": 620821,
        "code": 620821,
        "pid": 620800,
        "level": 2,
        "name": "泾川县"
    },
    {
        "id": 620822,
        "code": 620822,
        "pid": 620800,
        "level": 2,
        "name": "灵台县"
    },
    {
        "id": 620823,
        "code": 620823,
        "pid": 620800,
        "level": 2,
        "name": "崇信县"
    },
    {
        "id": 620802,
        "code": 620802,
        "pid": 620800,
        "level": 2,
        "name": "崆峒区"
    },
    {
        "id": 620825,
        "code": 620825,
        "pid": 620800,
        "level": 2,
        "name": "庄浪县"
    },
    {
        "id": 620826,
        "code": 620826,
        "pid": 620800,
        "level": 2,
        "name": "静宁县"
    },
    {
        "id": 620100,
        "code": 620100,
        "pid": 620000,
        "level": 1,
        "name": "兰州市"
    },
    {
        "id": 620111,
        "code": 620111,
        "pid": 620100,
        "level": 2,
        "name": "红古区"
    },
    {
        "id": 620121,
        "code": 620121,
        "pid": 620100,
        "level": 2,
        "name": "永登县"
    },
    {
        "id": 620123,
        "code": 620123,
        "pid": 620100,
        "level": 2,
        "name": "榆中县"
    },
    {
        "id": 620122,
        "code": 620122,
        "pid": 620100,
        "level": 2,
        "name": "皋兰县"
    },
    {
        "id": 620105,
        "code": 620105,
        "pid": 620100,
        "level": 2,
        "name": "安宁区"
    },
    {
        "id": 620104,
        "code": 620104,
        "pid": 620100,
        "level": 2,
        "name": "西固区"
    },
    {
        "id": 620103,
        "code": 620103,
        "pid": 620100,
        "level": 2,
        "name": "七里河区"
    },
    {
        "id": 620102,
        "code": 620102,
        "pid": 620100,
        "level": 2,
        "name": "城关区"
    },
    {
        "id": 430000,
        "code": 430000,
        "pid": 0,
        "level": 0,
        "name": "湖南省"
    },
    {
        "id": 430800,
        "code": 430800,
        "pid": 430000,
        "level": 1,
        "name": "张家界市"
    },
    {
        "id": 430822,
        "code": 430822,
        "pid": 430800,
        "level": 2,
        "name": "桑植县"
    },
    {
        "id": 430821,
        "code": 430821,
        "pid": 430800,
        "level": 2,
        "name": "慈利县"
    },
    {
        "id": 430802,
        "code": 430802,
        "pid": 430800,
        "level": 2,
        "name": "永定区"
    },
    {
        "id": 430811,
        "code": 430811,
        "pid": 430800,
        "level": 2,
        "name": "武陵源区"
    },
    {
        "id": 431000,
        "code": 431000,
        "pid": 430000,
        "level": 1,
        "name": "郴州市"
    },
    {
        "id": 431002,
        "code": 431002,
        "pid": 431000,
        "level": 2,
        "name": "北湖区"
    },
    {
        "id": 431003,
        "code": 431003,
        "pid": 431000,
        "level": 2,
        "name": "苏仙区"
    },
    {
        "id": 431027,
        "code": 431027,
        "pid": 431000,
        "level": 2,
        "name": "桂东县"
    },
    {
        "id": 431028,
        "code": 431028,
        "pid": 431000,
        "level": 2,
        "name": "安仁县"
    },
    {
        "id": 431024,
        "code": 431024,
        "pid": 431000,
        "level": 2,
        "name": "嘉禾县"
    },
    {
        "id": 431025,
        "code": 431025,
        "pid": 431000,
        "level": 2,
        "name": "临武县"
    },
    {
        "id": 431026,
        "code": 431026,
        "pid": 431000,
        "level": 2,
        "name": "汝城县"
    },
    {
        "id": 431081,
        "code": 431081,
        "pid": 431000,
        "level": 2,
        "name": "资兴市"
    },
    {
        "id": 431021,
        "code": 431021,
        "pid": 431000,
        "level": 2,
        "name": "桂阳县"
    },
    {
        "id": 431022,
        "code": 431022,
        "pid": 431000,
        "level": 2,
        "name": "宜章县"
    },
    {
        "id": 431023,
        "code": 431023,
        "pid": 431000,
        "level": 2,
        "name": "永兴县"
    },
    {
        "id": 430100,
        "code": 430100,
        "pid": 430000,
        "level": 1,
        "name": "长沙市"
    },
    {
        "id": 430181,
        "code": 430181,
        "pid": 430100,
        "level": 2,
        "name": "浏阳市"
    },
    {
        "id": 430102,
        "code": 430102,
        "pid": 430100,
        "level": 2,
        "name": "芙蓉区"
    },
    {
        "id": 430124,
        "code": 430124,
        "pid": 430100,
        "level": 2,
        "name": "宁乡县"
    },
    {
        "id": 430103,
        "code": 430103,
        "pid": 430100,
        "level": 2,
        "name": "天心区"
    },
    {
        "id": 430104,
        "code": 430104,
        "pid": 430100,
        "level": 2,
        "name": "岳麓区"
    },
    {
        "id": 430105,
        "code": 430105,
        "pid": 430100,
        "level": 2,
        "name": "开福区"
    },
    {
        "id": 430121,
        "code": 430121,
        "pid": 430100,
        "level": 2,
        "name": "长沙县"
    },
    {
        "id": 430112,
        "code": 430112,
        "pid": 430100,
        "level": 2,
        "name": "望城区"
    },
    {
        "id": 430111,
        "code": 430111,
        "pid": 430100,
        "level": 2,
        "name": "雨花区"
    },
    {
        "id": 433100,
        "code": 433100,
        "pid": 430000,
        "level": 1,
        "name": "湘西土家族苗族自治州"
    },
    {
        "id": 433130,
        "code": 433130,
        "pid": 433100,
        "level": 2,
        "name": "龙山县"
    },
    {
        "id": 433101,
        "code": 433101,
        "pid": 433100,
        "level": 2,
        "name": "吉首市"
    },
    {
        "id": 433127,
        "code": 433127,
        "pid": 433100,
        "level": 2,
        "name": "永顺县"
    },
    {
        "id": 433126,
        "code": 433126,
        "pid": 433100,
        "level": 2,
        "name": "古丈县"
    },
    {
        "id": 433125,
        "code": 433125,
        "pid": 433100,
        "level": 2,
        "name": "保靖县"
    },
    {
        "id": 433124,
        "code": 433124,
        "pid": 433100,
        "level": 2,
        "name": "花垣县"
    },
    {
        "id": 433123,
        "code": 433123,
        "pid": 433100,
        "level": 2,
        "name": "凤凰县"
    },
    {
        "id": 433122,
        "code": 433122,
        "pid": 433100,
        "level": 2,
        "name": "泸溪县"
    },
    {
        "id": 430700,
        "code": 430700,
        "pid": 430000,
        "level": 1,
        "name": "常德市"
    },
    {
        "id": 430721,
        "code": 430721,
        "pid": 430700,
        "level": 2,
        "name": "安乡县"
    },
    {
        "id": 430722,
        "code": 430722,
        "pid": 430700,
        "level": 2,
        "name": "汉寿县"
    },
    {
        "id": 430723,
        "code": 430723,
        "pid": 430700,
        "level": 2,
        "name": "澧县"
    },
    {
        "id": 430724,
        "code": 430724,
        "pid": 430700,
        "level": 2,
        "name": "临澧县"
    },
    {
        "id": 430725,
        "code": 430725,
        "pid": 430700,
        "level": 2,
        "name": "桃源县"
    },
    {
        "id": 430726,
        "code": 430726,
        "pid": 430700,
        "level": 2,
        "name": "石门县"
    },
    {
        "id": 430702,
        "code": 430702,
        "pid": 430700,
        "level": 2,
        "name": "武陵区"
    },
    {
        "id": 430781,
        "code": 430781,
        "pid": 430700,
        "level": 2,
        "name": "津市市"
    },
    {
        "id": 430703,
        "code": 430703,
        "pid": 430700,
        "level": 2,
        "name": "鼎城区"
    },
    {
        "id": 431100,
        "code": 431100,
        "pid": 430000,
        "level": 1,
        "name": "永州市"
    },
    {
        "id": 431121,
        "code": 431121,
        "pid": 431100,
        "level": 2,
        "name": "祁阳县"
    },
    {
        "id": 431123,
        "code": 431123,
        "pid": 431100,
        "level": 2,
        "name": "双牌县"
    },
    {
        "id": 431122,
        "code": 431122,
        "pid": 431100,
        "level": 2,
        "name": "东安县"
    },
    {
        "id": 431125,
        "code": 431125,
        "pid": 431100,
        "level": 2,
        "name": "江永县"
    },
    {
        "id": 431124,
        "code": 431124,
        "pid": 431100,
        "level": 2,
        "name": "道县"
    },
    {
        "id": 431127,
        "code": 431127,
        "pid": 431100,
        "level": 2,
        "name": "蓝山县"
    },
    {
        "id": 431126,
        "code": 431126,
        "pid": 431100,
        "level": 2,
        "name": "宁远县"
    },
    {
        "id": 431129,
        "code": 431129,
        "pid": 431100,
        "level": 2,
        "name": "江华瑶族自治县"
    },
    {
        "id": 431128,
        "code": 431128,
        "pid": 431100,
        "level": 2,
        "name": "新田县"
    },
    {
        "id": 431103,
        "code": 431103,
        "pid": 431100,
        "level": 2,
        "name": "冷水滩区"
    },
    {
        "id": 431102,
        "code": 431102,
        "pid": 431100,
        "level": 2,
        "name": "零陵区"
    },
    {
        "id": 430300,
        "code": 430300,
        "pid": 430000,
        "level": 1,
        "name": "湘潭市"
    },
    {
        "id": 430382,
        "code": 430382,
        "pid": 430300,
        "level": 2,
        "name": "韶山市"
    },
    {
        "id": 430302,
        "code": 430302,
        "pid": 430300,
        "level": 2,
        "name": "雨湖区"
    },
    {
        "id": 430381,
        "code": 430381,
        "pid": 430300,
        "level": 2,
        "name": "湘乡市"
    },
    {
        "id": 430321,
        "code": 430321,
        "pid": 430300,
        "level": 2,
        "name": "湘潭县"
    },
    {
        "id": 430304,
        "code": 430304,
        "pid": 430300,
        "level": 2,
        "name": "岳塘区"
    },
    {
        "id": 430600,
        "code": 430600,
        "pid": 430000,
        "level": 1,
        "name": "岳阳市"
    },
    {
        "id": 430624,
        "code": 430624,
        "pid": 430600,
        "level": 2,
        "name": "湘阴县"
    },
    {
        "id": 430626,
        "code": 430626,
        "pid": 430600,
        "level": 2,
        "name": "平江县"
    },
    {
        "id": 430621,
        "code": 430621,
        "pid": 430600,
        "level": 2,
        "name": "岳阳县"
    },
    {
        "id": 430682,
        "code": 430682,
        "pid": 430600,
        "level": 2,
        "name": "临湘市"
    },
    {
        "id": 430681,
        "code": 430681,
        "pid": 430600,
        "level": 2,
        "name": "汨罗市"
    },
    {
        "id": 430611,
        "code": 430611,
        "pid": 430600,
        "level": 2,
        "name": "君山区"
    },
    {
        "id": 430623,
        "code": 430623,
        "pid": 430600,
        "level": 2,
        "name": "华容县"
    },
    {
        "id": 430603,
        "code": 430603,
        "pid": 430600,
        "level": 2,
        "name": "云溪区"
    },
    {
        "id": 430602,
        "code": 430602,
        "pid": 430600,
        "level": 2,
        "name": "岳阳楼区"
    },
    {
        "id": 431200,
        "code": 431200,
        "pid": 430000,
        "level": 1,
        "name": "怀化市"
    },
    {
        "id": 431281,
        "code": 431281,
        "pid": 431200,
        "level": 2,
        "name": "洪江市"
    },
    {
        "id": 431224,
        "code": 431224,
        "pid": 431200,
        "level": 2,
        "name": "溆浦县"
    },
    {
        "id": 431226,
        "code": 431226,
        "pid": 431200,
        "level": 2,
        "name": "麻阳苗族自治县"
    },
    {
        "id": 431227,
        "code": 431227,
        "pid": 431200,
        "level": 2,
        "name": "新晃侗族自治县"
    },
    {
        "id": 431202,
        "code": 431202,
        "pid": 431200,
        "level": 2,
        "name": "鹤城区"
    },
    {
        "id": 431225,
        "code": 431225,
        "pid": 431200,
        "level": 2,
        "name": "会同县"
    },
    {
        "id": 431222,
        "code": 431222,
        "pid": 431200,
        "level": 2,
        "name": "沅陵县"
    },
    {
        "id": 431223,
        "code": 431223,
        "pid": 431200,
        "level": 2,
        "name": "辰溪县"
    },
    {
        "id": 431230,
        "code": 431230,
        "pid": 431200,
        "level": 2,
        "name": "通道侗族自治县"
    },
    {
        "id": 431221,
        "code": 431221,
        "pid": 431200,
        "level": 2,
        "name": "中方县"
    },
    {
        "id": 431228,
        "code": 431228,
        "pid": 431200,
        "level": 2,
        "name": "芷江侗族自治县"
    },
    {
        "id": 431229,
        "code": 431229,
        "pid": 431200,
        "level": 2,
        "name": "靖州苗族侗族自治县"
    },
    {
        "id": 430500,
        "code": 430500,
        "pid": 430000,
        "level": 1,
        "name": "邵阳市"
    },
    {
        "id": 430528,
        "code": 430528,
        "pid": 430500,
        "level": 2,
        "name": "新宁县"
    },
    {
        "id": 430529,
        "code": 430529,
        "pid": 430500,
        "level": 2,
        "name": "城步苗族自治县"
    },
    {
        "id": 430527,
        "code": 430527,
        "pid": 430500,
        "level": 2,
        "name": "绥宁县"
    },
    {
        "id": 430522,
        "code": 430522,
        "pid": 430500,
        "level": 2,
        "name": "新邵县"
    },
    {
        "id": 430523,
        "code": 430523,
        "pid": 430500,
        "level": 2,
        "name": "邵阳县"
    },
    {
        "id": 430521,
        "code": 430521,
        "pid": 430500,
        "level": 2,
        "name": "邵东县"
    },
    {
        "id": 430581,
        "code": 430581,
        "pid": 430500,
        "level": 2,
        "name": "武冈市"
    },
    {
        "id": 430524,
        "code": 430524,
        "pid": 430500,
        "level": 2,
        "name": "隆回县"
    },
    {
        "id": 430525,
        "code": 430525,
        "pid": 430500,
        "level": 2,
        "name": "洞口县"
    },
    {
        "id": 430511,
        "code": 430511,
        "pid": 430500,
        "level": 2,
        "name": "北塔区"
    },
    {
        "id": 430502,
        "code": 430502,
        "pid": 430500,
        "level": 2,
        "name": "双清区"
    },
    {
        "id": 430503,
        "code": 430503,
        "pid": 430500,
        "level": 2,
        "name": "大祥区"
    },
    {
        "id": 430200,
        "code": 430200,
        "pid": 430000,
        "level": 1,
        "name": "株洲市"
    },
    {
        "id": 430221,
        "code": 430221,
        "pid": 430200,
        "level": 2,
        "name": "株洲县"
    },
    {
        "id": 430223,
        "code": 430223,
        "pid": 430200,
        "level": 2,
        "name": "攸县"
    },
    {
        "id": 430225,
        "code": 430225,
        "pid": 430200,
        "level": 2,
        "name": "炎陵县"
    },
    {
        "id": 430224,
        "code": 430224,
        "pid": 430200,
        "level": 2,
        "name": "茶陵县"
    },
    {
        "id": 430203,
        "code": 430203,
        "pid": 430200,
        "level": 2,
        "name": "芦淞区"
    },
    {
        "id": 430202,
        "code": 430202,
        "pid": 430200,
        "level": 2,
        "name": "荷塘区"
    },
    {
        "id": 430211,
        "code": 430211,
        "pid": 430200,
        "level": 2,
        "name": "天元区"
    },
    {
        "id": 430204,
        "code": 430204,
        "pid": 430200,
        "level": 2,
        "name": "石峰区"
    },
    {
        "id": 430281,
        "code": 430281,
        "pid": 430200,
        "level": 2,
        "name": "醴陵市"
    },
    {
        "id": 430900,
        "code": 430900,
        "pid": 430000,
        "level": 1,
        "name": "益阳市"
    },
    {
        "id": 430981,
        "code": 430981,
        "pid": 430900,
        "level": 2,
        "name": "沅江市"
    },
    {
        "id": 430902,
        "code": 430902,
        "pid": 430900,
        "level": 2,
        "name": "资阳区"
    },
    {
        "id": 430903,
        "code": 430903,
        "pid": 430900,
        "level": 2,
        "name": "赫山区"
    },
    {
        "id": 430922,
        "code": 430922,
        "pid": 430900,
        "level": 2,
        "name": "桃江县"
    },
    {
        "id": 430923,
        "code": 430923,
        "pid": 430900,
        "level": 2,
        "name": "安化县"
    },
    {
        "id": 430921,
        "code": 430921,
        "pid": 430900,
        "level": 2,
        "name": "南县"
    },
    {
        "id": 431300,
        "code": 431300,
        "pid": 430000,
        "level": 1,
        "name": "娄底市"
    },
    {
        "id": 431381,
        "code": 431381,
        "pid": 431300,
        "level": 2,
        "name": "冷水江市"
    },
    {
        "id": 431322,
        "code": 431322,
        "pid": 431300,
        "level": 2,
        "name": "新化县"
    },
    {
        "id": 431321,
        "code": 431321,
        "pid": 431300,
        "level": 2,
        "name": "双峰县"
    },
    {
        "id": 431382,
        "code": 431382,
        "pid": 431300,
        "level": 2,
        "name": "涟源市"
    },
    {
        "id": 431302,
        "code": 431302,
        "pid": 431300,
        "level": 2,
        "name": "娄星区"
    },
    {
        "id": 430400,
        "code": 430400,
        "pid": 430000,
        "level": 1,
        "name": "衡阳市"
    },
    {
        "id": 430426,
        "code": 430426,
        "pid": 430400,
        "level": 2,
        "name": "祁东县"
    },
    {
        "id": 430424,
        "code": 430424,
        "pid": 430400,
        "level": 2,
        "name": "衡东县"
    },
    {
        "id": 430481,
        "code": 430481,
        "pid": 430400,
        "level": 2,
        "name": "耒阳市"
    },
    {
        "id": 430422,
        "code": 430422,
        "pid": 430400,
        "level": 2,
        "name": "衡南县"
    },
    {
        "id": 430421,
        "code": 430421,
        "pid": 430400,
        "level": 2,
        "name": "衡阳县"
    },
    {
        "id": 430482,
        "code": 430482,
        "pid": 430400,
        "level": 2,
        "name": "常宁市"
    },
    {
        "id": 430408,
        "code": 430408,
        "pid": 430400,
        "level": 2,
        "name": "蒸湘区"
    },
    {
        "id": 430405,
        "code": 430405,
        "pid": 430400,
        "level": 2,
        "name": "珠晖区"
    },
    {
        "id": 430423,
        "code": 430423,
        "pid": 430400,
        "level": 2,
        "name": "衡山县"
    },
    {
        "id": 430407,
        "code": 430407,
        "pid": 430400,
        "level": 2,
        "name": "石鼓区"
    },
    {
        "id": 430406,
        "code": 430406,
        "pid": 430400,
        "level": 2,
        "name": "雁峰区"
    },
    {
        "id": 430412,
        "code": 430412,
        "pid": 430400,
        "level": 2,
        "name": "南岳区"
    },
    {
        "id": 340000,
        "code": 340000,
        "pid": 0,
        "level": 0,
        "name": "安徽省"
    },
    {
        "id": 340300,
        "code": 340300,
        "pid": 340000,
        "level": 1,
        "name": "蚌埠市"
    },
    {
        "id": 340302,
        "code": 340302,
        "pid": 340300,
        "level": 2,
        "name": "龙子湖区"
    },
    {
        "id": 340303,
        "code": 340303,
        "pid": 340300,
        "level": 2,
        "name": "蚌山区"
    },
    {
        "id": 340304,
        "code": 340304,
        "pid": 340300,
        "level": 2,
        "name": "禹会区"
    },
    {
        "id": 340323,
        "code": 340323,
        "pid": 340300,
        "level": 2,
        "name": "固镇县"
    },
    {
        "id": 340321,
        "code": 340321,
        "pid": 340300,
        "level": 2,
        "name": "怀远县"
    },
    {
        "id": 340311,
        "code": 340311,
        "pid": 340300,
        "level": 2,
        "name": "淮上区"
    },
    {
        "id": 340322,
        "code": 340322,
        "pid": 340300,
        "level": 2,
        "name": "五河县"
    },
    {
        "id": 340800,
        "code": 340800,
        "pid": 340000,
        "level": 1,
        "name": "安庆市"
    },
    {
        "id": 340803,
        "code": 340803,
        "pid": 340800,
        "level": 2,
        "name": "大观区"
    },
    {
        "id": 340802,
        "code": 340802,
        "pid": 340800,
        "level": 2,
        "name": "迎江区"
    },
    {
        "id": 340811,
        "code": 340811,
        "pid": 340800,
        "level": 2,
        "name": "宜秀区"
    },
    {
        "id": 340828,
        "code": 340828,
        "pid": 340800,
        "level": 2,
        "name": "岳西县"
    },
    {
        "id": 340881,
        "code": 340881,
        "pid": 340800,
        "level": 2,
        "name": "桐城市"
    },
    {
        "id": 340822,
        "code": 340822,
        "pid": 340800,
        "level": 2,
        "name": "怀宁县"
    },
    {
        "id": 340825,
        "code": 340825,
        "pid": 340800,
        "level": 2,
        "name": "太湖县"
    },
    {
        "id": 340824,
        "code": 340824,
        "pid": 340800,
        "level": 2,
        "name": "潜山县"
    },
    {
        "id": 340827,
        "code": 340827,
        "pid": 340800,
        "level": 2,
        "name": "望江县"
    },
    {
        "id": 340826,
        "code": 340826,
        "pid": 340800,
        "level": 2,
        "name": "宿松县"
    },
    {
        "id": 341000,
        "code": 341000,
        "pid": 340000,
        "level": 1,
        "name": "黄山市"
    },
    {
        "id": 341004,
        "code": 341004,
        "pid": 341000,
        "level": 2,
        "name": "徽州区"
    },
    {
        "id": 341002,
        "code": 341002,
        "pid": 341000,
        "level": 2,
        "name": "屯溪区"
    },
    {
        "id": 341003,
        "code": 341003,
        "pid": 341000,
        "level": 2,
        "name": "黄山区"
    },
    {
        "id": 341022,
        "code": 341022,
        "pid": 341000,
        "level": 2,
        "name": "休宁县"
    },
    {
        "id": 341023,
        "code": 341023,
        "pid": 341000,
        "level": 2,
        "name": "黟县"
    },
    {
        "id": 341021,
        "code": 341021,
        "pid": 341000,
        "level": 2,
        "name": "歙县"
    },
    {
        "id": 341024,
        "code": 341024,
        "pid": 341000,
        "level": 2,
        "name": "祁门县"
    },
    {
        "id": 340500,
        "code": 340500,
        "pid": 340000,
        "level": 1,
        "name": "马鞍山市"
    },
    {
        "id": 340504,
        "code": 340504,
        "pid": 340500,
        "level": 2,
        "name": "雨山区"
    },
    {
        "id": 340506,
        "code": 340506,
        "pid": 340500,
        "level": 2,
        "name": "博望区"
    },
    {
        "id": 340521,
        "code": 340521,
        "pid": 340500,
        "level": 2,
        "name": "当涂县"
    },
    {
        "id": 340522,
        "code": 340522,
        "pid": 340500,
        "level": 2,
        "name": "含山县"
    },
    {
        "id": 340523,
        "code": 340523,
        "pid": 340500,
        "level": 2,
        "name": "和县"
    },
    {
        "id": 340503,
        "code": 340503,
        "pid": 340500,
        "level": 2,
        "name": "花山区"
    },
    {
        "id": 340600,
        "code": 340600,
        "pid": 340000,
        "level": 1,
        "name": "淮北市"
    },
    {
        "id": 340604,
        "code": 340604,
        "pid": 340600,
        "level": 2,
        "name": "烈山区"
    },
    {
        "id": 340621,
        "code": 340621,
        "pid": 340600,
        "level": 2,
        "name": "濉溪县"
    },
    {
        "id": 340603,
        "code": 340603,
        "pid": 340600,
        "level": 2,
        "name": "相山区"
    },
    {
        "id": 340602,
        "code": 340602,
        "pid": 340600,
        "level": 2,
        "name": "杜集区"
    },
    {
        "id": 340200,
        "code": 340200,
        "pid": 340000,
        "level": 1,
        "name": "芜湖市"
    },
    {
        "id": 340208,
        "code": 340208,
        "pid": 340200,
        "level": 2,
        "name": "三山区"
    },
    {
        "id": 340203,
        "code": 340203,
        "pid": 340200,
        "level": 2,
        "name": "弋江区"
    },
    {
        "id": 340202,
        "code": 340202,
        "pid": 340200,
        "level": 2,
        "name": "镜湖区"
    },
    {
        "id": 340207,
        "code": 340207,
        "pid": 340200,
        "level": 2,
        "name": "鸠江区"
    },
    {
        "id": 340223,
        "code": 340223,
        "pid": 340200,
        "level": 2,
        "name": "南陵县"
    },
    {
        "id": 340222,
        "code": 340222,
        "pid": 340200,
        "level": 2,
        "name": "繁昌县"
    },
    {
        "id": 340221,
        "code": 340221,
        "pid": 340200,
        "level": 2,
        "name": "芜湖县"
    },
    {
        "id": 340225,
        "code": 340225,
        "pid": 340200,
        "level": 2,
        "name": "无为县"
    },
    {
        "id": 341800,
        "code": 341800,
        "pid": 340000,
        "level": 1,
        "name": "宣城市"
    },
    {
        "id": 341822,
        "code": 341822,
        "pid": 341800,
        "level": 2,
        "name": "广德县"
    },
    {
        "id": 341823,
        "code": 341823,
        "pid": 341800,
        "level": 2,
        "name": "泾县"
    },
    {
        "id": 341821,
        "code": 341821,
        "pid": 341800,
        "level": 2,
        "name": "郎溪县"
    },
    {
        "id": 341824,
        "code": 341824,
        "pid": 341800,
        "level": 2,
        "name": "绩溪县"
    },
    {
        "id": 341825,
        "code": 341825,
        "pid": 341800,
        "level": 2,
        "name": "旌德县"
    },
    {
        "id": 341802,
        "code": 341802,
        "pid": 341800,
        "level": 2,
        "name": "宣州区"
    },
    {
        "id": 341881,
        "code": 341881,
        "pid": 341800,
        "level": 2,
        "name": "宁国市"
    },
    {
        "id": 340100,
        "code": 340100,
        "pid": 340000,
        "level": 1,
        "name": "合肥市"
    },
    {
        "id": 340111,
        "code": 340111,
        "pid": 340100,
        "level": 2,
        "name": "包河区"
    },
    {
        "id": 340102,
        "code": 340102,
        "pid": 340100,
        "level": 2,
        "name": "瑶海区"
    },
    {
        "id": 340103,
        "code": 340103,
        "pid": 340100,
        "level": 2,
        "name": "庐阳区"
    },
    {
        "id": 340104,
        "code": 340104,
        "pid": 340100,
        "level": 2,
        "name": "蜀山区"
    },
    {
        "id": 340124,
        "code": 340124,
        "pid": 340100,
        "level": 2,
        "name": "庐江县"
    },
    {
        "id": 340181,
        "code": 340181,
        "pid": 340100,
        "level": 2,
        "name": "巢湖市"
    },
    {
        "id": 340121,
        "code": 340121,
        "pid": 340100,
        "level": 2,
        "name": "长丰县"
    },
    {
        "id": 340122,
        "code": 340122,
        "pid": 340100,
        "level": 2,
        "name": "肥东县"
    },
    {
        "id": 340123,
        "code": 340123,
        "pid": 340100,
        "level": 2,
        "name": "肥西县"
    },
    {
        "id": 341100,
        "code": 341100,
        "pid": 340000,
        "level": 1,
        "name": "滁州市"
    },
    {
        "id": 341103,
        "code": 341103,
        "pid": 341100,
        "level": 2,
        "name": "南谯区"
    },
    {
        "id": 341102,
        "code": 341102,
        "pid": 341100,
        "level": 2,
        "name": "琅琊区"
    },
    {
        "id": 341126,
        "code": 341126,
        "pid": 341100,
        "level": 2,
        "name": "凤阳县"
    },
    {
        "id": 341125,
        "code": 341125,
        "pid": 341100,
        "level": 2,
        "name": "定远县"
    },
    {
        "id": 341124,
        "code": 341124,
        "pid": 341100,
        "level": 2,
        "name": "全椒县"
    },
    {
        "id": 341181,
        "code": 341181,
        "pid": 341100,
        "level": 2,
        "name": "天长市"
    },
    {
        "id": 341122,
        "code": 341122,
        "pid": 341100,
        "level": 2,
        "name": "来安县"
    },
    {
        "id": 341182,
        "code": 341182,
        "pid": 341100,
        "level": 2,
        "name": "明光市"
    },
    {
        "id": 341600,
        "code": 341600,
        "pid": 340000,
        "level": 1,
        "name": "亳州市"
    },
    {
        "id": 341602,
        "code": 341602,
        "pid": 341600,
        "level": 2,
        "name": "谯城区"
    },
    {
        "id": 341621,
        "code": 341621,
        "pid": 341600,
        "level": 2,
        "name": "涡阳县"
    },
    {
        "id": 341622,
        "code": 341622,
        "pid": 341600,
        "level": 2,
        "name": "蒙城县"
    },
    {
        "id": 341623,
        "code": 341623,
        "pid": 341600,
        "level": 2,
        "name": "利辛县"
    },
    {
        "id": 341200,
        "code": 341200,
        "pid": 340000,
        "level": 1,
        "name": "阜阳市"
    },
    {
        "id": 341282,
        "code": 341282,
        "pid": 341200,
        "level": 2,
        "name": "界首市"
    },
    {
        "id": 341204,
        "code": 341204,
        "pid": 341200,
        "level": 2,
        "name": "颍泉区"
    },
    {
        "id": 341221,
        "code": 341221,
        "pid": 341200,
        "level": 2,
        "name": "临泉县"
    },
    {
        "id": 341222,
        "code": 341222,
        "pid": 341200,
        "level": 2,
        "name": "太和县"
    },
    {
        "id": 341202,
        "code": 341202,
        "pid": 341200,
        "level": 2,
        "name": "颍州区"
    },
    {
        "id": 341225,
        "code": 341225,
        "pid": 341200,
        "level": 2,
        "name": "阜南县"
    },
    {
        "id": 341226,
        "code": 341226,
        "pid": 341200,
        "level": 2,
        "name": "颍上县"
    },
    {
        "id": 341203,
        "code": 341203,
        "pid": 341200,
        "level": 2,
        "name": "颍东区"
    },
    {
        "id": 341500,
        "code": 341500,
        "pid": 340000,
        "level": 1,
        "name": "六安市"
    },
    {
        "id": 341503,
        "code": 341503,
        "pid": 341500,
        "level": 2,
        "name": "裕安区"
    },
    {
        "id": 341502,
        "code": 341502,
        "pid": 341500,
        "level": 2,
        "name": "金安区"
    },
    {
        "id": 341504,
        "code": 341504,
        "pid": 341500,
        "level": 2,
        "name": "叶集区"
    },
    {
        "id": 341523,
        "code": 341523,
        "pid": 341500,
        "level": 2,
        "name": "舒城县"
    },
    {
        "id": 341522,
        "code": 341522,
        "pid": 341500,
        "level": 2,
        "name": "霍邱县"
    },
    {
        "id": 341525,
        "code": 341525,
        "pid": 341500,
        "level": 2,
        "name": "霍山县"
    },
    {
        "id": 341524,
        "code": 341524,
        "pid": 341500,
        "level": 2,
        "name": "金寨县"
    },
    {
        "id": 340700,
        "code": 340700,
        "pid": 340000,
        "level": 1,
        "name": "铜陵市"
    },
    {
        "id": 340722,
        "code": 340722,
        "pid": 340700,
        "level": 2,
        "name": "枞阳县"
    },
    {
        "id": 340705,
        "code": 340705,
        "pid": 340700,
        "level": 2,
        "name": "铜官区"
    },
    {
        "id": 340706,
        "code": 340706,
        "pid": 340700,
        "level": 2,
        "name": "义安区"
    },
    {
        "id": 340711,
        "code": 340711,
        "pid": 340700,
        "level": 2,
        "name": "郊区"
    },
    {
        "id": 341700,
        "code": 341700,
        "pid": 340000,
        "level": 1,
        "name": "池州市"
    },
    {
        "id": 341721,
        "code": 341721,
        "pid": 341700,
        "level": 2,
        "name": "东至县"
    },
    {
        "id": 341702,
        "code": 341702,
        "pid": 341700,
        "level": 2,
        "name": "贵池区"
    },
    {
        "id": 341723,
        "code": 341723,
        "pid": 341700,
        "level": 2,
        "name": "青阳县"
    },
    {
        "id": 341722,
        "code": 341722,
        "pid": 341700,
        "level": 2,
        "name": "石台县"
    },
    {
        "id": 341300,
        "code": 341300,
        "pid": 340000,
        "level": 1,
        "name": "宿州市"
    },
    {
        "id": 341324,
        "code": 341324,
        "pid": 341300,
        "level": 2,
        "name": "泗县"
    },
    {
        "id": 341321,
        "code": 341321,
        "pid": 341300,
        "level": 2,
        "name": "砀山县"
    },
    {
        "id": 341302,
        "code": 341302,
        "pid": 341300,
        "level": 2,
        "name": "埇桥区"
    },
    {
        "id": 341323,
        "code": 341323,
        "pid": 341300,
        "level": 2,
        "name": "灵璧县"
    },
    {
        "id": 341322,
        "code": 341322,
        "pid": 341300,
        "level": 2,
        "name": "萧县"
    },
    {
        "id": 340400,
        "code": 340400,
        "pid": 340000,
        "level": 1,
        "name": "淮南市"
    },
    {
        "id": 340421,
        "code": 340421,
        "pid": 340400,
        "level": 2,
        "name": "凤台县"
    },
    {
        "id": 340422,
        "code": 340422,
        "pid": 340400,
        "level": 2,
        "name": "寿县"
    },
    {
        "id": 340406,
        "code": 340406,
        "pid": 340400,
        "level": 2,
        "name": "潘集区"
    },
    {
        "id": 340405,
        "code": 340405,
        "pid": 340400,
        "level": 2,
        "name": "八公山区"
    },
    {
        "id": 340404,
        "code": 340404,
        "pid": 340400,
        "level": 2,
        "name": "谢家集区"
    },
    {
        "id": 340403,
        "code": 340403,
        "pid": 340400,
        "level": 2,
        "name": "田家庵区"
    },
    {
        "id": 340402,
        "code": 340402,
        "pid": 340400,
        "level": 2,
        "name": "大通区"
    },
    {
        "id": 630000,
        "code": 630000,
        "pid": 0,
        "level": 0,
        "name": "青海省"
    },
    {
        "id": 632500,
        "code": 632500,
        "pid": 630000,
        "level": 1,
        "name": "海南藏族自治州"
    },
    {
        "id": 632524,
        "code": 632524,
        "pid": 632500,
        "level": 2,
        "name": "兴海县"
    },
    {
        "id": 632525,
        "code": 632525,
        "pid": 632500,
        "level": 2,
        "name": "贵南县"
    },
    {
        "id": 632522,
        "code": 632522,
        "pid": 632500,
        "level": 2,
        "name": "同德县"
    },
    {
        "id": 632523,
        "code": 632523,
        "pid": 632500,
        "level": 2,
        "name": "贵德县"
    },
    {
        "id": 632521,
        "code": 632521,
        "pid": 632500,
        "level": 2,
        "name": "共和县"
    },
    {
        "id": 632700,
        "code": 632700,
        "pid": 630000,
        "level": 1,
        "name": "玉树藏族自治州"
    },
    {
        "id": 632701,
        "code": 632701,
        "pid": 632700,
        "level": 2,
        "name": "玉树市"
    },
    {
        "id": 632724,
        "code": 632724,
        "pid": 632700,
        "level": 2,
        "name": "治多县"
    },
    {
        "id": 632725,
        "code": 632725,
        "pid": 632700,
        "level": 2,
        "name": "囊谦县"
    },
    {
        "id": 632726,
        "code": 632726,
        "pid": 632700,
        "level": 2,
        "name": "曲麻莱县"
    },
    {
        "id": 632722,
        "code": 632722,
        "pid": 632700,
        "level": 2,
        "name": "杂多县"
    },
    {
        "id": 632723,
        "code": 632723,
        "pid": 632700,
        "level": 2,
        "name": "称多县"
    },
    {
        "id": 632200,
        "code": 632200,
        "pid": 630000,
        "level": 1,
        "name": "海北藏族自治州"
    },
    {
        "id": 632224,
        "code": 632224,
        "pid": 632200,
        "level": 2,
        "name": "刚察县"
    },
    {
        "id": 632221,
        "code": 632221,
        "pid": 632200,
        "level": 2,
        "name": "门源回族自治县"
    },
    {
        "id": 632223,
        "code": 632223,
        "pid": 632200,
        "level": 2,
        "name": "海晏县"
    },
    {
        "id": 632222,
        "code": 632222,
        "pid": 632200,
        "level": 2,
        "name": "祁连县"
    },
    {
        "id": 630200,
        "code": 630200,
        "pid": 630000,
        "level": 1,
        "name": "海东市"
    },
    {
        "id": 630203,
        "code": 630203,
        "pid": 630200,
        "level": 2,
        "name": "平安区"
    },
    {
        "id": 630202,
        "code": 630202,
        "pid": 630200,
        "level": 2,
        "name": "乐都区"
    },
    {
        "id": 630225,
        "code": 630225,
        "pid": 630200,
        "level": 2,
        "name": "循化撒拉族自治县"
    },
    {
        "id": 630224,
        "code": 630224,
        "pid": 630200,
        "level": 2,
        "name": "化隆回族自治县"
    },
    {
        "id": 630223,
        "code": 630223,
        "pid": 630200,
        "level": 2,
        "name": "互助土族自治县"
    },
    {
        "id": 630222,
        "code": 630222,
        "pid": 630200,
        "level": 2,
        "name": "民和回族土族自治县"
    },
    {
        "id": 632300,
        "code": 632300,
        "pid": 630000,
        "level": 1,
        "name": "黄南藏族自治州"
    },
    {
        "id": 632321,
        "code": 632321,
        "pid": 632300,
        "level": 2,
        "name": "同仁县"
    },
    {
        "id": 632322,
        "code": 632322,
        "pid": 632300,
        "level": 2,
        "name": "尖扎县"
    },
    {
        "id": 632323,
        "code": 632323,
        "pid": 632300,
        "level": 2,
        "name": "泽库县"
    },
    {
        "id": 632324,
        "code": 632324,
        "pid": 632300,
        "level": 2,
        "name": "河南蒙古族自治县"
    },
    {
        "id": 632600,
        "code": 632600,
        "pid": 630000,
        "level": 1,
        "name": "果洛藏族自治州"
    },
    {
        "id": 632621,
        "code": 632621,
        "pid": 632600,
        "level": 2,
        "name": "玛沁县"
    },
    {
        "id": 632623,
        "code": 632623,
        "pid": 632600,
        "level": 2,
        "name": "甘德县"
    },
    {
        "id": 632622,
        "code": 632622,
        "pid": 632600,
        "level": 2,
        "name": "班玛县"
    },
    {
        "id": 632625,
        "code": 632625,
        "pid": 632600,
        "level": 2,
        "name": "久治县"
    },
    {
        "id": 632624,
        "code": 632624,
        "pid": 632600,
        "level": 2,
        "name": "达日县"
    },
    {
        "id": 632626,
        "code": 632626,
        "pid": 632600,
        "level": 2,
        "name": "玛多县"
    },
    {
        "id": 630100,
        "code": 630100,
        "pid": 630000,
        "level": 1,
        "name": "西宁市"
    },
    {
        "id": 630105,
        "code": 630105,
        "pid": 630100,
        "level": 2,
        "name": "城北区"
    },
    {
        "id": 630104,
        "code": 630104,
        "pid": 630100,
        "level": 2,
        "name": "城西区"
    },
    {
        "id": 630121,
        "code": 630121,
        "pid": 630100,
        "level": 2,
        "name": "大通回族土族自治县"
    },
    {
        "id": 630122,
        "code": 630122,
        "pid": 630100,
        "level": 2,
        "name": "湟中县"
    },
    {
        "id": 630123,
        "code": 630123,
        "pid": 630100,
        "level": 2,
        "name": "湟源县"
    },
    {
        "id": 630102,
        "code": 630102,
        "pid": 630100,
        "level": 2,
        "name": "城东区"
    },
    {
        "id": 630103,
        "code": 630103,
        "pid": 630100,
        "level": 2,
        "name": "城中区"
    },
    {
        "id": 632800,
        "code": 632800,
        "pid": 630000,
        "level": 1,
        "name": "海西蒙古族藏族自治州"
    },
    {
        "id": 632823,
        "code": 632823,
        "pid": 632800,
        "level": 2,
        "name": "天峻县"
    },
    {
        "id": 632801,
        "code": 632801,
        "pid": 632800,
        "level": 2,
        "name": "格尔木市"
    },
    {
        "id": 632822,
        "code": 632822,
        "pid": 632800,
        "level": 2,
        "name": "都兰县"
    },
    {
        "id": 632821,
        "code": 632821,
        "pid": 632800,
        "level": 2,
        "name": "乌兰县"
    },
    {
        "id": 632802,
        "code": 632802,
        "pid": 632800,
        "level": 2,
        "name": "德令哈市"
    },
    {
        "id": 530000,
        "code": 530000,
        "pid": 0,
        "level": 0,
        "name": "云南省"
    },
    {
        "id": 533300,
        "code": 533300,
        "pid": 530000,
        "level": 1,
        "name": "怒江傈僳族自治州"
    },
    {
        "id": 533301,
        "code": 533301,
        "pid": 533300,
        "level": 2,
        "name": "泸水市"
    },
    {
        "id": 533324,
        "code": 533324,
        "pid": 533300,
        "level": 2,
        "name": "贡山独龙族怒族自治县"
    },
    {
        "id": 533325,
        "code": 533325,
        "pid": 533300,
        "level": 2,
        "name": "兰坪白族普米族自治县"
    },
    {
        "id": 533323,
        "code": 533323,
        "pid": 533300,
        "level": 2,
        "name": "福贡县"
    },
    {
        "id": 530300,
        "code": 530300,
        "pid": 530000,
        "level": 1,
        "name": "曲靖市"
    },
    {
        "id": 530303,
        "code": 530303,
        "pid": 530300,
        "level": 2,
        "name": "沾益区"
    },
    {
        "id": 530302,
        "code": 530302,
        "pid": 530300,
        "level": 2,
        "name": "麒麟区"
    },
    {
        "id": 530381,
        "code": 530381,
        "pid": 530300,
        "level": 2,
        "name": "宣威市"
    },
    {
        "id": 530322,
        "code": 530322,
        "pid": 530300,
        "level": 2,
        "name": "陆良县"
    },
    {
        "id": 530321,
        "code": 530321,
        "pid": 530300,
        "level": 2,
        "name": "马龙县"
    },
    {
        "id": 530326,
        "code": 530326,
        "pid": 530300,
        "level": 2,
        "name": "会泽县"
    },
    {
        "id": 530325,
        "code": 530325,
        "pid": 530300,
        "level": 2,
        "name": "富源县"
    },
    {
        "id": 530324,
        "code": 530324,
        "pid": 530300,
        "level": 2,
        "name": "罗平县"
    },
    {
        "id": 530323,
        "code": 530323,
        "pid": 530300,
        "level": 2,
        "name": "师宗县"
    },
    {
        "id": 530800,
        "code": 530800,
        "pid": 530000,
        "level": 1,
        "name": "普洱市"
    },
    {
        "id": 530802,
        "code": 530802,
        "pid": 530800,
        "level": 2,
        "name": "思茅区"
    },
    {
        "id": 530828,
        "code": 530828,
        "pid": 530800,
        "level": 2,
        "name": "澜沧拉祜族自治县"
    },
    {
        "id": 530829,
        "code": 530829,
        "pid": 530800,
        "level": 2,
        "name": "西盟佤族自治县"
    },
    {
        "id": 530824,
        "code": 530824,
        "pid": 530800,
        "level": 2,
        "name": "景谷傣族彝族自治县"
    },
    {
        "id": 530825,
        "code": 530825,
        "pid": 530800,
        "level": 2,
        "name": "镇沅彝族哈尼族拉祜族自治县"
    },
    {
        "id": 530826,
        "code": 530826,
        "pid": 530800,
        "level": 2,
        "name": "江城哈尼族彝族自治县"
    },
    {
        "id": 530827,
        "code": 530827,
        "pid": 530800,
        "level": 2,
        "name": "孟连傣族拉祜族佤族自治县"
    },
    {
        "id": 530821,
        "code": 530821,
        "pid": 530800,
        "level": 2,
        "name": "宁洱哈尼族彝族自治县"
    },
    {
        "id": 530822,
        "code": 530822,
        "pid": 530800,
        "level": 2,
        "name": "墨江哈尼族自治县"
    },
    {
        "id": 530823,
        "code": 530823,
        "pid": 530800,
        "level": 2,
        "name": "景东彝族自治县"
    },
    {
        "id": 530700,
        "code": 530700,
        "pid": 530000,
        "level": 1,
        "name": "丽江市"
    },
    {
        "id": 530724,
        "code": 530724,
        "pid": 530700,
        "level": 2,
        "name": "宁蒗彝族自治县"
    },
    {
        "id": 530723,
        "code": 530723,
        "pid": 530700,
        "level": 2,
        "name": "华坪县"
    },
    {
        "id": 530722,
        "code": 530722,
        "pid": 530700,
        "level": 2,
        "name": "永胜县"
    },
    {
        "id": 530721,
        "code": 530721,
        "pid": 530700,
        "level": 2,
        "name": "玉龙纳西族自治县"
    },
    {
        "id": 530702,
        "code": 530702,
        "pid": 530700,
        "level": 2,
        "name": "古城区"
    },
    {
        "id": 532500,
        "code": 532500,
        "pid": 530000,
        "level": 1,
        "name": "红河哈尼族彝族自治州"
    },
    {
        "id": 532532,
        "code": 532532,
        "pid": 532500,
        "level": 2,
        "name": "河口瑶族自治县"
    },
    {
        "id": 532501,
        "code": 532501,
        "pid": 532500,
        "level": 2,
        "name": "个旧市"
    },
    {
        "id": 532503,
        "code": 532503,
        "pid": 532500,
        "level": 2,
        "name": "蒙自市"
    },
    {
        "id": 532502,
        "code": 532502,
        "pid": 532500,
        "level": 2,
        "name": "开远市"
    },
    {
        "id": 532504,
        "code": 532504,
        "pid": 532500,
        "level": 2,
        "name": "弥勒市"
    },
    {
        "id": 532523,
        "code": 532523,
        "pid": 532500,
        "level": 2,
        "name": "屏边苗族自治县"
    },
    {
        "id": 532527,
        "code": 532527,
        "pid": 532500,
        "level": 2,
        "name": "泸西县"
    },
    {
        "id": 532531,
        "code": 532531,
        "pid": 532500,
        "level": 2,
        "name": "绿春县"
    },
    {
        "id": 532525,
        "code": 532525,
        "pid": 532500,
        "level": 2,
        "name": "石屏县"
    },
    {
        "id": 532524,
        "code": 532524,
        "pid": 532500,
        "level": 2,
        "name": "建水县"
    },
    {
        "id": 532530,
        "code": 532530,
        "pid": 532500,
        "level": 2,
        "name": "金平苗族瑶族傣族自治县"
    },
    {
        "id": 532529,
        "code": 532529,
        "pid": 532500,
        "level": 2,
        "name": "红河县"
    },
    {
        "id": 532528,
        "code": 532528,
        "pid": 532500,
        "level": 2,
        "name": "元阳县"
    },
    {
        "id": 530900,
        "code": 530900,
        "pid": 530000,
        "level": 1,
        "name": "临沧市"
    },
    {
        "id": 530921,
        "code": 530921,
        "pid": 530900,
        "level": 2,
        "name": "凤庆县"
    },
    {
        "id": 530923,
        "code": 530923,
        "pid": 530900,
        "level": 2,
        "name": "永德县"
    },
    {
        "id": 530922,
        "code": 530922,
        "pid": 530900,
        "level": 2,
        "name": "云县"
    },
    {
        "id": 530925,
        "code": 530925,
        "pid": 530900,
        "level": 2,
        "name": "双江拉祜族佤族布朗族傣族自治县"
    },
    {
        "id": 530924,
        "code": 530924,
        "pid": 530900,
        "level": 2,
        "name": "镇康县"
    },
    {
        "id": 530927,
        "code": 530927,
        "pid": 530900,
        "level": 2,
        "name": "沧源佤族自治县"
    },
    {
        "id": 530926,
        "code": 530926,
        "pid": 530900,
        "level": 2,
        "name": "耿马傣族佤族自治县"
    },
    {
        "id": 530902,
        "code": 530902,
        "pid": 530900,
        "level": 2,
        "name": "临翔区"
    },
    {
        "id": 532800,
        "code": 532800,
        "pid": 530000,
        "level": 1,
        "name": "西双版纳傣族自治州"
    },
    {
        "id": 532822,
        "code": 532822,
        "pid": 532800,
        "level": 2,
        "name": "勐海县"
    },
    {
        "id": 532823,
        "code": 532823,
        "pid": 532800,
        "level": 2,
        "name": "勐腊县"
    },
    {
        "id": 532801,
        "code": 532801,
        "pid": 532800,
        "level": 2,
        "name": "景洪市"
    },
    {
        "id": 532600,
        "code": 532600,
        "pid": 530000,
        "level": 1,
        "name": "文山壮族苗族自治州"
    },
    {
        "id": 532601,
        "code": 532601,
        "pid": 532600,
        "level": 2,
        "name": "文山市"
    },
    {
        "id": 532628,
        "code": 532628,
        "pid": 532600,
        "level": 2,
        "name": "富宁县"
    },
    {
        "id": 532624,
        "code": 532624,
        "pid": 532600,
        "level": 2,
        "name": "麻栗坡县"
    },
    {
        "id": 532625,
        "code": 532625,
        "pid": 532600,
        "level": 2,
        "name": "马关县"
    },
    {
        "id": 532626,
        "code": 532626,
        "pid": 532600,
        "level": 2,
        "name": "丘北县"
    },
    {
        "id": 532627,
        "code": 532627,
        "pid": 532600,
        "level": 2,
        "name": "广南县"
    },
    {
        "id": 532622,
        "code": 532622,
        "pid": 532600,
        "level": 2,
        "name": "砚山县"
    },
    {
        "id": 532623,
        "code": 532623,
        "pid": 532600,
        "level": 2,
        "name": "西畴县"
    },
    {
        "id": 530400,
        "code": 530400,
        "pid": 530000,
        "level": 1,
        "name": "玉溪市"
    },
    {
        "id": 530428,
        "code": 530428,
        "pid": 530400,
        "level": 2,
        "name": "元江哈尼族彝族傣族自治县"
    },
    {
        "id": 530402,
        "code": 530402,
        "pid": 530400,
        "level": 2,
        "name": "红塔区"
    },
    {
        "id": 530422,
        "code": 530422,
        "pid": 530400,
        "level": 2,
        "name": "澄江县"
    },
    {
        "id": 530423,
        "code": 530423,
        "pid": 530400,
        "level": 2,
        "name": "通海县"
    },
    {
        "id": 530424,
        "code": 530424,
        "pid": 530400,
        "level": 2,
        "name": "华宁县"
    },
    {
        "id": 530403,
        "code": 530403,
        "pid": 530400,
        "level": 2,
        "name": "江川区"
    },
    {
        "id": 530426,
        "code": 530426,
        "pid": 530400,
        "level": 2,
        "name": "峨山彝族自治县"
    },
    {
        "id": 530425,
        "code": 530425,
        "pid": 530400,
        "level": 2,
        "name": "易门县"
    },
    {
        "id": 530427,
        "code": 530427,
        "pid": 530400,
        "level": 2,
        "name": "新平彝族傣族自治县"
    },
    {
        "id": 533100,
        "code": 533100,
        "pid": 530000,
        "level": 1,
        "name": "德宏傣族景颇族自治州"
    },
    {
        "id": 533124,
        "code": 533124,
        "pid": 533100,
        "level": 2,
        "name": "陇川县"
    },
    {
        "id": 533102,
        "code": 533102,
        "pid": 533100,
        "level": 2,
        "name": "瑞丽市"
    },
    {
        "id": 533103,
        "code": 533103,
        "pid": 533100,
        "level": 2,
        "name": "芒市"
    },
    {
        "id": 533122,
        "code": 533122,
        "pid": 533100,
        "level": 2,
        "name": "梁河县"
    },
    {
        "id": 533123,
        "code": 533123,
        "pid": 533100,
        "level": 2,
        "name": "盈江县"
    },
    {
        "id": 530100,
        "code": 530100,
        "pid": 530000,
        "level": 1,
        "name": "昆明市"
    },
    {
        "id": 530129,
        "code": 530129,
        "pid": 530100,
        "level": 2,
        "name": "寻甸回族彝族自治县"
    },
    {
        "id": 530128,
        "code": 530128,
        "pid": 530100,
        "level": 2,
        "name": "禄劝彝族苗族自治县"
    },
    {
        "id": 530103,
        "code": 530103,
        "pid": 530100,
        "level": 2,
        "name": "盘龙区"
    },
    {
        "id": 530181,
        "code": 530181,
        "pid": 530100,
        "level": 2,
        "name": "安宁市"
    },
    {
        "id": 530122,
        "code": 530122,
        "pid": 530100,
        "level": 2,
        "name": "晋宁县"
    },
    {
        "id": 530125,
        "code": 530125,
        "pid": 530100,
        "level": 2,
        "name": "宜良县"
    },
    {
        "id": 530124,
        "code": 530124,
        "pid": 530100,
        "level": 2,
        "name": "富民县"
    },
    {
        "id": 530127,
        "code": 530127,
        "pid": 530100,
        "level": 2,
        "name": "嵩明县"
    },
    {
        "id": 530126,
        "code": 530126,
        "pid": 530100,
        "level": 2,
        "name": "石林彝族自治县"
    },
    {
        "id": 530114,
        "code": 530114,
        "pid": 530100,
        "level": 2,
        "name": "呈贡区"
    },
    {
        "id": 530102,
        "code": 530102,
        "pid": 530100,
        "level": 2,
        "name": "五华区"
    },
    {
        "id": 530111,
        "code": 530111,
        "pid": 530100,
        "level": 2,
        "name": "官渡区"
    },
    {
        "id": 530112,
        "code": 530112,
        "pid": 530100,
        "level": 2,
        "name": "西山区"
    },
    {
        "id": 530113,
        "code": 530113,
        "pid": 530100,
        "level": 2,
        "name": "东川区"
    },
    {
        "id": 532900,
        "code": 532900,
        "pid": 530000,
        "level": 1,
        "name": "大理白族自治州"
    },
    {
        "id": 532930,
        "code": 532930,
        "pid": 532900,
        "level": 2,
        "name": "洱源县"
    },
    {
        "id": 532931,
        "code": 532931,
        "pid": 532900,
        "level": 2,
        "name": "剑川县"
    },
    {
        "id": 532932,
        "code": 532932,
        "pid": 532900,
        "level": 2,
        "name": "鹤庆县"
    },
    {
        "id": 532901,
        "code": 532901,
        "pid": 532900,
        "level": 2,
        "name": "大理市"
    },
    {
        "id": 532929,
        "code": 532929,
        "pid": 532900,
        "level": 2,
        "name": "云龙县"
    },
    {
        "id": 532928,
        "code": 532928,
        "pid": 532900,
        "level": 2,
        "name": "永平县"
    },
    {
        "id": 532927,
        "code": 532927,
        "pid": 532900,
        "level": 2,
        "name": "巍山彝族回族自治县"
    },
    {
        "id": 532926,
        "code": 532926,
        "pid": 532900,
        "level": 2,
        "name": "南涧彝族自治县"
    },
    {
        "id": 532925,
        "code": 532925,
        "pid": 532900,
        "level": 2,
        "name": "弥渡县"
    },
    {
        "id": 532924,
        "code": 532924,
        "pid": 532900,
        "level": 2,
        "name": "宾川县"
    },
    {
        "id": 532923,
        "code": 532923,
        "pid": 532900,
        "level": 2,
        "name": "祥云县"
    },
    {
        "id": 532922,
        "code": 532922,
        "pid": 532900,
        "level": 2,
        "name": "漾濞彝族自治县"
    },
    {
        "id": 530500,
        "code": 530500,
        "pid": 530000,
        "level": 1,
        "name": "保山市"
    },
    {
        "id": 530524,
        "code": 530524,
        "pid": 530500,
        "level": 2,
        "name": "昌宁县"
    },
    {
        "id": 530521,
        "code": 530521,
        "pid": 530500,
        "level": 2,
        "name": "施甸县"
    },
    {
        "id": 530581,
        "code": 530581,
        "pid": 530500,
        "level": 2,
        "name": "腾冲市"
    },
    {
        "id": 530523,
        "code": 530523,
        "pid": 530500,
        "level": 2,
        "name": "龙陵县"
    },
    {
        "id": 530502,
        "code": 530502,
        "pid": 530500,
        "level": 2,
        "name": "隆阳区"
    },
    {
        "id": 533400,
        "code": 533400,
        "pid": 530000,
        "level": 1,
        "name": "迪庆藏族自治州"
    },
    {
        "id": 533423,
        "code": 533423,
        "pid": 533400,
        "level": 2,
        "name": "维西傈僳族自治县"
    },
    {
        "id": 533401,
        "code": 533401,
        "pid": 533400,
        "level": 2,
        "name": "香格里拉市"
    },
    {
        "id": 533422,
        "code": 533422,
        "pid": 533400,
        "level": 2,
        "name": "德钦县"
    },
    {
        "id": 530600,
        "code": 530600,
        "pid": 530000,
        "level": 1,
        "name": "昭通市"
    },
    {
        "id": 530623,
        "code": 530623,
        "pid": 530600,
        "level": 2,
        "name": "盐津县"
    },
    {
        "id": 530622,
        "code": 530622,
        "pid": 530600,
        "level": 2,
        "name": "巧家县"
    },
    {
        "id": 530630,
        "code": 530630,
        "pid": 530600,
        "level": 2,
        "name": "水富县"
    },
    {
        "id": 530621,
        "code": 530621,
        "pid": 530600,
        "level": 2,
        "name": "鲁甸县"
    },
    {
        "id": 530626,
        "code": 530626,
        "pid": 530600,
        "level": 2,
        "name": "绥江县"
    },
    {
        "id": 530627,
        "code": 530627,
        "pid": 530600,
        "level": 2,
        "name": "镇雄县"
    },
    {
        "id": 530624,
        "code": 530624,
        "pid": 530600,
        "level": 2,
        "name": "大关县"
    },
    {
        "id": 530625,
        "code": 530625,
        "pid": 530600,
        "level": 2,
        "name": "永善县"
    },
    {
        "id": 530628,
        "code": 530628,
        "pid": 530600,
        "level": 2,
        "name": "彝良县"
    },
    {
        "id": 530629,
        "code": 530629,
        "pid": 530600,
        "level": 2,
        "name": "威信县"
    },
    {
        "id": 530602,
        "code": 530602,
        "pid": 530600,
        "level": 2,
        "name": "昭阳区"
    },
    {
        "id": 532300,
        "code": 532300,
        "pid": 530000,
        "level": 1,
        "name": "楚雄彝族自治州"
    },
    {
        "id": 532331,
        "code": 532331,
        "pid": 532300,
        "level": 2,
        "name": "禄丰县"
    },
    {
        "id": 532325,
        "code": 532325,
        "pid": 532300,
        "level": 2,
        "name": "姚安县"
    },
    {
        "id": 532324,
        "code": 532324,
        "pid": 532300,
        "level": 2,
        "name": "南华县"
    },
    {
        "id": 532327,
        "code": 532327,
        "pid": 532300,
        "level": 2,
        "name": "永仁县"
    },
    {
        "id": 532326,
        "code": 532326,
        "pid": 532300,
        "level": 2,
        "name": "大姚县"
    },
    {
        "id": 532323,
        "code": 532323,
        "pid": 532300,
        "level": 2,
        "name": "牟定县"
    },
    {
        "id": 532322,
        "code": 532322,
        "pid": 532300,
        "level": 2,
        "name": "双柏县"
    },
    {
        "id": 532329,
        "code": 532329,
        "pid": 532300,
        "level": 2,
        "name": "武定县"
    },
    {
        "id": 532328,
        "code": 532328,
        "pid": 532300,
        "level": 2,
        "name": "元谋县"
    },
    {
        "id": 532301,
        "code": 532301,
        "pid": 532300,
        "level": 2,
        "name": "楚雄市"
    },
    {
        "id": 310000,
        "code": 310000,
        "pid": 0,
        "level": 0,
        "name": "上海市"
    },
    {
        "id": 310100,
        "code": 310100,
        "pid": 310000,
        "level": 1,
        "name": "市辖区"
    },
    {
        "id": 310118,
        "code": 310118,
        "pid": 310100,
        "level": 2,
        "name": "青浦区"
    },
    {
        "id": 310110,
        "code": 310110,
        "pid": 310100,
        "level": 2,
        "name": "杨浦区"
    },
    {
        "id": 310112,
        "code": 310112,
        "pid": 310100,
        "level": 2,
        "name": "闵行区"
    },
    {
        "id": 310113,
        "code": 310113,
        "pid": 310100,
        "level": 2,
        "name": "宝山区"
    },
    {
        "id": 310114,
        "code": 310114,
        "pid": 310100,
        "level": 2,
        "name": "嘉定区"
    },
    {
        "id": 310115,
        "code": 310115,
        "pid": 310100,
        "level": 2,
        "name": "浦东新区"
    },
    {
        "id": 310116,
        "code": 310116,
        "pid": 310100,
        "level": 2,
        "name": "金山区"
    },
    {
        "id": 310117,
        "code": 310117,
        "pid": 310100,
        "level": 2,
        "name": "松江区"
    },
    {
        "id": 310107,
        "code": 310107,
        "pid": 310100,
        "level": 2,
        "name": "普陀区"
    },
    {
        "id": 310106,
        "code": 310106,
        "pid": 310100,
        "level": 2,
        "name": "静安区"
    },
    {
        "id": 310105,
        "code": 310105,
        "pid": 310100,
        "level": 2,
        "name": "长宁区"
    },
    {
        "id": 310104,
        "code": 310104,
        "pid": 310100,
        "level": 2,
        "name": "徐汇区"
    },
    {
        "id": 310101,
        "code": 310101,
        "pid": 310100,
        "level": 2,
        "name": "黄浦区"
    },
    {
        "id": 310120,
        "code": 310120,
        "pid": 310100,
        "level": 2,
        "name": "奉贤区"
    },
    {
        "id": 310151,
        "code": 310151,
        "pid": 310100,
        "level": 2,
        "name": "崇明区"
    },
    {
        "id": 310109,
        "code": 310109,
        "pid": 310100,
        "level": 2,
        "name": "虹口区"
    },
    {
        "id": 810000,
        "code": 810000,
        "pid": 0,
        "level": 0,
        "name": "香港特别行政区"
    },
    {
        "id": 820000,
        "code": 820000,
        "pid": 0,
        "level": 0,
        "name": "澳门特别行政区"
    },
    {
        "id": 540000,
        "code": 540000,
        "pid": 0,
        "level": 0,
        "name": "西藏自治区"
    },
    {
        "id": 540300,
        "code": 540300,
        "pid": 540000,
        "level": 1,
        "name": "昌都市"
    },
    {
        "id": 540321,
        "code": 540321,
        "pid": 540300,
        "level": 2,
        "name": "江达县"
    },
    {
        "id": 540322,
        "code": 540322,
        "pid": 540300,
        "level": 2,
        "name": "贡觉县"
    },
    {
        "id": 540323,
        "code": 540323,
        "pid": 540300,
        "level": 2,
        "name": "类乌齐县"
    },
    {
        "id": 540324,
        "code": 540324,
        "pid": 540300,
        "level": 2,
        "name": "丁青县"
    },
    {
        "id": 540325,
        "code": 540325,
        "pid": 540300,
        "level": 2,
        "name": "察雅县"
    },
    {
        "id": 540326,
        "code": 540326,
        "pid": 540300,
        "level": 2,
        "name": "八宿县"
    },
    {
        "id": 540327,
        "code": 540327,
        "pid": 540300,
        "level": 2,
        "name": "左贡县"
    },
    {
        "id": 540328,
        "code": 540328,
        "pid": 540300,
        "level": 2,
        "name": "芒康县"
    },
    {
        "id": 540329,
        "code": 540329,
        "pid": 540300,
        "level": 2,
        "name": "洛隆县"
    },
    {
        "id": 540330,
        "code": 540330,
        "pid": 540300,
        "level": 2,
        "name": "边坝县"
    },
    {
        "id": 540302,
        "code": 540302,
        "pid": 540300,
        "level": 2,
        "name": "卡若区"
    },
    {
        "id": 542500,
        "code": 542500,
        "pid": 540000,
        "level": 1,
        "name": "阿里地区"
    },
    {
        "id": 542524,
        "code": 542524,
        "pid": 542500,
        "level": 2,
        "name": "日土县"
    },
    {
        "id": 542525,
        "code": 542525,
        "pid": 542500,
        "level": 2,
        "name": "革吉县"
    },
    {
        "id": 542526,
        "code": 542526,
        "pid": 542500,
        "level": 2,
        "name": "改则县"
    },
    {
        "id": 542527,
        "code": 542527,
        "pid": 542500,
        "level": 2,
        "name": "措勤县"
    },
    {
        "id": 542521,
        "code": 542521,
        "pid": 542500,
        "level": 2,
        "name": "普兰县"
    },
    {
        "id": 542522,
        "code": 542522,
        "pid": 542500,
        "level": 2,
        "name": "札达县"
    },
    {
        "id": 542523,
        "code": 542523,
        "pid": 542500,
        "level": 2,
        "name": "噶尔县"
    },
    {
        "id": 540200,
        "code": 540200,
        "pid": 540000,
        "level": 1,
        "name": "日喀则市"
    },
    {
        "id": 540225,
        "code": 540225,
        "pid": 540200,
        "level": 2,
        "name": "拉孜县"
    },
    {
        "id": 540224,
        "code": 540224,
        "pid": 540200,
        "level": 2,
        "name": "萨迦县"
    },
    {
        "id": 540227,
        "code": 540227,
        "pid": 540200,
        "level": 2,
        "name": "谢通门县"
    },
    {
        "id": 540226,
        "code": 540226,
        "pid": 540200,
        "level": 2,
        "name": "昂仁县"
    },
    {
        "id": 540232,
        "code": 540232,
        "pid": 540200,
        "level": 2,
        "name": "仲巴县"
    },
    {
        "id": 540233,
        "code": 540233,
        "pid": 540200,
        "level": 2,
        "name": "亚东县"
    },
    {
        "id": 540230,
        "code": 540230,
        "pid": 540200,
        "level": 2,
        "name": "康马县"
    },
    {
        "id": 540231,
        "code": 540231,
        "pid": 540200,
        "level": 2,
        "name": "定结县"
    },
    {
        "id": 540236,
        "code": 540236,
        "pid": 540200,
        "level": 2,
        "name": "萨嘎县"
    },
    {
        "id": 540222,
        "code": 540222,
        "pid": 540200,
        "level": 2,
        "name": "江孜县"
    },
    {
        "id": 540229,
        "code": 540229,
        "pid": 540200,
        "level": 2,
        "name": "仁布县"
    },
    {
        "id": 540228,
        "code": 540228,
        "pid": 540200,
        "level": 2,
        "name": "白朗县"
    },
    {
        "id": 540223,
        "code": 540223,
        "pid": 540200,
        "level": 2,
        "name": "定日县"
    },
    {
        "id": 540202,
        "code": 540202,
        "pid": 540200,
        "level": 2,
        "name": "桑珠孜区"
    },
    {
        "id": 540235,
        "code": 540235,
        "pid": 540200,
        "level": 2,
        "name": "聂拉木县"
    },
    {
        "id": 540237,
        "code": 540237,
        "pid": 540200,
        "level": 2,
        "name": "岗巴县"
    },
    {
        "id": 540221,
        "code": 540221,
        "pid": 540200,
        "level": 2,
        "name": "南木林县"
    },
    {
        "id": 540234,
        "code": 540234,
        "pid": 540200,
        "level": 2,
        "name": "吉隆县"
    },
    {
        "id": 540500,
        "code": 540500,
        "pid": 540000,
        "level": 1,
        "name": "山南市"
    },
    {
        "id": 540502,
        "code": 540502,
        "pid": 540500,
        "level": 2,
        "name": "乃东区"
    },
    {
        "id": 540526,
        "code": 540526,
        "pid": 540500,
        "level": 2,
        "name": "措美县"
    },
    {
        "id": 540527,
        "code": 540527,
        "pid": 540500,
        "level": 2,
        "name": "洛扎县"
    },
    {
        "id": 540524,
        "code": 540524,
        "pid": 540500,
        "level": 2,
        "name": "琼结县"
    },
    {
        "id": 540525,
        "code": 540525,
        "pid": 540500,
        "level": 2,
        "name": "曲松县"
    },
    {
        "id": 540522,
        "code": 540522,
        "pid": 540500,
        "level": 2,
        "name": "贡嘎县"
    },
    {
        "id": 540523,
        "code": 540523,
        "pid": 540500,
        "level": 2,
        "name": "桑日县"
    },
    {
        "id": 540521,
        "code": 540521,
        "pid": 540500,
        "level": 2,
        "name": "扎囊县"
    },
    {
        "id": 540531,
        "code": 540531,
        "pid": 540500,
        "level": 2,
        "name": "浪卡子县"
    },
    {
        "id": 540530,
        "code": 540530,
        "pid": 540500,
        "level": 2,
        "name": "错那县"
    },
    {
        "id": 540528,
        "code": 540528,
        "pid": 540500,
        "level": 2,
        "name": "加查县"
    },
    {
        "id": 540529,
        "code": 540529,
        "pid": 540500,
        "level": 2,
        "name": "隆子县"
    },
    {
        "id": 542400,
        "code": 542400,
        "pid": 540000,
        "level": 1,
        "name": "那曲地区"
    },
    {
        "id": 542429,
        "code": 542429,
        "pid": 542400,
        "level": 2,
        "name": "巴青县"
    },
    {
        "id": 542428,
        "code": 542428,
        "pid": 542400,
        "level": 2,
        "name": "班戈县"
    },
    {
        "id": 542431,
        "code": 542431,
        "pid": 542400,
        "level": 2,
        "name": "双湖县"
    },
    {
        "id": 542421,
        "code": 542421,
        "pid": 542400,
        "level": 2,
        "name": "那曲县"
    },
    {
        "id": 542423,
        "code": 542423,
        "pid": 542400,
        "level": 2,
        "name": "比如县"
    },
    {
        "id": 542422,
        "code": 542422,
        "pid": 542400,
        "level": 2,
        "name": "嘉黎县"
    },
    {
        "id": 542425,
        "code": 542425,
        "pid": 542400,
        "level": 2,
        "name": "安多县"
    },
    {
        "id": 542424,
        "code": 542424,
        "pid": 542400,
        "level": 2,
        "name": "聂荣县"
    },
    {
        "id": 542427,
        "code": 542427,
        "pid": 542400,
        "level": 2,
        "name": "索县"
    },
    {
        "id": 542426,
        "code": 542426,
        "pid": 542400,
        "level": 2,
        "name": "申扎县"
    },
    {
        "id": 542430,
        "code": 542430,
        "pid": 542400,
        "level": 2,
        "name": "尼玛县"
    },
    {
        "id": 540100,
        "code": 540100,
        "pid": 540000,
        "level": 1,
        "name": "拉萨市"
    },
    {
        "id": 540122,
        "code": 540122,
        "pid": 540100,
        "level": 2,
        "name": "当雄县"
    },
    {
        "id": 540123,
        "code": 540123,
        "pid": 540100,
        "level": 2,
        "name": "尼木县"
    },
    {
        "id": 540121,
        "code": 540121,
        "pid": 540100,
        "level": 2,
        "name": "林周县"
    },
    {
        "id": 540126,
        "code": 540126,
        "pid": 540100,
        "level": 2,
        "name": "达孜县"
    },
    {
        "id": 540127,
        "code": 540127,
        "pid": 540100,
        "level": 2,
        "name": "墨竹工卡县"
    },
    {
        "id": 540124,
        "code": 540124,
        "pid": 540100,
        "level": 2,
        "name": "曲水县"
    },
    {
        "id": 540102,
        "code": 540102,
        "pid": 540100,
        "level": 2,
        "name": "城关区"
    },
    {
        "id": 540103,
        "code": 540103,
        "pid": 540100,
        "level": 2,
        "name": "堆龙德庆区"
    },
    {
        "id": 540400,
        "code": 540400,
        "pid": 540000,
        "level": 1,
        "name": "林芝市"
    },
    {
        "id": 540423,
        "code": 540423,
        "pid": 540400,
        "level": 2,
        "name": "墨脱县"
    },
    {
        "id": 540422,
        "code": 540422,
        "pid": 540400,
        "level": 2,
        "name": "米林县"
    },
    {
        "id": 540421,
        "code": 540421,
        "pid": 540400,
        "level": 2,
        "name": "工布江达县"
    },
    {
        "id": 540426,
        "code": 540426,
        "pid": 540400,
        "level": 2,
        "name": "朗县"
    },
    {
        "id": 540425,
        "code": 540425,
        "pid": 540400,
        "level": 2,
        "name": "察隅县"
    },
    {
        "id": 540424,
        "code": 540424,
        "pid": 540400,
        "level": 2,
        "name": "波密县"
    },
    {
        "id": 540402,
        "code": 540402,
        "pid": 540400,
        "level": 2,
        "name": "巴宜区"
    },
    {
        "id": 450000,
        "code": 450000,
        "pid": 0,
        "level": 0,
        "name": "广西壮族自治区"
    },
    {
        "id": 450700,
        "code": 450700,
        "pid": 450000,
        "level": 1,
        "name": "钦州市"
    },
    {
        "id": 450702,
        "code": 450702,
        "pid": 450700,
        "level": 2,
        "name": "钦南区"
    },
    {
        "id": 450703,
        "code": 450703,
        "pid": 450700,
        "level": 2,
        "name": "钦北区"
    },
    {
        "id": 450722,
        "code": 450722,
        "pid": 450700,
        "level": 2,
        "name": "浦北县"
    },
    {
        "id": 450721,
        "code": 450721,
        "pid": 450700,
        "level": 2,
        "name": "灵山县"
    },
    {
        "id": 451100,
        "code": 451100,
        "pid": 450000,
        "level": 1,
        "name": "贺州市"
    },
    {
        "id": 451123,
        "code": 451123,
        "pid": 451100,
        "level": 2,
        "name": "富川瑶族自治县"
    },
    {
        "id": 451122,
        "code": 451122,
        "pid": 451100,
        "level": 2,
        "name": "钟山县"
    },
    {
        "id": 451121,
        "code": 451121,
        "pid": 451100,
        "level": 2,
        "name": "昭平县"
    },
    {
        "id": 451102,
        "code": 451102,
        "pid": 451100,
        "level": 2,
        "name": "八步区"
    },
    {
        "id": 451103,
        "code": 451103,
        "pid": 451100,
        "level": 2,
        "name": "平桂区"
    },
    {
        "id": 450300,
        "code": 450300,
        "pid": 450000,
        "level": 1,
        "name": "桂林市"
    },
    {
        "id": 450304,
        "code": 450304,
        "pid": 450300,
        "level": 2,
        "name": "象山区"
    },
    {
        "id": 450305,
        "code": 450305,
        "pid": 450300,
        "level": 2,
        "name": "七星区"
    },
    {
        "id": 450311,
        "code": 450311,
        "pid": 450300,
        "level": 2,
        "name": "雁山区"
    },
    {
        "id": 450332,
        "code": 450332,
        "pid": 450300,
        "level": 2,
        "name": "恭城瑶族自治县"
    },
    {
        "id": 450302,
        "code": 450302,
        "pid": 450300,
        "level": 2,
        "name": "秀峰区"
    },
    {
        "id": 450312,
        "code": 450312,
        "pid": 450300,
        "level": 2,
        "name": "临桂区"
    },
    {
        "id": 450303,
        "code": 450303,
        "pid": 450300,
        "level": 2,
        "name": "叠彩区"
    },
    {
        "id": 450328,
        "code": 450328,
        "pid": 450300,
        "level": 2,
        "name": "龙胜各族自治县"
    },
    {
        "id": 450329,
        "code": 450329,
        "pid": 450300,
        "level": 2,
        "name": "资源县"
    },
    {
        "id": 450330,
        "code": 450330,
        "pid": 450300,
        "level": 2,
        "name": "平乐县"
    },
    {
        "id": 450331,
        "code": 450331,
        "pid": 450300,
        "level": 2,
        "name": "荔浦县"
    },
    {
        "id": 450323,
        "code": 450323,
        "pid": 450300,
        "level": 2,
        "name": "灵川县"
    },
    {
        "id": 450321,
        "code": 450321,
        "pid": 450300,
        "level": 2,
        "name": "阳朔县"
    },
    {
        "id": 450326,
        "code": 450326,
        "pid": 450300,
        "level": 2,
        "name": "永福县"
    },
    {
        "id": 450327,
        "code": 450327,
        "pid": 450300,
        "level": 2,
        "name": "灌阳县"
    },
    {
        "id": 450324,
        "code": 450324,
        "pid": 450300,
        "level": 2,
        "name": "全州县"
    },
    {
        "id": 450325,
        "code": 450325,
        "pid": 450300,
        "level": 2,
        "name": "兴安县"
    },
    {
        "id": 450800,
        "code": 450800,
        "pid": 450000,
        "level": 1,
        "name": "贵港市"
    },
    {
        "id": 450821,
        "code": 450821,
        "pid": 450800,
        "level": 2,
        "name": "平南县"
    },
    {
        "id": 450804,
        "code": 450804,
        "pid": 450800,
        "level": 2,
        "name": "覃塘区"
    },
    {
        "id": 450803,
        "code": 450803,
        "pid": 450800,
        "level": 2,
        "name": "港南区"
    },
    {
        "id": 450802,
        "code": 450802,
        "pid": 450800,
        "level": 2,
        "name": "港北区"
    },
    {
        "id": 450881,
        "code": 450881,
        "pid": 450800,
        "level": 2,
        "name": "桂平市"
    },
    {
        "id": 450600,
        "code": 450600,
        "pid": 450000,
        "level": 1,
        "name": "防城港市"
    },
    {
        "id": 450681,
        "code": 450681,
        "pid": 450600,
        "level": 2,
        "name": "东兴市"
    },
    {
        "id": 450603,
        "code": 450603,
        "pid": 450600,
        "level": 2,
        "name": "防城区"
    },
    {
        "id": 450602,
        "code": 450602,
        "pid": 450600,
        "level": 2,
        "name": "港口区"
    },
    {
        "id": 450621,
        "code": 450621,
        "pid": 450600,
        "level": 2,
        "name": "上思县"
    },
    {
        "id": 451200,
        "code": 451200,
        "pid": 450000,
        "level": 1,
        "name": "河池市"
    },
    {
        "id": 451281,
        "code": 451281,
        "pid": 451200,
        "level": 2,
        "name": "宜州市"
    },
    {
        "id": 451202,
        "code": 451202,
        "pid": 451200,
        "level": 2,
        "name": "金城江区"
    },
    {
        "id": 451224,
        "code": 451224,
        "pid": 451200,
        "level": 2,
        "name": "东兰县"
    },
    {
        "id": 451225,
        "code": 451225,
        "pid": 451200,
        "level": 2,
        "name": "罗城仫佬族自治县"
    },
    {
        "id": 451226,
        "code": 451226,
        "pid": 451200,
        "level": 2,
        "name": "环江毛南族自治县"
    },
    {
        "id": 451227,
        "code": 451227,
        "pid": 451200,
        "level": 2,
        "name": "巴马瑶族自治县"
    },
    {
        "id": 451221,
        "code": 451221,
        "pid": 451200,
        "level": 2,
        "name": "南丹县"
    },
    {
        "id": 451222,
        "code": 451222,
        "pid": 451200,
        "level": 2,
        "name": "天峨县"
    },
    {
        "id": 451223,
        "code": 451223,
        "pid": 451200,
        "level": 2,
        "name": "凤山县"
    },
    {
        "id": 451228,
        "code": 451228,
        "pid": 451200,
        "level": 2,
        "name": "都安瑶族自治县"
    },
    {
        "id": 451229,
        "code": 451229,
        "pid": 451200,
        "level": 2,
        "name": "大化瑶族自治县"
    },
    {
        "id": 450200,
        "code": 450200,
        "pid": 450000,
        "level": 1,
        "name": "柳州市"
    },
    {
        "id": 450205,
        "code": 450205,
        "pid": 450200,
        "level": 2,
        "name": "柳北区"
    },
    {
        "id": 450204,
        "code": 450204,
        "pid": 450200,
        "level": 2,
        "name": "柳南区"
    },
    {
        "id": 450206,
        "code": 450206,
        "pid": 450200,
        "level": 2,
        "name": "柳江区"
    },
    {
        "id": 450203,
        "code": 450203,
        "pid": 450200,
        "level": 2,
        "name": "鱼峰区"
    },
    {
        "id": 450202,
        "code": 450202,
        "pid": 450200,
        "level": 2,
        "name": "城中区"
    },
    {
        "id": 450226,
        "code": 450226,
        "pid": 450200,
        "level": 2,
        "name": "三江侗族自治县"
    },
    {
        "id": 450225,
        "code": 450225,
        "pid": 450200,
        "level": 2,
        "name": "融水苗族自治县"
    },
    {
        "id": 450224,
        "code": 450224,
        "pid": 450200,
        "level": 2,
        "name": "融安县"
    },
    {
        "id": 450223,
        "code": 450223,
        "pid": 450200,
        "level": 2,
        "name": "鹿寨县"
    },
    {
        "id": 450222,
        "code": 450222,
        "pid": 450200,
        "level": 2,
        "name": "柳城县"
    },
    {
        "id": 450500,
        "code": 450500,
        "pid": 450000,
        "level": 1,
        "name": "北海市"
    },
    {
        "id": 450502,
        "code": 450502,
        "pid": 450500,
        "level": 2,
        "name": "海城区"
    },
    {
        "id": 450503,
        "code": 450503,
        "pid": 450500,
        "level": 2,
        "name": "银海区"
    },
    {
        "id": 450512,
        "code": 450512,
        "pid": 450500,
        "level": 2,
        "name": "铁山港区"
    },
    {
        "id": 450521,
        "code": 450521,
        "pid": 450500,
        "level": 2,
        "name": "合浦县"
    },
    {
        "id": 451300,
        "code": 451300,
        "pid": 450000,
        "level": 1,
        "name": "来宾市"
    },
    {
        "id": 451321,
        "code": 451321,
        "pid": 451300,
        "level": 2,
        "name": "忻城县"
    },
    {
        "id": 451381,
        "code": 451381,
        "pid": 451300,
        "level": 2,
        "name": "合山市"
    },
    {
        "id": 451322,
        "code": 451322,
        "pid": 451300,
        "level": 2,
        "name": "象州县"
    },
    {
        "id": 451324,
        "code": 451324,
        "pid": 451300,
        "level": 2,
        "name": "金秀瑶族自治县"
    },
    {
        "id": 451302,
        "code": 451302,
        "pid": 451300,
        "level": 2,
        "name": "兴宾区"
    },
    {
        "id": 451323,
        "code": 451323,
        "pid": 451300,
        "level": 2,
        "name": "武宣县"
    },
    {
        "id": 450100,
        "code": 450100,
        "pid": 450000,
        "level": 1,
        "name": "南宁市"
    },
    {
        "id": 450105,
        "code": 450105,
        "pid": 450100,
        "level": 2,
        "name": "江南区"
    },
    {
        "id": 450110,
        "code": 450110,
        "pid": 450100,
        "level": 2,
        "name": "武鸣区"
    },
    {
        "id": 450107,
        "code": 450107,
        "pid": 450100,
        "level": 2,
        "name": "西乡塘区"
    },
    {
        "id": 450123,
        "code": 450123,
        "pid": 450100,
        "level": 2,
        "name": "隆安县"
    },
    {
        "id": 450102,
        "code": 450102,
        "pid": 450100,
        "level": 2,
        "name": "兴宁区"
    },
    {
        "id": 450125,
        "code": 450125,
        "pid": 450100,
        "level": 2,
        "name": "上林县"
    },
    {
        "id": 450126,
        "code": 450126,
        "pid": 450100,
        "level": 2,
        "name": "宾阳县"
    },
    {
        "id": 450127,
        "code": 450127,
        "pid": 450100,
        "level": 2,
        "name": "横县"
    },
    {
        "id": 450124,
        "code": 450124,
        "pid": 450100,
        "level": 2,
        "name": "马山县"
    },
    {
        "id": 450109,
        "code": 450109,
        "pid": 450100,
        "level": 2,
        "name": "邕宁区"
    },
    {
        "id": 450108,
        "code": 450108,
        "pid": 450100,
        "level": 2,
        "name": "良庆区"
    },
    {
        "id": 450103,
        "code": 450103,
        "pid": 450100,
        "level": 2,
        "name": "青秀区"
    },
    {
        "id": 451000,
        "code": 451000,
        "pid": 450000,
        "level": 1,
        "name": "百色市"
    },
    {
        "id": 451081,
        "code": 451081,
        "pid": 451000,
        "level": 2,
        "name": "靖西市"
    },
    {
        "id": 451002,
        "code": 451002,
        "pid": 451000,
        "level": 2,
        "name": "右江区"
    },
    {
        "id": 451031,
        "code": 451031,
        "pid": 451000,
        "level": 2,
        "name": "隆林各族自治县"
    },
    {
        "id": 451030,
        "code": 451030,
        "pid": 451000,
        "level": 2,
        "name": "西林县"
    },
    {
        "id": 451028,
        "code": 451028,
        "pid": 451000,
        "level": 2,
        "name": "乐业县"
    },
    {
        "id": 451029,
        "code": 451029,
        "pid": 451000,
        "level": 2,
        "name": "田林县"
    },
    {
        "id": 451026,
        "code": 451026,
        "pid": 451000,
        "level": 2,
        "name": "那坡县"
    },
    {
        "id": 451027,
        "code": 451027,
        "pid": 451000,
        "level": 2,
        "name": "凌云县"
    },
    {
        "id": 451024,
        "code": 451024,
        "pid": 451000,
        "level": 2,
        "name": "德保县"
    },
    {
        "id": 451022,
        "code": 451022,
        "pid": 451000,
        "level": 2,
        "name": "田东县"
    },
    {
        "id": 451023,
        "code": 451023,
        "pid": 451000,
        "level": 2,
        "name": "平果县"
    },
    {
        "id": 451021,
        "code": 451021,
        "pid": 451000,
        "level": 2,
        "name": "田阳县"
    },
    {
        "id": 450400,
        "code": 450400,
        "pid": 450000,
        "level": 1,
        "name": "梧州市"
    },
    {
        "id": 450481,
        "code": 450481,
        "pid": 450400,
        "level": 2,
        "name": "岑溪市"
    },
    {
        "id": 450421,
        "code": 450421,
        "pid": 450400,
        "level": 2,
        "name": "苍梧县"
    },
    {
        "id": 450423,
        "code": 450423,
        "pid": 450400,
        "level": 2,
        "name": "蒙山县"
    },
    {
        "id": 450422,
        "code": 450422,
        "pid": 450400,
        "level": 2,
        "name": "藤县"
    },
    {
        "id": 450403,
        "code": 450403,
        "pid": 450400,
        "level": 2,
        "name": "万秀区"
    },
    {
        "id": 450406,
        "code": 450406,
        "pid": 450400,
        "level": 2,
        "name": "龙圩区"
    },
    {
        "id": 450405,
        "code": 450405,
        "pid": 450400,
        "level": 2,
        "name": "长洲区"
    },
    {
        "id": 451400,
        "code": 451400,
        "pid": 450000,
        "level": 1,
        "name": "崇左市"
    },
    {
        "id": 451481,
        "code": 451481,
        "pid": 451400,
        "level": 2,
        "name": "凭祥市"
    },
    {
        "id": 451422,
        "code": 451422,
        "pid": 451400,
        "level": 2,
        "name": "宁明县"
    },
    {
        "id": 451423,
        "code": 451423,
        "pid": 451400,
        "level": 2,
        "name": "龙州县"
    },
    {
        "id": 451421,
        "code": 451421,
        "pid": 451400,
        "level": 2,
        "name": "扶绥县"
    },
    {
        "id": 451424,
        "code": 451424,
        "pid": 451400,
        "level": 2,
        "name": "大新县"
    },
    {
        "id": 451425,
        "code": 451425,
        "pid": 451400,
        "level": 2,
        "name": "天等县"
    },
    {
        "id": 451402,
        "code": 451402,
        "pid": 451400,
        "level": 2,
        "name": "江州区"
    },
    {
        "id": 450900,
        "code": 450900,
        "pid": 450000,
        "level": 1,
        "name": "玉林市"
    },
    {
        "id": 450981,
        "code": 450981,
        "pid": 450900,
        "level": 2,
        "name": "北流市"
    },
    {
        "id": 450902,
        "code": 450902,
        "pid": 450900,
        "level": 2,
        "name": "玉州区"
    },
    {
        "id": 450921,
        "code": 450921,
        "pid": 450900,
        "level": 2,
        "name": "容县"
    },
    {
        "id": 450922,
        "code": 450922,
        "pid": 450900,
        "level": 2,
        "name": "陆川县"
    },
    {
        "id": 450923,
        "code": 450923,
        "pid": 450900,
        "level": 2,
        "name": "博白县"
    },
    {
        "id": 450924,
        "code": 450924,
        "pid": 450900,
        "level": 2,
        "name": "兴业县"
    },
    {
        "id": 450903,
        "code": 450903,
        "pid": 450900,
        "level": 2,
        "name": "福绵区"
    },
    {
        "id": 0,
        "code": 0,
        "pid": 130600,
        "level": 2,
        "name": "高新区"
    }
]